{"id":11340,"date":"2021-11-11T10:23:56","date_gmt":"2021-11-11T10:23:56","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=11340"},"modified":"2021-11-11T13:45:18","modified_gmt":"2021-11-11T13:45:18","slug":"cognitive-coaching","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/cognitive-coaching\/","title":{"rendered":"Cognitive Coaching: our Director explains our unique programme to TES"},"content":{"rendered":"\n<p>At our school, all our staff are trained as cognitive coaches – teachers, receptionists, finance staff: everyone.<\/p>\n\n\n\n<p>This is perhaps not the usual CPD you hear of, but it is a path our school has been following since 2016 and is one I believe has had huge benefits for staff and students.<\/p>\n\n\n\n<p>The first thing to explain is what cognitive coaching is: in its broadest sense it can be understood as being able to actively listen and engage with someone; to ask open-ended questions that encourage deep thinking; to develop problem-solving skills; and to engage in really meaningful conversations, building positive relationships.&nbsp;<\/p>\n\n\n\n<p>This can help someone uncover answers they did not know they had or have the space to articulate something that a more cursory conversation would not allow to happen.<\/p>\n\n\n\n<p><strong>You can read the full interview with our Director, Barry Mansfield, in the <a href=\"https:\/\/www.tes.com\/news\/why-all-our-staff-are-trained-cognitive-coaches\" target=\"_blank\" rel=\"noreferrer noopener\">Times Educational Supplement (TES)<\/a>. <\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"682\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-1024x682.jpg\" alt=\"cognitive coaching training\" class=\"wp-image-11342\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-1024x682.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-300x200.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-768x512.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-1536x1024.jpg 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574-600x400.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC04574.jpg 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<h2>An idea with a difference&nbsp;<\/h2>\n\n\n\n<p>I first became really aware of the potential power of cognitive coaching at a workshop led by the late William Powell. His wife,&nbsp;Ochan Kusuma-Powell, now delivers cognitive coaching training through the&nbsp;<a href=\"https:\/\/www.thinkingcollaborative.com\/\" target=\"_blank\" rel=\"noopener\">Thinking Collaborative<\/a>, an organisation that now supports our training.<\/p>\n\n\n\n<p>I liked the idea because it seemed to ​​offer a meaningful way to change school culture. It provides staff with the skills to engage in proper conversations with each other, and, crucially, with students, by being able to take on a mentor-type role and use the skills of cognitive coaching to do so.<\/p>\n\n\n\n<p>It’s a bold idea, though, and it wasn’t until I moved from working in a more established international school to my current school –&nbsp;<a href=\"https:\/\/halcyonschool.com\/\">Halcyon London International School<\/a>&nbsp;– that I had the opportunity to put it into action.<\/p>\n\n\n\n<p>This was, in part, because Halcyon is a new, not-for-profit school, founded in 2013 with a commitment to innovation and a student-centred ethos. There were none of the usual organisational barriers to introducing an idea like this.<\/p>\n\n\n\n<h2>A big commitment&nbsp;<\/h2>\n\n\n\n<p>This is no small matter because introducing the idea of <a href=\"https:\/\/halcyonschool.com\/student-life\/wellbeing\">cognitive coaching<\/a> and specifically the idea that teachers will use these skills to work as mentors is a big undertaking.<\/p>\n\n\n\n<p>For example, the training course we use from Thinking Collaborative lasts eight days –&nbsp;split into two four-day sessions – which is a huge commitment.<\/p>\n\n\n\n<p>When we first put this to staff there was, as you get with any new initiative, slight scepticism. Some uncertainty naturally arose around such a long training course and its aim of helping teachers become mentors by being better at asking questions of students. Don’t they do that all the time anyway?<\/p>\n\n\n\n<p>However, it was clear from the first cohort that the impact was huge – both in terms of how staff could communicate better among themselves and how they could use these new skills to help students grow as individuals.<\/p>\n\n\n\n<h2>Time to talk<\/h2>\n\n\n\n<p>So how does it work in reality? Every Friday afternoon as the last event of the week, teachers have an hour set aside for mentoring, during which they meet with four students for 15 minutes.<\/p>\n\n\n\n<p>Each student is seen every fortnight, so most teachers have eight students they are mentoring at any one time.<\/p>\n\n\n\n<p>This time can then be used to talk about anything: for instance, about how they are finding certain subjects or any issues they are facing in their social lives. The idea is not for the teacher to prescribe the topic, or provide the student with a certain course of action, or dictate ideas to them; it is just to ask questions, listen, paraphrase and ask another question. We don’t know where the conversation will lead.<\/p>\n\n\n\n<p>The aim through this is that students start to take ownership of their own thinking; to uncover solutions for problems they are facing, to understand themselves better and to open up about issues they are facing and receive help as required.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"682\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-1024x682.jpg\" alt=\"student learning\" class=\"wp-image-11344\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-1024x682.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-300x200.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-768x512.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-1536x1024.jpg 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329-600x400.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/11\/DSC03329.jpg 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<h2>The importance of support&nbsp;<\/h2>\n\n\n\n<p>And it can sometimes be the case that, in the process of these conversations, students do reveal sensitive issues affecting them at home or school. We have wider support for staff should this arise so they can share this and help the student in getting help as they need it.<\/p>\n\n\n\n<p>This can be tough at times but it is a key part of the process. Mentoring allows proper conversations to take place that can uncover issues that could, if not addressed, lead to poor choices.<\/p>\n\n\n\n<p>This is far better than a student struggling without support and any issue only coming to light much later.<\/p>\n\n\n\n<p>For example, students feel comfortable opening up about examination stress, or social issues at school, or challenges at home. We can then discuss these anxieties with them, and about how they want to proceed, and we can provide the necessary support.<\/p>\n\n\n\n<p>But we also have joyful conversations, hearing students resolve <a href=\"https:\/\/halcyonschool.com\/academics\">learning <\/a>problems and going on to exceed their own expectations. Coaching makes students better learners and this fuels personal growth and academic achievement.<\/p>\n\n\n\n<h2>Safeguarding and the need to be trained<\/h2>\n\n\n\n<p>Of course, holding these types of open conversations means safeguarding is a top priority. Because of this, we hold all the coaching sessions in a large open hall with teachers and students spaced apart so they can’t hear one another, but no meetings are being held &#8220;in private&#8221;.<\/p>\n\n\n\n<p>These conversations can be challenging and it underlines why the training is so important – it’s not the same as simply saying &#8220;how are you?&#8221;. You have to know how to guide the conversation delicately and know what to say, what to ask, or not ask, and how to help in those moments.<\/p>\n\n\n\n<p>Because of how the training guides teachers to ask open questions, it means that students are in control of the situation and if they don’t want to open up or only want to talk about academic related-topics, for example, that’s entirely their choice.<\/p>\n\n\n\n<h2>Making the most of your resources<\/h2>\n\n\n\n<p>We know we are in a privileged position as a start-up school with the resources to fund cognitive coaching training. For other schools, this approach may not work.<\/p>\n\n\n\n<p>However, schools are always making choices about where they want to invest in training for staff. It could be the case perhaps that one or two staff members are sent on a course and offer ad hoc mentoring to students.<\/p>\n\n\n\n<p>Overall, there is no definitive right way to do it and some schools may not think it’s for them.<\/p>\n\n\n\n<p>But I believe this approach can yield huge benefits and equips teachers and students with a raft of skills that moves beyond the standard model of education that purely focuses on academic outcomes.<\/p>\n\n\n\n<p>This is an approach that helps students develop a way of thinking that will serve them well in life whatever they do.<\/p>\n\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong> \n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>At our school, all our staff are trained as cognitive coaches – teachers, receptionists, finance staff: everyone. This is perhaps not the usual CPD you hear of, but it is a path our school has been following since 2016 and is one I believe has had huge benefits for staff and students. The first thing [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":11342,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11340"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=11340"}],"version-history":[{"count":8,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11340\/revisions"}],"predecessor-version":[{"id":11359,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11340\/revisions\/11359"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/11342"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=11340"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=11340"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=11340"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}