{"id":11623,"date":"2021-12-15T16:08:55","date_gmt":"2021-12-15T16:08:55","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=11623"},"modified":"2022-11-02T14:17:08","modified_gmt":"2022-11-02T14:17:08","slug":"ib-or-a-levels","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/ib-or-a-levels\/","title":{"rendered":"How the UK education system can learn from the IB"},"content":{"rendered":"\n<p>Designed to push students through a narrow set of examinations, the A-level curriculum lacks vision, purpose, and imagination. It’s time for schools to rethink those vital couple of years that are supposed to set young people up for university and a successful career beyond it, writes Barry Mansfield, who argues that the IB is a great model for education, in the <a href=\"https:\/\/www.teachingtimes.com\/our-a-levels-system-isnt-preparing-pupils-for-university-or-life-academically-or-emotionally\/\" target=\"_blank\" rel=\"noopener\">Teaching Times<\/a>. <\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_025-2-1-e1639406392266-1024x786.jpg\" alt=\"ib results 2021\" class=\"wp-image-11626\" width=\"1118\" height=\"858\"\/><\/figure>\n\n\n\n<p>You can learn more about <a href=\"https:\/\/halcyonschool.com\/blog\/class-of-2021-ib-diploma-results\/\">IB results 2021<\/a> on our blog.<\/p>\n\n\n\n<p>There are alternatives to A Levels in England and Wales. I lead an International Baccalaureate school and the IB Diploma has a clear purpose – “to develop inquiring, knowledgeable and caring young people who help to create a better and more peaceful world through intercultural understanding and respect”. That’s something I can get behind – it gives some shape and meaning to that imagined future I’m preparing students for. It aligns with our school mission: we have a shared moral purpose.<\/p>\n\n\n\n<h2>Expanding horizons vs limiting options<\/h2>\n\n\n\n<p>The IB shows us how we could shape a new approach to learning and teaching – one that is comprehensive, and offers young people the opportunity to gain skills needed for life and academia. The IB Diploma programme’s focus on breadth is far more impressive than the limited nature of British A-Levels. It is a six subject diploma, ensuring that students take at least one option in certain subject groups (such as languages, sciences, and mathematics), while still offering them the opportunity for specialisation. If a student is enrolled in an A-Level programme, they are required to choose three to four subjects at the age of sixteen: a potentially life-changing choice that means many students find themselves without any higher qualifications in mathematics or languages. This restricts the higher education courses they can apply for. But it goes beyond this, because examinations alone cannot provide everything young people need for university and for life.<\/p>\n\n\n\n<h2>Research and project-management skills<\/h2>\n\n\n\n<p>The requirements of <a href=\"https:\/\/halcyonschool.com\/academics\/curriculum\/#dp\">IB Diploma<\/a> also highlight how the research requirements of an A-Level programme are, by comparison, chronically underdeveloped. The IB Diploma Programme has a standalone independent research component: a 4,000 word paper on an inquiry topic of a student’s choice.<\/p>\n\n\n\n<p>Although students enrolled in an A-Level programme may opt to take an Extended Project Qualification in their second year, this is not a mandatory component, and is often undertaken by students simply to support their university application for a certain subject.<\/p>\n\n\n\n<p>In addition to this, the IB – and many other similar systems – maintains internal assessments and coursework across all subjects, offering students the opportunity to develop in more in-skills that all employers (and universities) demand. Properly constructed coursework teaches students how to be self-starters; to be able to plan and manage long-form projects; to <a href=\"https:\/\/www.teachwire.net\/news\/online-learning-do-schools-still-need-physical-libraries\" target=\"_blank\" rel=\"noopener\">research in libraries<\/a>; to collaborate with others productively to co-create, own, and share knowledge; and to be able to transfer key skills across different disciplines. A-Levels have abandoned these essential skills.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-1024x682.jpg\" alt=\"ib students\" class=\"wp-image-11633\" width=\"1121\" height=\"747\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-1024x682.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-300x200.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-768x512.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-1536x1024.jpg 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2-600x400.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/12\/VB21_HALCYON_D1_035-2.jpg 2000w\" sizes=\"(max-width: 1121px) 100vw, 1121px\" \/><\/figure>\n\n\n\n<h2>Understanding the complexity of the world<\/h2>\n\n\n\n<p>The key issue of critical thinking skills further reduces the value of A-Levels. In order to successfully complete the IB Diploma Programme, every student must follow a critical thinking programme (Theory of Knowledge) that explores different knowledge systems; diverse methods of inquiry, from different times, places and cultures. It takes the personal and shared aspects of knowledge – how we understand the world – and investigates the relationships between them, while aiming to develop self-awareness and a sense of identity.<\/p>\n\n\n\n<p>In a recent interview, Sabrina, a recent Halcyon graduate, reported how her Theory of Knowledge skills have allowed her to master a module on fake news and statistics on her Politics and International Relations course at University College London. There is no mandatory critical thinking element in any A-Level programme. The OCR examination board has a Critical Thinking AS\/A-Level, but this is not offered by many sixth forms or colleges. Even if an A-Level student does opt for Critical Thinking A-Level, the impact of this subject on students’ wider academic progress is debatable. Research by Cambridge Assessment found that “[Critical Thinking] teachers tended to report that their overall agenda or aim was for students to achieve a good grade in the exam, rather than to foster transferable skills and dispositions.”<\/p>\n\n\n\n<p>Although British and international universities accept both the IB and A-Level students, schools and universities increasingly understand that the requirements of the Diploma Programme better equip individuals to succeed in higher education: 94% of admissions officers have reported that Diploma students are better prepared for independent inquiry, a fundamental skill for universities. What’s more, we know anecdotally that our community includes university lecturers who have specifically chosen Halcyon for their children because of the qualities nurtured by the Diploma.<\/p>\n\n\n\n<p><strong>Read more:<\/strong><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/blog\/ib-oxbridge\/\">3 Ways In Which The IB Prepares Students for Oxbridge<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/blog\/ib-vs-a-levels-university-and-beyond\/\">IB vs A-Levels<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/blog\/archaeology\/\">Profile of an Archaeologist: Explorations at Halcyon<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/blog\/supporting-new-students-navigating-change-academic-challenge\/\">Supporting New Students: Navigating Change And Academic Challenge<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/academics\/subjects\/\">Subjects at Halcyon<\/a><\/p>\n\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong>&nbsp;\n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script><\/strong><\/strong>\n","protected":false},"excerpt":{"rendered":"<p>Designed to push students through a narrow set of examinations, the A-level curriculum lacks vision, purpose, and imagination. It’s time for schools to rethink those vital couple of years that are supposed to set young people up for university and a successful career beyond it, writes Barry Mansfield, who argues that the IB is a [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":11624,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,59],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11623"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=11623"}],"version-history":[{"count":10,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11623\/revisions"}],"predecessor-version":[{"id":14208,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/11623\/revisions\/14208"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/11624"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=11623"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=11623"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=11623"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}