{"id":12574,"date":"2022-03-21T13:35:24","date_gmt":"2022-03-21T13:35:24","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=12574"},"modified":"2022-03-21T13:37:06","modified_gmt":"2022-03-21T13:37:06","slug":"day-in-the-life","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/day-in-the-life\/","title":{"rendered":"A day in the life of a Halcyon learner: a “Leeman” experience of the International Baccalaureate"},"content":{"rendered":"\n<p>By Leeman Robinson, Marketing Leader<\/p>\n\n\n\n<p>I learned about the existence of the International Baccalaureate (IB) a mere eight months ago when I started my role as Marketing Leader at Halcyon London International School. I had no idea what to expect, and as a product of a conventional British education system I was keen to understand the major differences in the curriculum format. <\/p>\n\n\n\n<p>A couple of weeks ago I decided to immerse myself in the classroom in order to experience the day in the life of a Halcyon student, to truly get sense of the IB. <\/p>\n\n\n\n<p>To begin my &#8216;day in the life&#8217;, I attended a Grade 6 Science class taught by our Middle Years Programme Leader and Science teacher Kerry Jenkins. Students were given the task of physically building a cell, using scrap items (e.g. piper cleaners, kitchen foil, paint etc). They were then asked to provide a summary of the function\/s of the cell as well as labelling various parts for further context.&nbsp;<\/p>\n\n\n\n<p>I was immediately impressed by the teacher’s ability to incorporate Halcyon’s core values within the task. The creation of the cell demonstrated innovation, the discussion amongst the students who were building similar cells defined collaboration, and the presentation of their discovery back to the class and teacher, was an example of community in action.&nbsp;<\/p>\n\n\n\n<p>Next up, I attended a Grade 10 class taught by our Sustainability Leader and Environmental Systems and Societies teacher Martyn Steiner. The lesson focused on the importance of the water cycle and the impact of disruption on ecosystems. Students focused on the loss of plant pollinators like bees and insects and how this subsequently caused a complete imbalance in the natural environment if not addressed. I asked, “do humans currently have any positive impact on the environment?” The answer suggested that the damage done by humans is almost irreversible, although awareness of human damage to ecosystems has enabled conservation and sustainability to become a focus for humans, so I guess that is good.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"1024\" height=\"512\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-1024x512.png\" alt=\"a day in the life leeman robinson\n\" class=\"wp-image-12580\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-1024x512.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-300x150.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-768x384.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-1536x768.png 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2-600x300.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/03\/Twitter-posts-75-2.png 1800w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure><\/div>\n\n\n\n<h2>A Day In The Life of a Halcyon Student: Technology, Debate, and Dynamism<\/h2>\n\n\n\n<p>What struck me was the <a href=\"https:\/\/www.teachingtimes.com\/its-time-for-the-uk-government-to-get-real-about-digital-technology\/\" target=\"_blank\" rel=\"noreferrer noopener\">utilisation of technology<\/a> throughout the class. A video was played on screen and the students were asked to pool feedback into a central document using their smart devices. The lesson didn&#8217;t have an ounce of nostalgia and the delta between formats was different to what I recall of the nearest comparator, G.C.S.E Geography.&nbsp;<\/p>\n\n\n\n<p>History has always been a contentious subject for me as I often argued with my teachers. So I decided to attend a Grade 12 class taught by our History and Individuals and Societies teacher Vicky Morgan. The lesson looked at the act of protest, violent and non-violent, and the benefits and drawbacks of both. The approach was global, looking at protests in countries around the world such as The March on Washington (28 August 1963), South Africa’s National Day of Protest (26 June 1950) and The Arab Spring (December 2010 – October 2013) to name a few. This was a distinct contrast to my own history lessons which only covered British History &#8211; The Battle of Hastings, World War I and II!.&nbsp;<\/p>\n\n\n\n<p>Interestingly, instructions for the lesson were not written on a board but displayed on a screen within a Google Document. Students were encouraged to discuss their thoughts amongst each other and identify which protests were violent or non-violent, and what were the ramifications. I was thoroughly impressed by the depth of knowledge the students exhibited in these areas.&nbsp;<\/p>\n\n\n\n<p>My final session in my day in the life of a Halcyon student was a Grade 7 English class with English teacher Lindsey Fairweather. The students watched the 2016 New Zealand adventure comedy-drama film &#8211; Hunt for the Wilderpeople. The students were already 20 minutes in and were asked to provide analysis of scenes, sounds, shoots, dialogue, as well as differences in using the medium of film as opposed to literature as a way to convey a story.&nbsp; Students were able to pause the video and use their smart devices to capture photographs of scenes and then enter their analysis into a consolidated Google document.&nbsp;&nbsp;<\/p>\n\n\n\n<p>My own secondary school English lesson experience was nothing like this. We often followed a formulaic approach in which we were either talked at by the teacher and then asked: “read these for the next 15 minutes and write what mood you think the author is trying to establish through the description of the environment”. The lesson was full of surprises and I even learned the meaning of diegetic and non-diegetic sounds.&nbsp;<\/p>\n\n\n\n<p>Overall, there were some similarities with the traditional British curriculum. Often preparative reading was required in order to engage in the lessons. Students were also given assignments and would often present back to the class. But I cannot stress enough how different my day in the life of a Halcyon student was from what I remember. The conversational and engaging tone that teachers brought to the classroom fostered collaboration in all senses of the word. In all the classes I visited, there was a vast array of answers to any question as long as you had the evidence to justify it.<\/p>\n\n\n\n<p>I also noticed that Halcyon teachers never sit behind a desk.&nbsp;Teachers were consistently moving which I feel heightened the level of engagement with students. It seemed to give them the oversight that they needed while allowing them to act as more of an &#8216;experienced facilitator&#8217; who was actively participating in the learning process. They are often challenged by the students they teach. They allowed students to be curious and come to their own conclusions which I personally feel is a much better way of establishing a deeper understanding of a subject,<\/p>\n\n\n\n<p>The quality and rigour of the curriculum were easily demonstrated by the various different methods the students used to find the right conclusion. There were times that a teacher asked a question and I can admit that my expression was one of bewilderment, yet a student was able to answer almost as quickly as my brain attempted to determine the question. I honestly believe that completing the IB Diploma programme at my age would be questionable.<\/p>\n\n\n\n<p>Knowing what I know now I can only advocate the IB as the greatest education a student can receive, albeit with slight confirmation bias.&nbsp;<\/p>\n\n\n\n<p>Ultimately, I would summarise my IB learning experience and my &#8216;day in the life of a Halcyon student&#8217; through a well-known quote:<\/p>\n\n\n\n<p><em>&#8220;What I hear, I forget. What I see, I remember. What I do, I understand.&#8221; <br>Confucius&nbsp; (c. 551–479 BC<\/em>)<\/p>\n\n\n\n<p>Read more:<\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/diversity-equity-and-inclusion\/\">Diversity, Equity, and Inclusion (DEI)<\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/blog\/ib-teacher-student\/\">From IB Student to IB Teacher: the impact of the International Baccalaureate<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>By Leeman Robinson, Marketing Leader I learned about the existence of the International Baccalaureate (IB) a mere eight months ago when I started my role as Marketing Leader at Halcyon London International School. I had no idea what to expect, and as a product of a conventional British education system I was keen to understand [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":12578,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,59],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/12574"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=12574"}],"version-history":[{"count":11,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/12574\/revisions"}],"predecessor-version":[{"id":13163,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/12574\/revisions\/13163"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/12578"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=12574"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=12574"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=12574"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}