{"id":13247,"date":"2022-05-31T13:24:20","date_gmt":"2022-05-31T13:24:20","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=13247"},"modified":"2022-05-31T13:29:48","modified_gmt":"2022-05-31T13:29:48","slug":"technology-in-schools","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/technology-in-schools\/","title":{"rendered":"Technology in schools: myth vs. reality"},"content":{"rendered":"\n<p><em>Halcyon&#8217;s integration of EdTech into learning is a key part of Halcyon’s curriculum, facilitating students’ cultivation of the IB Learner Profile skills. This integrated approach to technology in schools is not<\/em> <em>found everywhere, and some families are curious to discover what a digitally-focused school looks like in reality. What better way to find out than to hear a first-hand account from a member of staff who has a. experienced the national curriculum and is b. new to a digital educational environment? Read the following blog by our Marketing Leader, Leeman Robinson, to learn more. <\/em><\/p>\n\n\n\n<div style=\"height:51px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><\/p>\n\n\n\n<p>Embracing technology in schools has significantly changed the interaction between the student, the teacher, and the parent. Let’s take my own experience of “parents&#8217; evenings” as a child. I needed to physically attend the school on a designated evening and effectively participate in speed interviews, whilst the teacher discussed my progress with my parents. Let&#8217;s just say the discussion when I returned home offered some… constructive criticism!<\/p>\n\n\n\n<p>Parents&#8217; evenings nowadays (as the parent) are completely different. A recent iteration that I participated in was facilitated in a completely online format (undoubtedly influenced by the recent pandemic). I was sent an email notification requesting me to book an appointment time on the school&#8217;s bespoke platform. I was frequently sent calendar reminders in the run-up to the event. The session took place completely online via video call. The teacher discussed my child’s classroom work and behavior as they shared a screen showing examples of my child’s work. The whole process was efficient, convenient, and definitely accommodated the lifestyle of working parents.<\/p>\n\n\n\n<p>Did you know that, according to an article in <a href=\"https:\/\/www.fenews.co.uk\/education\/new-data-uk-schools-are-leading-the-way-in-embracing-technology\/\" target=\"_blank\" rel=\"noopener\">fenews<\/a>, the UK tops global rankings for embracing technology in schools, with the majority of parents supportive of remote\/hybrid learning? Apparently, 64% of UK schools use technology in everyday teaching and learning practices, 55% of parents are supportive of EdTech in the classroom and remote\/hybrid learning, and 57% of UK schools involve students in the planning of technology use in the classroom. Despite the ease of my own experience as a parent attending a virtual information evening, it appears that some misgivings and uncertainties remain for parents and educators witnessing the <a href=\"https:\/\/www.teachingtimes.com\/its-time-for-the-uk-government-to-get-real-about-digital-technology\/\" target=\"_blank\" rel=\"noopener\">digital revolution<\/a> taking place in classrooms. Are such misgivings justified?<\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-1024x682.jpg\" alt=\"educational technology\" class=\"wp-image-13250\" width=\"1278\" height=\"851\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-1024x682.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-300x200.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-768x512.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-1536x1024.jpg 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023-600x400.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_023.jpg 2000w\" sizes=\"(max-width: 1278px) 100vw, 1278px\" \/><\/figure>\n\n\n\n<h2>Technology in schools &#8211; a case study: embracing the digital world at Halcyon<\/h2>\n\n\n\n<p>At Halcyon, we have readily embraced technology since opening in 2013. We are an accredited Google Reference School as well as a regional Apple Training Centre. Our students utilise tablets, screens, and laptops as flexible learning devices, using readily-available technologies to document of almost all of their work, engage in research, create presentations, and much more.&nbsp;<\/p>\n\n\n\n<p>Halcyon&#8217;s integrated and future-facing approach to technology in schools was exemplified by the approach to student learning during the COVID-19 lockdown. Back in March 2020 the decision was made to move the School to an online, remote learning platform. The school’s digitally integrated curriculum, students’ familiarity with the tools, and the expertise of teachers enabled us to be equipped to make this transition.&nbsp;<\/p>\n\n\n\n<p>The <a href=\"https:\/\/halcyonschool.com\/wellbeing\">Wellbeing<\/a> Team used educational technology to ensure that students were able to connect with the school community outside of lesson times to create an interactive virtual map of the school’s classrooms. This enabled students to speak to teachers in familiar environments. Upon reopening, a survey was disseminated to parents and staff, and the results showed a very high level of support and trust in the school’s leadership team and their ability to make sound decisions during the period.<\/p>\n\n\n\n<p>In my exploration of this digitally savvy institution, I came to find that the school was able to integrate the very latest in the world of technology into learning. Halcyon is in possession of a Meta Quest 2 (formerly known as the Occulus Quest 2) &#8211; a virtual reality (VR) headset which enables students to explore and learn through this unique environment. After getting over the initial awkwardness of donning the headset and bumping into a few objects, I was transported to an AR version of the world in which I could interact with various features. As someone who truly ascribes to hands-on teaching methods, I thought this particular tool was a great way for students to observe and manipulate objects, subjects, and materials. This practical learning method is proven to lead to a deeper understanding of a concept through the act of personal experience.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-1024x682.jpg\" alt=\"digital learning\" class=\"wp-image-13251\" width=\"1286\" height=\"856\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-1024x682.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-300x200.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-768x512.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-1536x1024.jpg 1536w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051-600x400.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2022\/05\/VB21_HALCYON_D1_051.jpg 2000w\" sizes=\"(max-width: 1286px) 100vw, 1286px\" \/><\/figure>\n\n\n\n<h2>Using technology in schools to bring communities together<\/h2>\n\n\n\n<p>The effective application of technology is integral to the internal operations of the school too, particularly when concerning the Community Engagement Team. Having an efficient <a href=\"https:\/\/halcyonschool.com\/admissions\">Admissions<\/a> process can often be the crucial point in a family’s decision to join a school community. All enquiries (via telephone, emails, and web) forms need to be logged, applications need to be processed, and consultations need to be booked. This careful tapestry is underpinned by the diligence of our Admission Director and the presence of CRM tools such as iSAMs and Hubspot , which enable an efficient and positive experience for existing and prospective families.&nbsp;<\/p>\n\n\n\n<p>A bespoke app, Google Analytics, Canva, InDesign, and Facebook are just a few of the tools that our Communications Manager expertly utilises to develop, deliver emails, post notifications and analyze data so that we can hone our targeting and messaging.&nbsp;<\/p>\n\n\n\n<p>The school has a commitment to sustainability and we only print materials when absolutely necessary &#8211; online content is used regularly to engage with our community.&nbsp;<\/p>\n\n\n\n<p>Returning to the question of this blog &#8211; ‘myth vs. reality’ &#8211; it seems clear to me that technology in schools is the result of a naturally symbiotic relationship between education and the digital revolution. This is a relationship that is extremely beneficial now and will continue to be beneficial in the future. The entire community not only benefits from convenience, practicality, and expedience, but we also thrive through the creation of a more engaging environment, the ability to incorporate different teaching and learning styles, improved collaboration, and ultimately preparing students, teachers, and parents for the future.&nbsp;<\/p>\n\n\n\n<p>Trust me when I say this: if my 7-year-old daughter has better mastery of Microsoft PowerPoint than I do, then something about the integration of technology into education is extremely positive.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>More on digital at Halcyon and technology in schools: <\/strong><\/p>\n\n\n\n<ul><li><a href=\"https:\/\/halcyonschool.com\/blog\/edtech-digital-technology\/\">EdTech: Our Director Argues For A New Approach in UK Schools<\/a><\/li><li><a href=\"https:\/\/halcyonschool.com\/blog\/science-facilities-at-halcyon\/\">Science Facilities at Halcyon: Tools to investigate our world<\/a><\/li><li><a href=\"VIDEO: Academia at Halcyon\">VIDEO: Academia at Halcyon<\/a><\/li><\/ul>\n\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong>&nbsp;\n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script><\/strong><\/strong>\n","protected":false},"excerpt":{"rendered":"<p>Halcyon&#8217;s integration of EdTech into learning is a key part of Halcyon’s curriculum, facilitating students’ cultivation of the IB Learner Profile skills. This integrated approach to technology in schools is not found everywhere, and some families are curious to discover what a digitally-focused school looks like in reality. What better way to find out than [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":13253,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,58],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/13247"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=13247"}],"version-history":[{"count":13,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/13247\/revisions"}],"predecessor-version":[{"id":13264,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/13247\/revisions\/13264"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/13253"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=13247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=13247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=13247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}