{"id":14538,"date":"2023-01-18T08:59:04","date_gmt":"2023-01-18T08:59:04","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=14538"},"modified":"2023-01-20T16:23:06","modified_gmt":"2023-01-20T16:23:06","slug":"londons-only-not-for-profit-ib-school-5-questions-to-halcyon-london-international-school-co-founder-rita-halbright","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/londons-only-not-for-profit-ib-school-5-questions-to-halcyon-london-international-school-co-founder-rita-halbright\/","title":{"rendered":"London’s only not-for-profit IB School: 5 questions to Halcyon London International School co-founder, Rita Halbright"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1-1024x341.png\" alt=\"\" class=\"wp-image-14569\" width=\"1117\" height=\"372\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/01\/image-1.png 1200w\" sizes=\"(max-width: 1117px) 100vw, 1117px\" \/><\/figure>\n\n\n\n<p>Given Halcyon&#8217;s commitment to creating a learning environment that supports students to challenge themselves to realise their full potential, we sat down with our co-founder, Rita Halbright, to learn more about Halcyon&#8217;s mission.<\/p>\n\n\n\n<p><strong>As a parent and a co-founder of Halcyon, what was your motivation behind creating a not-for-profit IB?<\/strong><\/p>\n\n\n\n<p>We were four parents who cared deeply about providing an <a href=\"https:\/\/www.teachingtimes.com\/its-time-for-the-uk-government-to-get-real-about-digital-technology\/\" target=\"_blank\" rel=\"noopener\">innovative education<\/a>. We wanted Halcyon to reflect what we know today about effective learning communities and not rely on outdated education models. With a blank slate, we could explore best practices and evidence-based models, attract open-minded forward thinking staff, and embrace the best that technology has to offer. We understood that a warm and welcoming environment helps students thrive, engage with their learning, find their voice, and give them agency. We were inspired by a number of educators, for example, Sir Ken Robinson and Sugata Mitra.<\/p>\n\n\n\n<p>We had a number of priorities, but the key ones were to offer an exciting, holistic, student-centred IB education; include varied learning experiences to support the development of a broader toolkit, create a bursary programme, and view the whole school community as life-long learners and partners in the journey. This means &#8211; in addition to educating students &#8211; investing in meaningful and robust <a href=\"https:\/\/halcyonschool.com\/blog\/coaching\/\">professional development for staff <\/a>and learning opportunities for parents. We also wanted to embed into the School’s culture these priorities: student wellbeing, <a href=\"https:\/\/halcyonschool.com\/sustainability-at-halcyon\/\">sustainability<\/a>, inclusion and diversity and digital skills. We wanted to continue to challenge the status quo to make sure that Halcyon is always questioning and improving, listening and learning, experiencing and engaging, at all levels.&nbsp;<\/p>\n\n\n\n<p>Finally, as parents ourselves, we realised that paying for school is an investment in our most valuable asset, our children. We wanted to provide financial transparency to families so it was clear how their fees were being spent. To support this we became a not-for-profit school organised as a charity, investing all fee income back into Halcyon. As part of this, we do our best to include as many expenses in the fees as possible, including <a href=\"https:\/\/halcyonschool.com\/blog\/sustainability-commitment\/\">fresh snacks and lunch<\/a>, an annual residential trip, other day trips, in addition to many extra-curricular activities.<\/p>\n\n\n\n<p><strong>Halcyon’s mission is to provide an exceptional education that draws out the unique potential of each student. Can you share with me how Halcyon challenges students and prepares them for the future?<\/strong><\/p>\n\n\n\n<p>You just have to look at our inspiring curriculum and meet our engaging students and innovative staff. By committing to no more than 250 students, Halcyon is a tight-knit community where everyone knows everyone. We focus on each student being seen, heard and supported. Research shows that when you feel welcome and included, you have a much better chance to learn and thrive.<\/p>\n\n\n\n<p>In addition to a great IB curriculum, our students in Grade 6 to 9 are stretched through the Exploration programme and their Passion Projects. In preparation for the <a href=\"https:\/\/halcyonschool.com\/blog\/ib-student-profile\/\">Diploma Programme<\/a> at Halcyon, students develop skills in time and project management; collaboration; mentoring; restorative justice practices; mindfulness, and more.<\/p>\n\n\n\n<p>From Grade 6 onwards, students are encouraged to challenge themselves both inside and outside of the classroom. While they are exposed to tremendous content through their subject units,&nbsp; they explore related topics of personal interest to broaden their knowledge and skills.&nbsp;<\/p>\n\n\n\n<p><strong>Halcyon is the only not-for-profit IB in London, what inspired you to take this approach?&nbsp;<\/strong><\/p>\n\n\n\n<p>Private education is expensive as it is. Parents deserve to know how their fees are being spent. Halcyon was set-up to be a truly not-for-profit and independent international school with its own <a href=\"https:\/\/halcyonschool.com\/blog\/video-academia-at-halcyon\/\">distinctive character and ethos<\/a>, part of which is to ensure financial transparency. And the for-profit model did not match our philosophy about education. Besides the regulatory and accrediting&nbsp; institutions such as Ofsted, the IBO and NEASC, Halcyon is beholden only to its students, the community of staff and parents, and its diverse volunteer board of trustees, not to any corporate entity or owner.<\/p>\n\n\n\n<p><strong>As a not-for-profit IB, why do you feel it’s important to have a bursary programme? How does it align with Halcyon’s ethos?<\/strong><\/p>\n\n\n\n<p>A huge part of life at Halcyon is to be active, constructive citizens. Thanks to elements of a not-for-profit combined with an IB curriculum, our students see their school investing in public benefit through curricular related activities, volunteer projects and through the bursary programme. The <a href=\"https:\/\/halcyonschool.com\/donate\/#bursarymission\">bursary programme<\/a> broadens everyone’s perspective, allows us to be more inclusive and encourages our students to seek opportunities to give back as well.&nbsp;<\/p>\n\n\n\n<p><strong>Halcyon’s bursary programme relies on the generosity of the donors. What would you like to say to them?<\/strong><\/p>\n\n\n\n<p>Offering a bursary to students who would otherwise be unable to benefit from a Halcyon education not only enriches the recipients, but our entire community. Every gift to our bursary programme &#8211; irrespective of size &#8211; makes a difference, and we are grateful for all contributions.<\/p>\n\n\n\n<p>In short, I believe Halcyon is on track, offering a challenging, forward-looking, holistic education and I believe I speak for my fellow co-founders, Achim, Julie and Pamela.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Given Halcyon&#8217;s commitment to creating a learning environment that supports students to challenge themselves to realise their full potential, we sat down with our co-founder, Rita Halbright, to learn more about Halcyon&#8217;s mission. As a parent and a co-founder of Halcyon, what was your motivation behind creating a not-for-profit IB? We were four parents who [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,59],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14538"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=14538"}],"version-history":[{"count":24,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14538\/revisions"}],"predecessor-version":[{"id":14579,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14538\/revisions\/14579"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=14538"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=14538"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=14538"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}