{"id":14759,"date":"2023-02-10T12:54:17","date_gmt":"2023-02-10T12:54:17","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=14759"},"modified":"2023-02-27T07:25:51","modified_gmt":"2023-02-27T07:25:51","slug":"the-halcyon-bursary-programme","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/the-halcyon-bursary-programme\/","title":{"rendered":"The Halcyon Bursary Programme"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1-1024x341.png\" alt=\"\" class=\"wp-image-14768\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/02\/image-1.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Halcyon London International was created as London’s only not-for-profit IB school. Through a pioneering educational programme, our mission is to draw out the unique potential of each student. Our Bursary Programme allows us to support students who otherwise might not be able to access a Halcyon education.&nbsp;<\/p>\n\n\n\n<p>Christabel, whose child Finley benefited from a Halcyon bursary, talked to us about her experience.<\/p>\n\n\n\n<p><strong>What does the Halcyon Bursary Programme mean to you and your family?<\/strong><\/p>\n\n\n\n<p>It was an absolute lifesaver for us. He would not be the person he is today or have the opportunities he has now without the help of the Bursary Programme. I would like to thank all the families who generously donated to the Bursary Programme and allowed Finley to finish his Halcyon education.<\/p>\n\n\n\n<p><strong>What was the value of Halcyon education to Finley?<\/strong><\/p>\n\n\n\n<p>Halcyon helped shape Finely into the person he is today. Being at an IB school with a close-knit community instilled in him strong self-confidence, and since everyone knew each other, he was able to develop real friendships that he still maintains today. Halcyon not only gave Finley a fantastic education, but it also introduced him to a truly international community that broadened his horizons.&nbsp;<\/p>\n\n\n\n<p>As a family, we also liked that the IB is internationally recognised and that many universities prefer it to other systems. Finley is currently studying Chemistry and Natural Sciences at Minerva University in San Francisco, so the IB was definitely the best choice.<\/p>\n\n\n\n<p><strong>During Finley’s time at Halcyon, what qualities and skills did he develop?<\/strong><\/p>\n\n\n\n<p>The way Halcyon teachers encourage students to take charge of their learning helped Finely become an independent thinker and to evaluate things critically from an all-round perspective. Given the holistic nature of the IB curriculum, Finley learned to use multi-disciplinary thinking to solve problems and answer big questions. He particularly enjoyed the Theory of Knowledge component, and as a family, we liked how Halcyon enhances the CAS element in their daily culture. Moreover, Halcyon taught Finley the value of being a global citizen. For example, he participated in extracurricular activities related to environmental sciences, and thanks to the effort teachers put in, Finley developed a strong interest in ecology and the environment.<\/p>\n\n\n\n<p>Another element that we loved about Halcyon was the wellbeing culture present in the school. At Halcyon, Finley knew that anytime he needed help, either academic or pastoral-care related, he would receive the necessary support. All members of staff are trained in cognitive coaching, so they facilitate respectful, deep and productive relationships in the community. Finley now works part-time as an online tutor and uses many of the listening and communicating techniques he learnt during his time at Halcyon.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https:\/\/mail.google.com\/mail\/u\/0?ui=2&amp;ik=ea573a88d6&amp;attid=0.1&amp;permmsgid=msg-f:1757435727486935429&amp;th=1863aa7b9c706185&amp;view=fimg&amp;fur=ip&amp;sz=s0-l75-ft&amp;attbid=ANGjdJ8KyfxlCvdv6FAUvwHxH4qKD3hxaaFIdLxx5atoinxxmzmuOsfxGt6eNnV2emZRallMID-rF846m3mkRn_CHAjkqDBaHhHBahU-ZWZsLBk9BWiOydSMQkxk2eQ&amp;disp=emb&amp;realattid=1863aa713047c6bce4d1\" alt=\"\" width=\"587\" height=\"440\"\/><\/figure><\/div>\n\n\n\n<p><strong>As a parent, what was your favourite part of the Halcyon experience?<\/strong><\/p>\n\n\n\n<p>I enjoyed the sense of community at Halcyon. The families were welcoming and lovely. It was great because we had just moved from Sydney to London, and Halcyon gave us an instant community. Finley settled in straight away and started making good friends. He loved being in the middle of such a big and exciting city. We were also happy that there was a vegetarian cafeteria on-site, so we knew Finley was eating healthy and delicious food (and no packed lunches to make!).<\/p>\n\n\n\n<p><strong>What would you like to say to families considering donating to the Bursary Programme?<\/strong><\/p>\n\n\n\n<p>The Bursary Programme is life-changing. By donating, you are helping those within your community and supporting a family who wouldn’t be able to join or continue at Halcyon without it.&nbsp; The Bursary Programme changes the future of families within your school community: it is a gift for a lifetime.<\/p>\n\n\n\n<p><strong>If you were to recommend Halcyon to another family, what would you like them to know about us?<\/strong><\/p>\n\n\n\n<p>It’s just the most fantastic school! I recommend Halcyon all the time! I think it’s such a rare privilege to be educated in the middle of such an international city like London, and Halcyon utilises the best city spaces and facilities. The way teachers maximise technology with innovative digital tools gave Finley an excellent grounding for his university studies. The teachers are wonderful and foster a warm and supportive environment. We couldn’t have asked for a better school for Finley.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Halcyon London International was created as London’s only not-for-profit IB school. Through a pioneering educational programme, our mission is to draw out the unique potential of each student. Our Bursary Programme allows us to support students who otherwise might not be able to access a Halcyon education.&nbsp; Christabel, whose child Finley benefited from a Halcyon [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14759"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=14759"}],"version-history":[{"count":6,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14759\/revisions"}],"predecessor-version":[{"id":14769,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/14759\/revisions\/14769"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=14759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=14759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=14759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}