{"id":15275,"date":"2023-03-13T08:04:40","date_gmt":"2023-03-13T08:04:40","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=15275"},"modified":"2023-03-13T13:47:45","modified_gmt":"2023-03-13T13:47:45","slug":"culture-wars-and-schools","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/culture-wars-and-schools\/","title":{"rendered":"Culture Wars and Schools"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1-1024x341.png\" alt=\"\" class=\"wp-image-15290\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/03\/image-1.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>As an international school leader, in a vibrant, multicultural city, it’s fair to say that I meet parents, students and staff with incredibly diverse outlooks and opinions. Identity is decidedly<em> not<\/em> homogeneous. Part of my job is to navigate the many currents that this difference generates, while providing enough commonality and consensus that everyone can enjoy a sense of belonging: that we can build an effective learning community together.&nbsp;<\/p>\n\n\n\n<p><strong>Challenges<\/strong><\/p>\n\n\n\n<p>Probably, everyone in my position would like to think that they are good at managing difference &#8211; that it’s a non-negotiable leadership skill, an essential piece of soft politics; however, there’s the potential for a lot of hubris here, and there are plenty of examples of those who fail to do this successfully. And the slow fragmentation of political consensus, and the noise of the ‘culture war’ and its attendant shifting moral sands, means building consensus has become a more uncertain game than ever.&nbsp;<\/p>\n\n\n\n<p>Firstly, we all know that the landscape is changing. Secondly, like it or not, moral codes do change over time (which is not to say that there’s no value in having a moral compass). In important ways, my moral sensibilities and the imperatives which spring from these, differ from my parents and grandparents. In simple terms, while Twitter and Fox debate pronouns, my<em> great <\/em>grandparents’ would have worried that it would have been unseemly for a man to be outdoors without a hat, and have understood the social requirement for a respectable woman to wear a headscarf. When changes are measured over a century, they are substantive; over longer periods, they appear inevitable.&nbsp;<\/p>\n\n\n\n<p>Every so often, there’s an accelerant added to the mix: maybe a previously settled question is challenged or acquires new significance, or a new ideology disrupts the political and public space? In the American context, the remedy for the foundational sin of slavery has never been a settled question, and the broader agenda of social justice, and what we might loosely call identity politics, has unravelled an already frayed political consensus. To quote the Italian philosopher Antonio Gramsci, there is an argument that ‘the old world is dying, and the new world struggles to be born.’ There is a widespread sense that moral and ethical codes are shifting; that we are in between times &#8211; travelling, but not sure of the destination.&nbsp;<\/p>\n\n\n\n<p>This culture war is not the first &#8211; even the name is stolen from the German Kulturkampf of the 1870s &#8211; and it is not the last. In its outlines, it is also not so different from its predecessors, which always centre on conflicts over access to power. For many young people today there is an immediate and necessary struggle to reform society, and to reframe who holds power and how authority is exercised: unsurprisingly, they want to shape the world they want to grow into. But this is not an agreed consensus: to others, these changes can be disconcerting, and they might disagree with some or all of this new ideology; they might wish to meet protest with counter-protest. Somewhere in this contested place, each school will need to find a shared path for their community.<\/p>\n\n\n\n<p>In the U.S., education has become a political battleground, with very public, and different, interventions in school systems and university campuses. Some of this has arrived in the U.K., mainly around questions of gender identity, while one Conservative government minister has tried to bring the argument against <a href=\"https:\/\/www.spectator.co.uk\/article\/kemi-badenoch-the-problem-with-critical-race-theory\/\" target=\"_blank\" rel=\"noopener\">Critical Race Theory<\/a> to the political centre. The same U.K. government has also found it necessary to issue advice about <a href=\"https:\/\/www.gov.uk\/government\/publications\/political-impartiality-in-schools\/political-impartiality-in-schools\" target=\"_blank\" rel=\"noopener\">impartiality in schools<\/a>, a document which may have been intended as part emollient and part an exercise in boundary-setting; however, as almost everyone with an inkling of common sense knew would be the case, it swiftly became just another artefact in a divisive and increasingly intolerant political debate.&nbsp;<\/p>\n\n\n\n<p>With the strident opinions of politicians and the click-bait of social media driving division, many of us in public-facing roles may wonder how we can plot a successful pathway through what could be a career-ending minefield of righteous expectations and political pressures. While our teachers might be confident that they are sophisticated enough to teach impartially, sometimes they are not &#8211; because this is a quality of being human. But their efforts to find a middle ground count for very little if their critics lack both the emotional intelligence to allow that people are complex and flawed, and the wisdom to accept that no-one has the right answer. This quickness to judgement is both a consequence and a function of polarisation, so much so that at times you might even consider this debate to be a category error; that it is less about politics and more about philosophy, and our endless quest to touch the divine &#8211; to perceive a more perfect reality or truth or justice.<\/p>\n\n\n\n<p><strong>Solutions<\/strong><\/p>\n\n\n\n<p>If that sounds too much like hot air, let’s ground ourselves by remembering that good schools are good schools because they know how to manage change and uncertainty. Good teachers also know that as children experience the transition into adulthood, everything in the world is glimpsed for the first time, and they own the excitement and ecstasy of discovering this rich new land in a way their parents could never understand. And some fall in love with politics for the first time, and their experience of this is thrilling, illuminating, electrifying: they are energised and empowered, and have the pride and confidence and narcissism of youth, untested and certain. They do not have the responsibilities or weariness of the adult world, and can be faithful only to themselves and their ideals. This is a liberating place to be, and good schools and teachers know, mostly, how to navigate this and how to allow this energy to be creative and thoughtful and productive.<\/p>\n\n\n\n<p>In our school, we think that we have managed to embrace the essential <em>zeitgeist <\/em>of change, but not be muddied by its politics. Because our teachers know how change works, and are unafraid of this, we can allow students to experience the joy of discovery. We can support this by fostering a spirit of fearless critical inquiry. And by teaching citizenship skills, students have the political literacy to be able to go out into the world and exercise democratic power and advocate for their views. These are all essential life skills, whatever your beliefs about the world.<\/p>\n\n\n\n<p>Our school is also human-centred, which approach supports students&#8217; social and emotional development, and so their agency, sense of belonging, and well-being. We learn to care about each other, which means developing empathy and compassion, and the ability to serve others (while so many talk about leadership, though we teach that too). We &#8211; school leaders and teachers and governors &#8211; need to spend more time learning about ourselves, too, and then have the humility to realise how much baggage we might be trailing behind us.&nbsp;<\/p>\n\n\n\n<p>In the process of reviewing our approach to diversity and inclusion, one of our teachers advocated the idea of <a href=\"https:\/\/www.northeastern.edu\/graduate\/blog\/culturally-responsive-teaching-strategies\/\" target=\"_blank\" rel=\"noopener\">culturally responsive teaching<\/a>, a methodology that requires nothing more political than a willingness to learn about, and value, others. It asks that every student can see themselves reflected in the curriculum, and in the library services, and in the extra- and co-curriculars, and in the way we present ourselves, and organise our building. To not do this would be to make an intentional decision to alienate someone, and who would want to do this?<\/p>\n\n\n\n<p>A colleague in another school, in Atlanta, suggested that we support staff to be more culturally competent &#8211; that we provide professional training to develop our community’s <a href=\"https:\/\/unesdoc.unesco.org\/ark:\/48223\/pf0000219768\" target=\"_blank\" rel=\"noopener\">intercultural competence<\/a>. This is not a new idea &#8211; we are a successful International Baccalaureate school, whose mission includes a commitment to ‘intercultural understanding and respect’ &#8211; but it is not always obvious how best to develop these social skills, and we needed to make space for this in our school. But it’s not much more complicated than asking that each of us spends time being more aware of our own cultural lens; that we recognise that our worldview is only one way of understanding the people around us and the different worlds they belong to; that others may well be right, even about things that really matter to us; and that we can each strive to be adaptable enough to respect and explore and embrace the diversity around us. To not do this would mean I would have to make a very intentional decision to require everyone else to meet me where I am, and nowhere else. Who would embrace such condescension?&nbsp;<\/p>\n\n\n\n<p><strong>Perspectives<\/strong><\/p>\n\n\n\n<p>There are many ironies that bedevil this discussion. Sometimes forgotten in the American discussion of colonialism, is that the reach of American soft power includes the imposition of many of America’s cultural values and expectations &#8211; including the expectation that other cultures accept particular ideas of social justice. This is how it’s always been: dominant powers have always used their mercantile strength to trade only with those who support their interests, and to force change on weaker states in exchange for access. The demand that another polity acquiesce to a particular economic programme, or change its political process or even its leaders, is a familiar trope of imperial power, past and present; in the context of what we think of as <a href=\"https:\/\/www.bbc.co.uk\/programmes\/p0054594\" target=\"_blank\" rel=\"noopener\">the American Century<\/a>, <em>pax americana <\/em>extended this to the rights revolution, a process that I might understate as not being without irony.&nbsp;<\/p>\n\n\n\n<p>If you live in the English-speaking world, the dominance of American culture and ideas is unavoidable, delivered through hard realities and soft political power, including tech companies, social media, streaming services, creative industries, and so on. American concerns inevitably become ours, too. And of course, plenty of American history is also English history, and so we have some shared responsibilities. None of this is easy to parse.&nbsp;<\/p>\n\n\n\n<p>In trying to decode the complexities of the culture war, nothing is as one-eyed and simplistic as those on the political extremes would have us believe. A culture war is, by definition, a place of chronic disagreement, where certainties can be misplaced or erased, and extremists and populists can find an audience. Gramsci saw this time between changing worlds as a place of chaos, when ‘a great many morbid symptoms appear’. This is more colourfully translated as ‘a time of monsters’, and Gramsci’s monsters were embodied by the fascism of the 1930s. (Stalin was another monster, but Gramsci put this aside; he was writing as a communist sitting in Mussolini’s jail). The current intolerance that accompanies deep political polarisation is a place where monsters might be born.&nbsp;<\/p>\n\n\n\n<p>In these particularly uncertain times, it takes a great deal of confidence, or hubris, or arrogance for anyone, let alone a school leader, to assume they have the right answer, and to then believe they have the moral authority to impose this on others. But school leaders do have to lead, and the process of learning is not without choice and bias. It is a difficult but profound responsibility: school leaders owe it to every child to support compassionate discourse and critical inquiry, and to allow everyone to be recognised, understood and valued. And, somehow, we need to keep the politics and the monsters out of the room.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an international school leader, in a vibrant, multicultural city, it’s fair to say that I meet parents, students and staff with incredibly diverse outlooks and opinions. Identity is decidedly not homogeneous. Part of my job is to navigate the many currents that this difference generates, while providing enough commonality and consensus that everyone can [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[37],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15275"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=15275"}],"version-history":[{"count":4,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15275\/revisions"}],"predecessor-version":[{"id":15291,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15275\/revisions\/15291"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=15275"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=15275"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=15275"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}