{"id":15498,"date":"2023-04-10T09:10:05","date_gmt":"2023-04-10T09:10:05","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=15498"},"modified":"2023-05-08T18:10:09","modified_gmt":"2023-05-08T18:10:09","slug":"a-co-founder-thinks-back-over-halcyons-first-ten-years","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/a-co-founder-thinks-back-over-halcyons-first-ten-years\/","title":{"rendered":"A co-founder thinks back over Halcyon&#8217;s first ten years"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1-1024x341.png\" alt=\"\" class=\"wp-image-15500\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-1.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Early on in the discussions that were to become Halcyon, co-founders Achim, Julie, Pamela and I were inspired by a number of overlapping visions of why we needed to create Halcyon. As we reflect on our first ten years, I’d like to share with you what led me on this journey which, frankly, has become a life-defining achievement for me. I hope it has been an equally life-affirming experience for those who have become involved with Halcyon; as student, staff, parent or otherwise.<\/p>\n\n\n\n<p>Thinking back on the early conversations, we were committed to creating an innovative, student-centred learning environment. One based on current research and modern thinking. We read books and articles, attended talks and conferences, visited other schools and were attracted to the educators who spoke of making education more relevant and innovative, such as Sugata Mitra and Sir Ken Robinson. Both of these educational leaders spoke endlessly about how student-centred learning allows students to take ownership and raises their level of engagement. That spoke to us!<\/p>\n\n\n\n<p>Education seemed to be one of the very few sectors whose approach had barely changed in decades. Yet we all expect and want the “latest” thinking when it comes to healthcare, engineering and more. Why did society seem to accept yesteryear for education &#8211; which should be our investment in the future &#8211; when the rest of the world constantly evolves?&nbsp;<\/p>\n\n\n\n<p>When you start a project like this you also want to hear from others about their experiences; what went well or badly? And all I could hear in my head was Alice Cooper’s <em>School’s Out<\/em> and Pink Floyd’s <em>The Wall.<\/em><\/p>\n\n\n\n<p>So, I started asking adults what they remembered about school. I heard a couple of great memories about a terrific teacher or falling in love with what is now their career or passion, but largely, there were so many negative associations. Some were about not learning or learning very little. Many were about feeling misunderstood, left out, bullied or feeling forced to “be a certain way” to fit in. I remember a 30 year old telling me he went to boarding school at age six. As an American, this was very foreign to me. I asked him, “how was it?” “Oh, it was horrible, but I made excellent connections.”&nbsp;<\/p>\n\n\n\n<p>This further motivated me to find a way to get education “right”. Or at least a heck of a lot better. How could we take these precious, formative childhood years, entrusted to us, and make something meaningful, purposeful and enjoyable out of them? Something that truly empowers young people to be ready for the next phases of their lives, not just to get good grades.<\/p>\n\n\n\n<p>Halcyon was going to be very different. A place students wanted to come to learn and grow and where staff would continue to develop their skill sets as well.<\/p>\n\n\n\n<p>These and so many other thoughts brought us to our mission statement: to bring out the unique potential of each student. To truly understand the origins of the word educate. It comes from the Latin, both <em>“educare”<\/em> and <em>“educere”<\/em>. <em>Educare<\/em> means to shape and train, i.e. to make sure certain existing skills and knowledge are taught. <em>Educere<\/em> means to lead or draw out, i.e. to bring out the abilities and thinking unique to that learner. Education, for too long, has leaned on <em>educare <\/em>and doesn’t make enough room for <em>educere.<\/em> We were determined to change that at Halcyon.&nbsp;<\/p>\n\n\n\n<p>We had all come from a for-profit school, so that was another focal point: financial transparency with all income being invested into the education. We established Halcyon as a charity as soon as possible.<\/p>\n\n\n\n<p>After a brisk fundraising period in 2013 where parents lent the school the funds to begin Halcyon, we renovated 33 Seymour Place and opened our doors in September 2013 with grades 6-9. With 34 students and 13 staff it was all go!&nbsp;<\/p>\n\n\n\n<p>Our first Ofsted inspection happened quite soon after we opened. It was nerve racking yet exhilarating. At first, one inspector did not like seeing the iPad tablets. Then she saw how they were used by our staff and students. “Do you have any idea how much time you save settling classes into learning? Most teachers lose 2-5 minutes of each class just trying to get students’ attention.” We got our first and only Good. A school cannot be rated as Outstanding on the first inspection because it’s based on sustaining and growing best practice. But we were on our way and have received Outstanding from Ofsted and excellent reports from the International Baccalaureate and the New England Association of Schools and Colleges ever since.&nbsp;<\/p>\n\n\n\n<p>On the last day of school of our first year, in June 2014, we gave out yearbooks one hour before the end of term. The Stern Hall was set up for students to mix, mingle and sign each other&#8217;s books. The end of the day came. I think it was 15.45 back then. No one left. Then came 16.30; the Hall was still full. Around 17.00, students started ambling out of the building together laughing and talking.<\/p>\n\n\n\n<p>No more <em>School’s Out.&nbsp;<\/em><\/p>\n\n\n\n<p>We grew from strength to strength, in size, winning awards and remaining true to our mission. This included starting our Bursary Programme as early as our second year, 2015. Another goal of the co-founders: to be able to offer a Halcyon education to students who could not otherwise afford it. Years after they have left Halcyon, we are hearing back from our Bursary Alums like Grace and Finley. “‘A lifesaver,” “Exposure to a truly international community,” “close-knit community,” “great self-confidence,” “a great IB education.”<\/p>\n\n\n\n<p>Ten years on, what makes the deepest and most positive impression on me is all the students I’ve seen come to Halcyon and flourish. Seeing a shy new student who doesn’t quite look you in the eye and then, months later, they stand taller and are taking full part in our learning community. When Isaac came to us in Grade 8, I believe, he was quiet. I’d see him on his own. By graduation it was a different story and now Isaac is an artist, writer, collector. Halcyon’s first alum to exhibit at the Royal Academy Summer Exhibition.&nbsp;<\/p>\n\n\n\n<p>I love seeing teachers collaborate on fantastic interdisciplinary projects, like the science of colour, the geometry of islamic art, the language of propaganda in history, and Spanish political film-making. And our curriculum keeps evolving. We love the IB, but our staff see more opportunities to open doors for our students’ curiosity, creativity and budding passions. That’s how our Explorations came about. Completely outside of the IB and yet an important learning experience to support IB goals and lifelong skills &#8211; independent and project learning.<\/p>\n\n\n\n<p>Seeing what our parents do for our staff is another heartwarming experience. So much appreciation, again, expressed in so many creative ways. Wonderful, personal cards of appreciation, delicious food and treats, displayed with such bounty and beauty!<\/p>\n\n\n\n<p>Most of our first two graduating classes have graduated from university. Seeing the paths they are taking is immensely gratifying. Some are becoming doctors and lawyers. Some are out in the working world in a variety of fields and countries, from the UK to Japan to the US and Canada and all over Europe. From the arts, to digital to psychology. Some are in engineering, fashion, tech, and film. It’s too vast to list here, but you get the idea. And this is with just our first 100 or so alumnus.<\/p>\n\n\n\n<p>Recently, a member of the class of 2022, Cosmo, came back to speak to parents at the Meet the Board evening in January. He is working with members of our community on a university business project. He brought some of his uni colleagues to visit and work with members of staff and students. He spoke so warmly of his memories of Halcyon and how he feels it prepared him well for his current endeavours.&nbsp;<\/p>\n\n\n\n<p>When I look at Halcyon and see all the initiatives we’ve researched, trialled and perhaps implemented it confirms that we are still true to ourselves. Staff and students constantly bring new ideas to the table and they are often integrated. If the School sees its value in honouring our mission, it’s woven into the fabric of how we function. No fads. To back this up, staff receive ample continued professional development for initiatives so they truly can be embedded. From digital literacy to cognitive coaching to mindfulness, not to mention ongoing curricular training from the IB and other organisations. Our Trustees receive regular training as well.<\/p>\n\n\n\n<p>This all leads to dynamic, strong student voice. An important step towards taking ownership of learning. Our students started as early as our first year with a Model United Nations Conference with international visiting schools. Then the Genocide Conferences. This year, at the end of March, I attended our first Consensus Conference on inclusion and diversity. These are all all-student led events, from budgeting to websites to invitees to programming. This is just one area where Halcyonites shine.<\/p>\n\n\n\n<p>Our initial goal was to support lifelong learning, and to provide a life-readying education where people become productive members of society and find ways to give back. I think it’s fair to say that each year, everyone involved with Halcyon has learned and evolved in how we pursue those goals. Here at Halcyon, it’s impossible not to.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/10years\/\"><strong>10 years of pioneering education<\/strong><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Early on in the discussions that were to become Halcyon, co-founders Achim, Julie, Pamela and I were inspired by a number of overlapping visions of why we needed to create Halcyon. As we reflect on our first ten years, I’d like to share with you what led me on this journey which, frankly, has become [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15498"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=15498"}],"version-history":[{"count":4,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15498\/revisions"}],"predecessor-version":[{"id":15687,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15498\/revisions\/15687"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=15498"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=15498"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=15498"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}