{"id":15619,"date":"2023-04-21T10:03:55","date_gmt":"2023-04-21T10:03:55","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=15619"},"modified":"2023-04-21T10:04:02","modified_gmt":"2023-04-21T10:04:02","slug":"our-director-describes-his-experience-at-halcyon","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/our-director-describes-his-experience-at-halcyon\/","title":{"rendered":"Our Director describes his experience at Halcyon"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2-1024x341.png\" alt=\"\" class=\"wp-image-15620\" width=\"1024\" height=\"341\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2023\/04\/image-2.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>The process and purpose of education is undergoing profound change, to meet the needs of both the digital economy and our own sense of well-being. Halcyon stands at the front of this change; our very foundation was a response to the many ills of factory-style education &#8211; which can be homogenous, blunt, uninquiring and authoritarian &#8211; and the recognition that education should be joyful, inclusive, challenging and personal. Over ten years we have created a school that has valued innovation &#8211; the search for <em>better ways of learning<\/em> &#8211; as the driver for excellence.  <\/p>\n\n\n\n<p>The theme of change is important to our school. Everyone who joins our community has the understanding that open inquiry and intellectual curiosity lay at the foundation of human creativity. The IB curriculum, maybe uniquely, allows us both to deliver an academically demanding programme and so to place students at the best universities, <em>and <\/em>to build creative solutions to questions of student wellbeing, or digital learning. We have created a culture that allows us to step outside our expectations and ask, ‘what next?’ And gives students the intellectual curiosity and creativity to be adaptable, flexible, and open-minded; ready to embrace change, and harness it for their own wellbeing and for the betterment of those around them, To make the world a better place, as the IB mission encourages us.&nbsp;<\/p>\n\n\n\n<p>An avatar for much of the change that the digital revolution has brought might be artificial intelligence, or AI. It is&nbsp; certainly the subject <em>du jour<\/em>: this emerging technology generates uncomfortable questions about who we are, our purpose, and even the nature of our independence and sense of self. It combines two common anxieties: firstly, that technology will, ultimately, control us; and secondly, that man-made things are unnatural and so unhealthy in some way. These are age-old worries: some considered the first locomotives to be dangerous because the fastest speed a human could safely travel was on horse, a part of the natural world, and to board this iron beast would be to invite instant death. The fear of control by machines has been around for as long as there have been machines, but The Terminator is not coming any time soon. And yet, in resisting this change, many schools have become what they fear. They ban phones, enforce silent corridors, and subject children to needless expressions of authority from teachers, to teach as if students were commodities, proceeding down the factory line to have new bits of knowledge welded into their minds. At the end of the line, like all manufactured terms, students are tested to see if they pass, and are given a certificate of worthiness.&nbsp;<\/p>\n\n\n\n<p>Halcyon has always been proud to not be like this. Yes, we have examinations and, yes, we are proud of the young people who leave us with extraordinary results, enjoying academic success and placements at leading universities. But, we do this differently. We do this with joy, and a love of learning; we bring disciplines together to explore learning form new perspectives; we are most concerned with skills &#8211; how to manipulate knowledge and create new understandings, rather than simply knowing something for a test; and, most importantly, we are more concerned with each individual as person first and a student second.&nbsp;<\/p>\n\n\n\n<p>Over ten years, we have brought the very best teachers to our school, and the learning and teaching is supported by high professional expectations that we share and reinforce every day. We embrace new technologies; we listen to young people; we innovate to improve what we do and enrich who we are; and we have built a community that is founded on the certainty that the world, and education, is changing &#8211; and this is exciting. The pioneering learning that characterises our school means Halcyon students will have the skills to thrive in this new world &#8211; prepared for now and the future.<\/p>\n\n\n\n<p><a href=\"https:\/\/halcyonschool.com\/10years\/(opens in a new tab)\"><strong>10 years of pioneering education<\/strong><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The process and purpose of education is undergoing profound change, to meet the needs of both the digital economy and our own sense of well-being. Halcyon stands at the front of this change; our very foundation was a response to the many ills of factory-style education &#8211; which can be homogenous, blunt, uninquiring and authoritarian [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15619"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=15619"}],"version-history":[{"count":2,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15619\/revisions"}],"predecessor-version":[{"id":15622,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/15619\/revisions\/15622"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=15619"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=15619"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=15619"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}