{"id":18485,"date":"2024-01-19T10:05:11","date_gmt":"2024-01-19T10:05:11","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18485"},"modified":"2024-01-22T08:55:46","modified_gmt":"2024-01-22T08:55:46","slug":"inquiry-based-learning","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/inquiry-based-learning\/","title":{"rendered":"Inquiry-Based Learning At Halcyon: 4 Ways Halcyon Embraces the IB Philosophy"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1-1024x341.jpg\" alt=\"Exploring Inquiry Based Learning at Halcyon\" class=\"wp-image-18503\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1-1024x341.jpg 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1-300x100.jpg 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1-768x256.jpg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1-600x200.jpg 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/01\/Inquiry-Learning-Blog_Web-Banner_Jan-2024-1.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Learn how Halcyon students are active and independent learners, ready for a rapidly changing world. Kerry Jenkins, our IB MYP Coordinator, explores how our unique take on the IB curriculum encourages inquiry-based learning and prepares students for real-life challenges.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Exploring Inquiry-Based Learning at Halcyon<\/strong><\/h2>\n\n\n\n<p>Inquiry learning constitutes the cornerstone of the International Baccalaureate (IB) Middle Years Programme (MYP), fostering curiosity, critical thinking, research skills, and interdisciplinary learning among students. At Halcyon, we seamlessly integrate inquiry-based learning into our educational framework through the IB&#8217;s Approaches to Learning. Our commitment lies in prioritising questioning, emphasising the &#8216;why&#8217; and the &#8216;how&#8217;.&nbsp; Our approach empowers students to contextualise their learning, laying the groundwork for inquiry-based skills across various formats, from project-based learning to vibrant in-class discussions. We believe in nurturing critical and creative thinking within a safe learning environment where innovative ideas flourish. Furthermore, aligned with Halcyon’s wellbeing culture, our community equally values socio-emotional learning alongside content-based learning, ensuring that students develop self-management and metacognitive reflection.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Nurturing Curiosity and Questioning<\/strong><\/h2>\n\n\n\n<p>Halcyon’s culture of curiosity and questioning permeates every aspect of our learning community. Inside our classrooms, students are encouraged to nurture their inquisitive nature. In Science, they formulate their own inquiry questions; in Design, they test prototypes, and in Individuals &amp; Societies, they challenge ideas and explore diverse perspectives. We value student involvement and actively encourage students to shape their educational experiences; we believe that young voices construct a meaningful and relevant landscape where teachers and students continuously learn and grow together.&nbsp; For instance, one of our ongoing initiatives involves infusing more diversity into our written curriculum.&nbsp; Students lead workshops focused on curriculum development, engaging teachers in thought-provoking discussions. This prompts not only questioning &#8216;what we teach&#8217; but also &#8216;how we teach,&#8217; delving into the significance of &#8216;why we teach’.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Fostering Critical Thinking<\/strong><\/h2>\n\n\n\n<p>Critical thinking at Halcyon extends beyond the classroom. Our MYP teachers emphasise meaningful action, encouraging students to consider how they can apply newly acquired knowledge in real-world contexts.&nbsp; By actively seeking diverse perspectives and exploring a range of potential solutions, students not only sharpen their critical thinking but also cultivate leadership qualities, essential skills for future global leaders.<\/p>\n\n\n\n<p>Furthermore, Halcyon’s approach to technology and research methodologies emphasises critical thinking about the origin, purpose, and value of presented information. We encourage a responsible use of technology, including AI.&nbsp; For instance, Grade 8 Science students developed digital campaigns against climate change, while Grade 10 History students created virtual museums focusing on social justice, demonstrating a commitment to bettering the world. Our in-class experiences are designed to serve as platforms that contribute to both local and global environments.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Building Research Skills<\/strong><\/h2>\n\n\n\n<p>Accessing information from varied sources and critically evaluating their relevance is embedded in the MYP assessment criteria across disciplines.&nbsp; At Halcyon, we have developed an informational literacy scope and sequence, culminating in the Personal Project.&nbsp; Personal Projects are non-assessed initiatives that allow MYP students to explore individual interests, where they research and source information, refining skills later utilised in the DP&#8217;s Extended Essays. These research-skills building projects not only nurture students’ passions but also reinforce the notion that learning extends beyond assessment and grades, fostering a safe and supportive environment for students to tap into their curiosities.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Embracing Interdisciplinary Learning<\/strong><\/h2>\n\n\n\n<p>A distinctive feature of the MYP is interdisciplinary learning. Each grade completes an Interdisciplinary Unit (IDU) per year. For instance, Halcyon Grade 7 students explore connections between science and art, investigating how Impressionist artists used science to innovate representation of light and colour, bridging their understanding of colour mixing and human perception. These experiences enable students to transfer knowledge and skills across subjects, emphasising multidimensional learning approaches.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how Halcyon students are active and independent learners, ready for a rapidly changing world. Kerry Jenkins, our IB MYP Coordinator, explores how our unique take on the IB curriculum encourages inquiry-based learning and prepares students for real-life challenges. Exploring Inquiry-Based Learning at Halcyon Inquiry learning constitutes the cornerstone of the International Baccalaureate (IB) Middle [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[59,57],"tags":[77,70],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18485"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18485"}],"version-history":[{"count":19,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18485\/revisions"}],"predecessor-version":[{"id":18509,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18485\/revisions\/18509"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18485"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18485"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18485"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}