{"id":18582,"date":"2024-02-13T11:43:47","date_gmt":"2024-02-13T11:43:47","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18582"},"modified":"2024-02-13T13:27:43","modified_gmt":"2024-02-13T13:27:43","slug":"community-spotlight-student-agency","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/community-spotlight-student-agency\/","title":{"rendered":"Community Spotlight: Thomas Beaudet and Cosmo Vollauschek, Class of 2022"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner-1024x341.png\" alt=\"Two Class of 2022 graduate, Thomas and Cosmo, reflect on student agency and the opportunities offered by Halcyon\" class=\"wp-image-18584\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner-600x200.png 600w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/02\/Thomas-and-Cosmo_Community-Spotlight_Blog-Post-Banner.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>At Halcyon, student agency is a vital element of our pioneering approach to the International Baccalaureate (IB). Thomas Beaudet and Cosmo Vollauschek (Class of 2022) kindly took time out of their schedules as university students and burgeoning entrepreneurs to reflect on their experience of our enriched IB curriculum and the opportunities that helped them on their path to successful and fulfilling futures.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Explorations Programme &#8211; Unique to Halcyon<\/h2>\n\n\n\n<p>Reflecting on experiences at Halcyon, Cosmo and Thomas both highlighted our <a href=\"https:\/\/halcyonschool.com\/student-life\/explorations\/\" target=\"_blank\" data-type=\"URL\" data-id=\"https:\/\/halcyonschool.com\/student-life\/explorations\/\" rel=\"noreferrer noopener\">Explorations Programme<\/a> &#8211; unique to Halcyon &#8211; as memorable because of the breadth of opportunity and intellectual challenge it provided.<\/p>\n\n\n\n<p>“The Political Studies and Social Media Explorations Classes [&#8230;] I found quite remarkable,” notes Cosmo, who was struck by how “nuanced, complex and developed a topic” the Political Studies class was. This intellectual challenge was counterbalanced for him by the “really empowering” nature of the Social Media Exploration, through which he and other students took on the responsibility of planning and delivering “a takeover of Halcyon’s Instagram account”.<\/p>\n\n\n\n<p>Thomas is quick to agree, describing himself as “blown away by the Explorations Programme”, remembering particularly the Political Debate and Virtual Reality (VR) classes. “It’s a privilege that the school provides all these possibilities,” he reflects, urging current students “to stay curious” so they can “reap the benefits”.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Empowering Student Ambassador Programme<\/h2>\n\n\n\n<p>At this point, the conversation turns to our Student Ambassador scheme &#8211; a topic that animates both.&nbsp;<\/p>\n\n\n\n<p>Thomas takes us right back to his first year at Halcyon, reflecting on the empowering effect of taking a risk and stepping outside his comfort zone. “I remember in my first year at Halcyon I took what felt like a leap of faith by becoming a Student Ambassador. I had just moved to an English-speaking environment, where I had to represent an institution and an educational organisation. The role required me to speak with teachers, peers, parents, and prospective students. Being a Student Ambassador was memorable because it taught me so much about an essential skill: communication. Learning how to communicate effectively was extremely formative.”<\/p>\n\n\n\n<p>Keenly building on this, Cosmo pinpoints the Ambassador Programme as a key enabler of some of his “proudest feats” at Halcyon, including its role in developing self-knowledge.&nbsp;<\/p>\n\n\n\n<p>“The enormous autonomy that the school gives its students [&#8230;] it actually begins with being a Student Ambassador.&nbsp;<\/p>\n\n\n\n<p>“At the age of&nbsp; 10, I was given the opportunity to represent the school at Open House events for prospective families and students in all sorts of formats; it was an enormous responsibility to hand to a child and yet done so in a way that let me learn so much about myself by representing this institution.”<\/p>\n\n\n\n<p>Like Thomas, Cosmo took a risk in signing up to the Ambassador Programme. By taking that leap of faith, he soon found other opportunities opening up.&nbsp;<\/p>\n\n\n\n<p>As an ambassador he “was given the opportunity to represent the Halcyon student community to sort delegates of the French Ministries of Finance and Education who were visiting Halcyon at the time to discuss technology in learning. On a more continuous basis, the simple fact of being able to represent an institution through Open Houses was a point of real pride and enjoyment for me. So much so that, in fact, by continuing as Student Ambassador at ESCP Business School, 2025 will mark my ten years with the title!”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Fostering Student Agency and Autonomy<\/h2>\n\n\n\n<p>The theme of autonomy is picked up by Thomas, who places it “at the core” of the moments he’s most proud of, because “it is from experiences where we were given responsibility, which fostered autonomy, that I learned the most.”&nbsp;<\/p>\n\n\n\n<p>From student-led conferences, through the Student Council, to the Model United Nations (MUN), Thomas and Cosmo took full advantage of the opportunities offered by our enriched IB curriculum.<\/p>\n\n\n\n<p>Thomas notes that these experiences called for them to step up. “Rising to the occasion is something I&#8217;d like to emphasise because, from the point of view of a school, it might seem unusual to put responsibility in the hands of students. But as a student, I remember feeling intimidated &#8211; in the best of ways. I wanted to rise to the occasion, and all of us challenged ourselves to play our part, even when it demanded a lot from us (like public speaking, which I was terrified of). We achieved things we didn&#8217;t think we were capable of only because we were given autonomy and responsibility. This is empowering.”<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Advice for Current Students<\/h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Cosmo summarises this with “Three Ps: Privilege, People and Purpose”.&nbsp;<\/p>\n\n\n\n<p>“In my commencement address at our Graduation, I introduced three rules of privilege: one needs to be able to recognise privilege, to use privilege and &#8211; arguably most importantly &#8211;&nbsp; to use it to help others.&nbsp;<\/p>\n\n\n\n<p>“Next, the ‘P’ of People, because we have such a unique and indescribably rich opportunity for connection with the student and faculty community. Halcyon is a unique opportunity to make connections that can last a lifetime.<\/p>\n\n\n\n<p>“Finally, ‘P’ for Purpose: we are given so much freedom as students, and we are handed so many opportunities to take on responsibility that there is no better breeding ground for developing a good sense of purpose and finding one’s true interests than at Halcyon. Use that freedom to experiment, explore, and find a driving force.”<\/p>\n\n\n\n<p>Thomas builds on this: “I would urge students to show gratitude by staying curious and keeping an active interest and involvement in all of the opportunities that Halcyon offers them.<\/p>\n\n\n\n<p>“Stay curious. Halcyon offers a world of opportunities, activities and pursuits.”<\/p>\n\n\n\n<p>As burgeoning entrepreneurs, it is safe to say that Thomas and Cosmo are living by these values. Stay tuned for Part Two of their reflections, where they talk about their path to university and building a successful and fulfilling career.<\/p>\n\n\n\n<p class=\"has-small-font-size\">Thomas Beaudet is currently at <a href=\"https:\/\/hkust.edu.hk\/\" target=\"_blank\" rel=\"noreferrer noopener\">Hong Kong University of Science and Technology (HKUST)<\/a> studying BSc World Bachelor in Business.<\/p>\n\n\n\n<p class=\"has-small-font-size\">Cosmo Vollauschek is currently at the <a href=\"https:\/\/escp.eu\/\" target=\"_blank\" data-type=\"URL\" data-id=\"https:\/\/escp.eu\/\" rel=\"noreferrer noopener\">ESCP (École Supérieure de Commerce de Paris) Business School<\/a> studying BSC Bachelor in Management.<\/p>\n<\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>At Halcyon, student agency is a vital element of our pioneering approach to the International Baccalaureate (IB). Thomas Beaudet and Cosmo Vollauschek (Class of 2022) kindly took time out of their schedules as university students and burgeoning entrepreneurs to reflect on their experience of our enriched IB curriculum and the opportunities that helped them on [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[59,57,86],"tags":[91,90,89,77,68],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18582"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18582"}],"version-history":[{"count":8,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18582\/revisions"}],"predecessor-version":[{"id":18594,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18582\/revisions\/18594"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18582"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18582"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18582"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}