{"id":18665,"date":"2024-03-01T10:22:21","date_gmt":"2024-03-01T10:22:21","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18665"},"modified":"2024-03-01T10:38:21","modified_gmt":"2024-03-01T10:38:21","slug":"student-wellbeing-academic-excellence","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/student-wellbeing-academic-excellence\/","title":{"rendered":"Student Wellbeing Powers Academic Excellence At Halcyon"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"1200\" height=\"400\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Underpinning-academic-success-with-wellbeing-banner.png\" alt=\"Student Wellbeing Underpins Academic Success Blog Banner with picture of Director, Barry Mansfield\" class=\"wp-image-18666\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Underpinning-academic-success-with-wellbeing-banner.png 1200w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Underpinning-academic-success-with-wellbeing-banner-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Underpinning-academic-success-with-wellbeing-banner-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Underpinning-academic-success-with-wellbeing-banner-768x256.png 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/figure>\n\n\n\n<p>At Halcyon we take a human-centred approach to education, enabling our school to become a centre of both academic and wellbeing excellence. In his recent editorial for <a href=\"https:\/\/www.independentschoolsmagazine.co.uk\/\" target=\"_blank\" rel=\"noreferrer noopener\">Independent Schools Magazine<\/a>, our Director, Barry Mansfield, articulates how <a href=\"https:\/\/halcyonschool.com\/student-life\/wellbeing\/\" target=\"_blank\" rel=\"noreferrer noopener\">student wellbeing<\/a> is foundational to academic success. <\/p>\n\n\n\n<p><a href=\"https:\/\/www.independentschoolsmagazine.co.uk\/issues\/2024-february\/index.html#p=12\" target=\"_blank\" rel=\"noreferrer noopener\">Access the full article in the February Edition of Independent Schools Magazine<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Student Wellbeing Crucial Factor In Academic Success, Research Indicates<\/h2>\n\n\n\n<p>Every school is interested in academic excellence, however you might wish to measure or describe it. Whether you are independent or maintained, highly selective or open, operate in the mainstream or specialise &#8211; with students of different abilities, for example &#8211; academic outcomes matter. And, as a school leader, one should have a clear understanding of how academic achievement relates to school culture and values, and to the wellbeing of everyone in the community.<\/p>\n\n\n\n<p>A <a href=\"https:\/\/medicine.yale.edu\/news-article\/new-research-published-in-child-development-confirms-social-and-emotional-learning-significantly-improves-student-academic-performance-well-being-and-perceptions-of-school-safety\/\" target=\"_blank\" rel=\"noopener\">recent study from Yale School of <\/a><a href=\"https:\/\/medicine.yale.edu\/news-article\/new-research-published-in-child-development-confirms-social-and-emotional-learning-significantly-improves-student-academic-performance-well-being-and-perceptions-of-school-safety\/\" target=\"_blank\" rel=\"noreferrer noopener\">Medicine<\/a> of Social Emotional Learning (SEL) programmes worldwide &nbsp;reconfirmed the evidence that many of us have read before –&nbsp;and understood in our bones all along: <em>“Students who participated in SEL programs do better in school, academically and socially.”&nbsp; <\/em>This included improved attendance and engagement in learning.<\/p>\n\n\n\n<p>It should be obvious that student wellbeing underpins academic success, and many of the tools teachers reach for &#8211; Seligman’s <a href=\"https:\/\/positivepsychology.com\/perma-model\/\" target=\"_blank\" rel=\"noopener\">positive psychology<\/a>, or Dweck’s <a href=\"https:\/\/www.studentachievement.org\/wp-content\/uploads\/Carol-Dweck-Revisits-the-Growth-Mindset.pdf\" target=\"_blank\" rel=\"noopener\">growth mindset<\/a> &#8211; will be familiar to school leaders. Also familiar will be mentor programmes and, maybe, mindfulness practice. It should be easy to say to parents that their child’s wellbeing is more important than their academic success. Yet many of us will know that examinations place intolerable stresses on certain students, and that school systems can be rigid and unaccommodating of even the simplest of student wellbeing needs.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What Is Student Wellbeing?<\/h3>\n\n\n\n<p>To be academically successful one needs to have a sense of wellbeing: physically, emotionally and socially. To “be well”’ can be defined in so many ways that it can be easier to define it by what it is not, which accounts for the current focus on mental health issues. <\/p>\n\n\n\n<p>This is a mistake: schools should not, as the <a href=\"https:\/\/healthmedia.blog.gov.uk\/2023\/06\/09\/how-we-are-supporting-mental-health-services-in-england\/\" target=\"_blank\" rel=\"noopener\">U.K. government is doing<\/a>, simply be focused on the consequences (though it might be argued that the government is so wrong-footed that they have little choice). Instead, we should address the causes, which can be that schools sometimes forget to be human-centred and instead are constantly bound-up in technical, bureaucratic, management or problem-solving. We spend too much time looking at the cogs and wheels of our systems, and not enough at the human beings. What does this mean in practice?<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Our Approach To Student Wellbeing In Practice<\/h4>\n\n\n\n<p>Firstly, your school does need a definition of student wellbeing. At Halcyon, we use the <a href=\"https:\/\/www.hgi.org.uk\/human-givens\/introduction\/what-are-human-givens\" target=\"_blank\" rel=\"noopener\">Human Givens Institute’s Emotional Needs<\/a>. To select a few of these needs, to<em> <\/em>be well we all require physical security; a sense of autonomy and control; emotional intimacy (to be known for who we are); meaning and purpose; and a sense of belonging (to the school community). <\/p>\n\n\n\n<p>At Halcyon we think of this as beginning with agency; that student voice &#8211; being able to make real decisions and have an authentic say in how a school functions &#8211; is a foundation on which individuals build a sense of self and belonging. We also understand that an individual’s sense of belonging requires us to be <a href=\"https:\/\/graduate.northeastern.edu\/resources\/culturally-responsive-teaching-strategies\/\" target=\"_blank\" rel=\"noopener\">culturally responsive<\/a>; that inclusion means that everyone’s identity and culture is recognised in the classroom. And when we have belonging, and all the trust and respect and engagement and compassion that accompanies it, then we have a sense of wellbeing. No-one feels well when they are excluded or not recognised<\/p>\n\n\n\n<p>Secondly, programmes to foster social and emotional intelligence will not happen on the margins &#8211; in PSHE, or mentoring. They need to be in the centre, and as an International Baccalaureate school it is a part of our curriculum to teach effective skills to support self-regulation and self-awareness. <\/p>\n\n\n\n<p>We also invest in <a href=\"https:\/\/www.thinkingcollaborative.com\/cc-resources\" target=\"_blank\" rel=\"noreferrer noopener\">cognitive coaching<\/a> training for all our staff. This provides the foundation for all discussions with students including a weekly conversation between mentor and mentee, when teachers listen in a process designed to reflect student concerns and to create new understandings. This is extraordinarily empowering for young people, and it both meets their wellbeing needs and provides them with the social and emotional skills that are a bedrock for better academic performance.&nbsp;<\/p>\n\n\n\n<p>Cognitive coaching is expensive to implement schoolwide, but there are so many obvious benefits. With better SEL competencies across the community, we reduce reliance on old fashioned discipline models. As the community is better able to regulate itself &#8211; because we focus on the people and not the systems &#8211; we no longer need hours of expensive teacher time spent on the administrative disciplinary treadmill. <\/p>\n\n\n\n<p>In fact, we no longer need those systems at all, and now function successfully with a restorative practice approach, which allows students and staff to mediate conflict with the goal of restoring our relationships. This process takes time, but the investment we make in young people signals that their needs are being recognised, and this is a place they can belong. Restorative practice supports everyone’s wellbeing; old fashioned crime-and-punishment systems do not.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">Academic Excellence Powered By Student Wellbeing<\/h5>\n\n\n\n<p>Academic excellence can be achieved in many ways, and you will have your own ideas about what is best for your community. Our students attend competitive universities &#8211; Oxbridge, and Russell Group universities, and Ivy Leagues in the US &#8211; as I am sure your students do too. And my learning has been that a student can only fulfil their full academic <em>and personal <\/em>potential &#8211; to be the very best they can be &#8211; when they have a sense of wellbeing. I would advocate that we all consider what it means to have a human-centred approach to education and how we can make our schools centres of both academic and wellbeing excellence.<\/p>\n\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong> \n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>At Halcyon we take a human-centred approach to education, enabling our school to become a centre of both academic and wellbeing excellence. In his recent editorial for Independent Schools Magazine, our Director, Barry Mansfield, articulates how student wellbeing is foundational to academic success. Access the full article in the February Edition of Independent Schools Magazine. [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[93],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18665"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18665"}],"version-history":[{"count":12,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18665\/revisions"}],"predecessor-version":[{"id":18678,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18665\/revisions\/18678"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18665"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18665"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18665"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}