{"id":18700,"date":"2024-03-15T16:23:15","date_gmt":"2024-03-15T16:23:15","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18700"},"modified":"2024-03-15T16:23:16","modified_gmt":"2024-03-15T16:23:16","slug":"digital-learning-coach","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/digital-learning-coach\/","title":{"rendered":"Community Spotlight: Faye Ellis, Digital Learning Coach"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Community-Spotlight_Current-Staff_Faye-Ellis_Mar-2024-1024x341.png\" alt=\"\" class=\"wp-image-18702\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Community-Spotlight_Current-Staff_Faye-Ellis_Mar-2024-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Community-Spotlight_Current-Staff_Faye-Ellis_Mar-2024-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Community-Spotlight_Current-Staff_Faye-Ellis_Mar-2024-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/03\/Community-Spotlight_Current-Staff_Faye-Ellis_Mar-2024.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Faye Ellis is Halcyon’s tech sage; she is a digital explorations teacher, digital coach for teachers and students, and when she is not in Halcyon, she speaks at global tech events inspiring organisations, students and entrepreneurs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">A Day In The Life<\/h2>\n\n\n\n<p>In the morning, Faye is often found perched in the staff room with a cup of tea. It’s a place of transience, she says, where she can field questions and share ideas with staff members about the latest tech happenings at Halcyon.&nbsp;<\/p>\n\n\n\n<p>Mostly, though, Faye is in the classroom. She works on team teaching and supports teachers in lessons, introduces new apps and tools to students, and promotes ideas for new ways to integrate tech into their projects.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>“At lunch I always make time to pop out for a coffee with colleagues to catch up on how our days are going. In the afternoon, I have my Digital Entrepreneurs Exploration, where Grade 6-9 students are designing and prototyping their own tech products! At the end of the Exploration they’ll be pitching their ideas to people who’ve set up their own tech companies.”<\/em><\/p>\n<\/blockquote>\n\n\n\n<h3 class=\"wp-block-heading\">Enhancing Learning Through Collaborative Integration of EdTech<\/h3>\n\n\n\n<p>Faye has worked on all sorts of projects at Halcyon. This includes helping students create 3D immersive experiences during our Interdisciplinary Learning Days, or educating the Halcyon community on how to navigate the maze of artificial intelligence. She cites her annual digital museum project, whereby Grade 10 students collaborate to make 3D museums using CoSpaces app, as a particularly memorable experience.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>“Students create all the resources themselves &#8211; video, posters, audio, game elements &#8211; and put them together to make an immersive experience. I absolutely love it because students often go far beyond the brief and the work they create is incredible! I also love working with Grade 6 to design and code robot helpers in their final term of Science. We use Microbits, Strawbees kits and LEGO robots to build them.”<\/em><\/p>\n<\/blockquote>\n\n\n\n<p>Another favourite, adds Faye, is one of her rarer tech-free projects. One example was the Grade 7 collaborative project to build a Lunar New Year dragon using cardboard. <em>“They had to work as a team and coordinate the building of all parts so that it fitted together. The finished dragon was about six metres long and the students paraded it around school! It’s great to see students have the opportunity to play, build and be kids sometimes too.”<\/em><\/p>\n\n\n\n<p>Faye’s role as a digital coach ensures our utilisation of digital tools is targeted, curriculum-oriented and research-led, and drives a thoughtful, forward-looking and reflective approach to pedagogy across our team.&nbsp;<\/p>\n\n\n\n<p>However, Faye is quick to credit the collaborative environment of Halcyon, and the teachers, who are both adaptable and genuinely interested in solving problems with technology.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>“<em>Halcyon is completely different to anywhere else I’ve worked! I love that the teachers here are so amazing at what they do, and also how many interests they have outside of school.&nbsp;<\/em><\/p>\n\n\n\n<p><em>“I learn so much from them and everyone is really close. In my role, it’s fantastic because everyone is so willing to explore new tech tools and give honest feedback. There’s definitely a culture of collaboration and risk taking, so people will often try new tools the next day after I introduce them. I also love that the students are so individual and able to express themselves in their own way. There’s so much amazing creative work that happens because they’re given that freedom.”&nbsp;<\/em><\/p>\n<\/blockquote>\n\n\n\n<h4 class=\"wp-block-heading\">Making The Most Of London<\/h4>\n\n\n\n<p>Outside of school, Faye is often drifting through London’s myriad of museums and galleries &#8211; recently visiting and loving smaller museums such as Keats House and Burgh House in Hampstead &#8211; or simply listening to music.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>“<em>I recently got a new record player, so it’s been a lot of fun to hunt for records in charity shops and discover new (old!) music.”<\/em><\/p>\n\n\n\n<p>Like many staff at Halcyon, Faye enjoys the sweet offerings of our neighbouring cafe, So French.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>“The guys who run it are so lovely, and the coffee and pastries are fantastic. I’d particularly recommend the apple tart and the brioche with creme patisserie inside! In my first few weeks at Halcyon, my colleague Martyn took me there for one of those brioches and I’ve been buying them regularly since. One day I’d like to fill my kitchen with all the beautiful French groceries they stock.”<\/em><\/p>\n<\/blockquote>\n<\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>Faye Ellis is Halcyon’s tech sage; she is a digital explorations teacher, digital coach for teachers and students, and when she is not in Halcyon, she speaks at global tech events inspiring organisations, students and entrepreneurs. A Day In The Life In the morning, Faye is often found perched in the staff room with a [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[58,86],"tags":[91,90,80],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18700"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18700"}],"version-history":[{"count":3,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18700\/revisions"}],"predecessor-version":[{"id":18704,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18700\/revisions\/18704"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18700"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18700"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18700"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}