{"id":18800,"date":"2024-04-19T15:19:14","date_gmt":"2024-04-19T15:19:14","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18800"},"modified":"2024-04-22T08:22:52","modified_gmt":"2024-04-22T08:22:52","slug":"halcyon-students-visit-china","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/halcyon-students-visit-china\/","title":{"rendered":"Halcyon Students Visit China"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1-1024x341.png\" alt=\"\" class=\"wp-image-18825\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Written by Tewolde Hagos.<\/p>\n\n\n\n<p>We embarked on a thrilling journey from our cosmopolitan London to the distant lands of modern and ancient China, immersing ourselves in its vibrant local culture. <\/p>\n\n\n\n<p>This learning adventure was about more than just gaining knowledge about China; it was a journey of harnessing and honing outdoor skills, trading and exploring local markets, conquering physical challenges, fostering team-building, mastering culinary skills with nuanced local chefs, and refining language, performance, and presentation skills. So, get ready and prepare a cuppa to read about the unique and unforgettable experiences we had during our stay in China and the places we visited with joy, excitement, curiosity, and inquiry, fostering and acknowledging cultural differences while delving into the Theory of Knowledge: How culture influences knowledge production and communication. We started our journey in Beijing and then explored Chengdu, Xi&#8217;an, and their surrounding cities before concluding our learning expedition back in Beijing.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Beijing<\/h2>\n\n\n\n<p>The Great Wall, The Forbidden City, Summer Palace, Tiananmen Square<\/p>\n\n\n\n<p>We started our learning adventure in Beijing and visited Tiananmen Square, The Forbidden City, The Great Wall, and the Summer Palace—all iconic landmarks in Beijing, China.<\/p>\n\n\n\n<p>Tiananmen Square, a large city square in the centre of Beijing, is also known for its historical and cultural significance. It includes the Tiananmen Tower, the Monument to the People&#8217;s Heroes, the Great Hall of the People, and the Mao Zedong Memorial Hall.<br><\/p>\n\n\n\n<p>The Forbidden City, with its intricate architecture and rich history, was the Chinese imperial palace from the Ming dynasty to the end of the Qing dynasty. Just north of the Forbidden City, we continued our walk on Jingshan Park, a park known for its artificial hill, Jingshan Hill (also known as Coal Hill), which offers panoramic views of the Forbidden City and the surrounding cityscape. Jingshan Park is a popular destination for locals and tourists, offering a serene escape from the bustling city below and stunning views of Beijing&#8217;s historic landmarks. Hence, our visit was greeted with a long queue of tourists and checkpoints.<\/p>\n\n\n\n<p>The Great Wall, a marvel of ancient engineering, stretches thousands of miles across northern China, leaving us all amused by its engineering and significance in old China. It was a great experience to explore what is known and a piece of common knowledge to some of us. However, being there physically and learning more from our education tourist guide about its purpose of building with historical events was sensationally insightful to all of us visiting.&nbsp;<\/p>\n\n\n\n<p>Before visiting the Great Wall of China, our students visited a local market, which allowed our Mandarin students to explore their Chinese language and communicate with the locals while trading. It was a fun, unforgettable, happy experience that kept us laughing while we discussed our local market bargaining experience throughout the trip. We all had one thing in common: we kept looking for local souvenir purchases for our families, loved ones, colleagues, and friends back in London.&nbsp;<\/p>\n\n\n\n<p>In Beijing&#8217;s densely populated area, we had a culinary session at Beijinger&#8217;s kitchen cooking class, which is a walking distance from the famous Confucius temple. We made our own local dumplings, guided and supervised by local chiefs, and fed on what we had created, which was so much fun. Then, to feed our souls with knowledge and find an answer to our curiosity of being IB learners interested in Chinese philosophy, history, and culture, we spent an afternoon visiting The Beijing Temple of Confucius, which is one of the most prominent Confucian temples in China and serves as a place of worship and education dedicated to the memory of the great Chinese philosopher and educator. The temple complex includes halls, pavilions, courtyards, housing statues, large stone tablets(commemorating Confucius&#8217;s teachings and contributions to Chinese philosophy and culture), and other cultural relics related to Confucianism. As our students continued to admire and explore their own philosophies of life, we were immersed in appreciating and learning all about Confucius from our local and best education tourist guides. It was a great feeling to realise that we were standing in pride and with our own life philosophy at a place where the great philosopher stood and taught his philosophy to his disciples and students 2500 years ago.Â&nbsp;<\/p>\n\n\n\n<p>Indeed, whether it is us on this China trip or you, the reader of this blog ( you are awesome for reading this far), would agree with one of the vital central virtues in Confucian ethics philosophy concept:&#8221; Ren&#8221;, often translated as &#8220;benevolence,&#8221; &#8220;humaneness,&#8221; or &#8220;goodness,&#8221;. It emphasises the importance of cultivating virtuous relationships with others and treating them with empathy, kindness, and compassion.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Chengdu<\/strong><\/h3>\n\n\n\n<p>Grand Budha, Chengdu Panda Breeding Research Center, Traditional Chinese tea house performance.<\/p>\n\n\n\n<p>&nbsp;We are in the coach heading to Leshan, the world&#8217;s largest Buddha. This impressive statue is the largest stone Buddha statue in the world and is renowned for its sheer size and architectural grandeur, which took 90 years to finish during the Tang Dynasty. The statue stands at a towering height of about 71 meters (233 feet) and is carved into the cliffside, facing Mount Emei in Leshan. The Leshan Giant Buddha is an impressive feat of ancient engineering and craftsmanship and holds cultural and religious significance as a symbol of Buddhist faith and teachings. The surroundings are full of Buddhist philosophy and way of life, quoting one,&#8217; &#8220;There is no road to happiness, happiness itself is the road&#8221;.<\/p>\n\n\n\n<p>Before visiting Leashan&#8217;s grand Budha statue, yesterday was an exhilarating volunteering work experience for our students and us travelling staff at the Chengdu Panda Breeding Research Center. The work involved caring for pandas, from preparing their food, panda cake (from bamboo), as you might know, students are engaged in SA (service as action) and CAS (creative activity service) as part of the IB curriculum requirements.<\/p>\n\n\n\n<p>In the former project, students in the MYP are engaged in services that positively impact communities and the environment.<\/p>\n\n\n\n<p>In the latter IBDP, students are more inclined to participate in activities demonstrating perseverance and initiative to develop collaboration, problem-solving, and decision-making skills. These enable students to enhance their personal and interpersonal development by learning through experience, and our students are courageous and resiliently engaged in voluntary work at the Panda Centre. This is designed to allow students to self-determination and collaborate with others, fostering a sense of accomplishment and enjoyment for their work.<\/p>\n\n\n\n<p>To echo what the person who has led our activity at the Chengdu Dujiangyan Panda Center said, “The students completed the service faster than the time allocated and were very efficient in doing the work given to them.! And our students now have a certificate issued for their accomplishments.”<\/p>\n\n\n\n<p>Furthermore, to add to what Ella (one of our students on this tour) said about the activity in the panda breeding research centre, &#8220;this is good for my CV&#8221;. Yes, this could be part of the puzzle for students&#8217; future careers, especially as some of them are not far from stepping into studying at university for their career aspirations, this experience could be incorporated into their university applications, and this could give them the edge in the selection.&nbsp;<\/p>\n\n\n\n<p>Finally, students will record their experiences and reflections on ManageBac. Upon completion, the reflection will be approved and commented on by their supervisors at school.<\/p>\n\n\n\n<p>Indeed, personally, the experience contributed to the panda population flourishing and surviving extinction, and I felt satisfied with a sense of accomplishment and pride in contributing to a sustainable earth.&nbsp;<\/p>\n\n\n\n<p>Our late afternoons were full of activities that prolonged to an early evening, whether it was watching the world-renowned face-changing act or a captivating performance that is part of the Sichuan Opera, a traditional form of Chinese opera that originated in Sichuan Province, China. One of the most famous elements of Sichuan Opera is the art of face-changing (from a paper mask without the audience releasing how it&#8217;s done). We enjoyed this unique form of entertainment while sipping on tea in a traditional tea house, immersing ourselves in the rich cultural heritage of Sichuan Province. Or a mesmerising and jaw-dropping acrobatic show at the Beijing Opera House on our second day of arrival in China.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Xian<\/h4>\n\n\n\n<p>Terracotta Warriors, Muslim Quarter and a bike ride.<\/p>\n\n\n\n<p>Terracotta Warriors: Located near Xi&#8217;an city, the Terracotta Army is one of the most significant archaeological discoveries in the world. It consists of thousands of life-sized terracotta sculptures depicting the armies of Qin Shi Huang, the first Emperor of China. Each warrior has unique features and details, representing the military might of the Qin Dynasty. Visiting the Terracotta Warriors offered our students another fascinating glimpse into ancient Chinese history and craftsmanship. Later in the afternoon, our students visited a local Terracotta Warriors factory and had the chance to make their own Terracotta warrior, which was another fun activity we did.<\/p>\n\n\n\n<p>We visited the Muslim Quarter in Xi&#8217;an City, featuring narrow alleys lined with traditional shops and stalls. Students were able to explore a variety of authentic Chinese-Muslim settings, browse unique souvenirs, and immerse themselves in the vibrant atmosphere of this cultural place. The next day, we all enjoyed riding a bike on top of the Xi&#8217;an City Wall, one of China&#8217;s oldest and best-preserved city walls.<\/p>\n\n\n\n<p>As our learning adventure continued, we visited a local school. This was a great social experience for our students, and we were all humbled by the musical reception of the school band. After working together as a team visiting the school&#8217;s classroom, involving calligraphy sessions and assembling technology products such as compass, musical instruments, and papercraft artwork, we then had a football match, which was concluded with the only score scored by Halcyon.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">The Return Home<\/h5>\n\n\n\n<p>On our last day in Beijing, before returning to our palaces and dearly missed families in London, we visited the Summer Palace, a vast ensemble of lakes, gardens, and palaces that served as a retreat for emperors during the Qing dynasty. These landmarks represent centuries of Chinese history and culture, enriching our learning outcomes for the trip.<\/p>\n\n\n\n<p>Throughout our journey, amidst savouring the delicious array of Chinese cuisine, each dish a delightful reflection of the unique flavours of every province we traversed, we found ourselves nourishing not only our bodies but also our minds and spirits with the rich tapestry of China&#8217;s ancient and modern history and culture. This immersive experience has served as a profound catalyst, inspiring us to seek avenues for personal growth, resilience, and unity, drawing strength from the lessons of the past to forge a brighter, more tolerant, and peaceful future.<\/p>\n\n\n\n<p>Thank you to Ms Lin for orchestrating what can only be described as a once-in-a-lifetime odyssey—a journey that will forever remain etched in our memories. And to Halcyon, we express our deepest gratitude for allowing us to transcend classroom walls and immerse ourselves in the living classroom of China.&nbsp;<\/p>\n\n\n\n<p>Every moment was a lesson in self-discovery and cultural understanding, as each travelling student discovered part of the puzzle to fulfil their unique potential.<\/p>\n\n\n\n<p>To our remarkable students, the true stars of our expedition, I offer my utmost admiration and appreciation. Your compassion, kindness, and respect for one another and our host country&#8217;s customs exemplify the finest virtues of global citizens. Your grace, creativity, generosity, boundless curiosity, intellect, and resilience shone brightly throughout our travels, illuminating our path. Well done to each and every one of you—you have truly made this journey an extraordinary success.<\/p>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-4\">\n<div class=\"wp-block-column is-layout-flow\" style=\"flex-basis:100%\">\n<figure class=\"wp-block-gallery has-nested-images columns-default is-cropped wp-block-gallery-1 is-layout-flex\">\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1-724x1024.jpeg\" alt=\"\" class=\"wp-image-18814\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1-724x1024.jpeg 724w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1-212x300.jpeg 212w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1-768x1086.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1-1086x1536.jpeg 1086w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-1.jpeg 1131w\" sizes=\"(max-width: 724px) 100vw, 724px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2-724x1024.jpeg\" alt=\"\" class=\"wp-image-18813\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2-724x1024.jpeg 724w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2-212x300.jpeg 212w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2-768x1086.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2-1086x1536.jpeg 1086w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-2.jpeg 1131w\" sizes=\"(max-width: 724px) 100vw, 724px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3-724x1024.jpeg\" alt=\"\" class=\"wp-image-18816\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3-724x1024.jpeg 724w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3-212x300.jpeg 212w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3-768x1086.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3-1086x1536.jpeg 1086w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-3.jpeg 1131w\" sizes=\"(max-width: 724px) 100vw, 724px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4-724x1024.jpeg\" alt=\"\" class=\"wp-image-18815\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4-724x1024.jpeg 724w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4-212x300.jpeg 212w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4-768x1086.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4-1086x1536.jpeg 1086w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-4.jpeg 1131w\" sizes=\"(max-width: 724px) 100vw, 724px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"576\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5-576x1024.jpeg\" alt=\"\" class=\"wp-image-18811\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5-576x1024.jpeg 576w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5-169x300.jpeg 169w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5-768x1365.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5-864x1536.jpeg 864w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-5.jpeg 900w\" sizes=\"(max-width: 576px) 100vw, 576px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"576\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6-576x1024.jpeg\" alt=\"\" class=\"wp-image-18812\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6-576x1024.jpeg 576w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6-169x300.jpeg 169w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6-768x1365.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6-864x1536.jpeg 864w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-6.jpeg 900w\" sizes=\"(max-width: 576px) 100vw, 576px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"576\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1-576x1024.png\" alt=\"\" class=\"wp-image-18821\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1-576x1024.png 576w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1-169x300.png 169w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1-768x1365.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1-864x1536.png 864w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-Trip-1.png 900w\" sizes=\"(max-width: 576px) 100vw, 576px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"682\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8-682x1024.jpeg\" alt=\"\" class=\"wp-image-18817\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8-682x1024.jpeg 682w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8-200x300.jpeg 200w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8-768x1153.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8-1023x1536.jpeg 1023w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-8.jpeg 1066w\" sizes=\"(max-width: 682px) 100vw, 682px\" \/><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"576\" height=\"1024\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9-576x1024.jpeg\" alt=\"\" class=\"wp-image-18818\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9-576x1024.jpeg 576w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9-169x300.jpeg 169w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9-768x1365.jpeg 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9-864x1536.jpeg 864w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/China-9.jpeg 900w\" sizes=\"(max-width: 576px) 100vw, 576px\" \/><\/figure>\n<\/figure>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Written by Tewolde Hagos. We embarked on a thrilling journey from our cosmopolitan London to the distant lands of modern and ancient China, immersing ourselves in its vibrant local culture.  This learning adventure was about more than just gaining knowledge about China; it was a journey of harnessing and honing outdoor skills, trading and exploring [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59,86],"tags":[95,91],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18800"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18800"}],"version-history":[{"count":13,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18800\/revisions"}],"predecessor-version":[{"id":18839,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18800\/revisions\/18839"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18800"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18800"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18800"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}