{"id":18851,"date":"2024-04-26T08:23:37","date_gmt":"2024-04-26T08:23:37","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18851"},"modified":"2024-04-26T08:58:28","modified_gmt":"2024-04-26T08:58:28","slug":"language-acquisition-trip","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/language-acquisition-trip\/","title":{"rendered":"Language Acquisition Trip: Embracing The World As Our Classroom"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"229\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1146-x-256-px-1024x229.png\" alt=\"\" class=\"wp-image-18859\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1146-x-256-px-1024x229.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1146-x-256-px-300x67.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1146-x-256-px-768x172.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/04\/Copy-of-Copy-of-Halcyon-Customise-Headers-1146-x-256-px.png 1146w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><em>This article was originally published in <a href=\"https:\/\/issuu.com\/zestmedialondon\/docs\/abs_apr2024_digital_upload_pcl\" target=\"_blank\" rel=\"noreferrer noopener\">Absolutely Magazine<\/a> (April 2024)<\/em>.<\/p>\n\n\n\n<p>If you would like to know why Halcyon London International School offers an immersive Spanish language Acquisition trip to Cuenca, the answer is simple. It is the most enriching and comprehensive experience that we can present to our students to learn about global engagement, intercultural understanding, and multilingualism.<\/p>\n\n\n\n<p>The International Baccalaureate (IB), taught at Halcyon,&nbsp; provides a platform for international trips, offering a window into the features, processes and craft of language, and the concept of culture, strengthening our understanding of the diverse ways of interpreting the world.&nbsp;<\/p>\n\n\n\n<p>The peaceful, welcoming and quaint city of Cuenca is the perfect setting for our students to develop IB learner attributes that some of them did not know they already possess&nbsp; &#8211; starting with being open-minded: they&nbsp; stay with host families,embracing this new “lifestyle” with curiosity and respect.&nbsp;<\/p>\n\n\n\n<p>During the immersive trip, they appreciate and fully enjoy experiences such as churros for breakfast, discovering and using idioms with locals and having tapas at midday.<\/p>\n\n\n\n<p>They also participated in a wide range of workshops: flamenco, traditional folklore music, art and cooking &#8211; drawing out their creativity through authentic cultural encounters.<\/p>\n\n\n\n<p>Students expanded their knowledge of art,&nbsp; natural history and the environment when visiting the Museo Abstract and the Paleontological&nbsp; Museum.&nbsp; Without great enthusiasm, they connected with nature while canoeing in the river Jucar and glimpsing bears in the natural park and Biosphere Reserve,<a href=\"https:\/\/www.parqueelhosquillo.com\/\" target=\"_blank\" rel=\"noopener\"> El Hosquillo<\/a>.<\/p>\n\n\n\n<p>As the days passed by, through their cultural interactions, our students increasingly felt the beating heart of the city as their own. They became more aware of new perspectives, the importance of communication and how openness to collaboration leads to more profound cultural experiences.&nbsp;<\/p>\n\n\n\n<p>Having gained so much from Cuenca, students were keen to give back, addressing the core IB notion of Service Action. They visited&nbsp; ASPADEC, an organisation that successfully promotes the inclusion and professional development of the neurodiverse population in Cuenca. Our students showed their caring nature through gardening activities with the people that benefit from this organisation.<\/p>\n\n\n\n<p>At Halcyon, our commitment to language learning goes beyond the school building and into the classroom of the world. We hope that our students will always treasure their time “living” in Cuenca as, of course, international trips run deeper than feasting on delicious street food.&nbsp;<\/p>\n\n\n\n<p>Language acquisition offers many lifelong benefits. An increasing list of studies have noted that <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC6168212\/\" target=\"_blank\" rel=\"noopener\">healthy people who are bilingual have slower rates of mental decline in old age<\/a>, they are less easily distracted, and they tend to have a better understanding of people generally, not just via the language they speak.  <\/p>\n\n\n\n<p>Moreover, as noted by the International Baccalaureate Organisation, these trips enable students to communicate in a variety of modes, providing a linguistic and academic challenge for students in order to facilitate the best possible educational experience.&nbsp;<\/p>\n\n\n\n<p>Travel allows us all to see the world as it is: a beautiful array of cultures and customs. Whether traveling as a student, with work, or simply to unwind, there is always something to be gained by opening our hearts and minds to the places in which we are lucky to find ourselves.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This article was originally published in Absolutely Magazine (April 2024). If you would like to know why Halcyon London International School offers an immersive Spanish language Acquisition trip to Cuenca, the answer is simple. It is the most enriching and comprehensive experience that we can present to our students to learn about global engagement, intercultural [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59],"tags":[96,95,91],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18851"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18851"}],"version-history":[{"count":4,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18851\/revisions"}],"predecessor-version":[{"id":18860,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18851\/revisions\/18860"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18851"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18851"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18851"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}