{"id":18877,"date":"2024-05-02T10:38:08","date_gmt":"2024-05-02T10:38:08","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18877"},"modified":"2024-05-07T06:59:29","modified_gmt":"2024-05-07T06:59:29","slug":"community-spotlight-pilar-delgado","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/community-spotlight-pilar-delgado\/","title":{"rendered":"Community Spotlight: Pilar Delgado, IB DP &#038; MYP Spanish Teacher, on harnessing the freedoms of the IB"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Current-Staff_Pialr-Delgado_May-2024-1024x341.png\" alt=\"\" class=\"wp-image-18878\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Current-Staff_Pialr-Delgado_May-2024-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Current-Staff_Pialr-Delgado_May-2024-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Current-Staff_Pialr-Delgado_May-2024-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Current-Staff_Pialr-Delgado_May-2024.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>As an international school, many of our staff and students are multilingual, with a variety of languages often spoken and shared in the classroom. Language is treasured, both in our social world, but also in our view of academic success.&nbsp;<\/p>\n\n\n\n<p>Halcyon’s offered foreign languages are English, Spanish, Mandarin and French – but we also offer the Mother Tongue Programme – which means students can request to learn their native language, and we will find a teacher to deliver them.&nbsp;<\/p>\n\n\n\n<p>But, our foreign languages programme extends past learning words and phrases, it offers different perspectives and frames, and supports new relationships, which can last forever.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The importance of developing relationships in language teaching<\/h3>\n\n\n\n<p>Perhaps, there is no better model than our Spanish IB teacher, Pilar Delgado Suarez, who shares her love for language with both students and staff everyday.&nbsp;<\/p>\n\n\n\n<p>Pilar’s teaching style is naturally engaging, inspiring strong relationships with students. <\/p>\n\n\n\n<p>She says part of teaching is about having fun and having a strong link to the target culture and real world, regularly exchanging quips and jokes in Spanish as a way of connecting students with the language as local Spanish people do. <em>“I love idiomatic expressions; the kids are crazy about them.” <\/em>She laughs.<em> “For example, I often ask in Spanish: How are you feeling? Happy as a clam? Which translates as: feliz como una perdiz.”<\/em><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">A rigorous programme of language acquisition<\/h4>\n\n\n\n<p>But the programme is rigorous. MYP students usually start by learning the basics such as the alphabet, before moving onto tenses, learning about the Spanish environment, then advancing into debating global issues and current events in the Hispanic world.<\/p>\n\n\n\n<p><em>“At the end when they follow your guidance, they can’t believe they have achieved the ability to discuss things like immigration in a second language. It’s always special to see how students grow.”<\/em><\/p>\n\n\n\n<p>Pilar has over fifteen years of experience teaching, moderating, and examining the IB Programme. <em>“I always wanted to be a teacher and I love being an IB teacher; I love the freedom it offers. The opportunity of being at a new school, but having a solid understanding of the IB was really important. I really enjoy teaching outside the classroom, going to museums, galleries, and on trips to Spain.”<\/em><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">London as a classroom<\/h5>\n\n\n\n<p>Pilar designs her own educational environment, which extends beyond the classroom and into the city. <em>“Halcyon has so many opportunities for a teacher. Being a part of central London has opened my eyes to being a Spanish teacher. An educational opportunity could be in the form of a letter to the mayor, a walk around Portobello Road, a lecture in Kings’ College; there is so much learning to be had on our doorstep.”<\/em><\/p>\n\n\n\n<p>Pilar draws from a wide range of resources to make learning language feel <em>tangible<\/em> and <em>purposeful<\/em>, such as fulfilling a student&#8217;s wish to see a dance show or inviting a local artist to help with a visual arts project in Spanish.<\/p>\n\n\n\n<p>It’s these real-world examples that allow students to gain a deeper perspective of the language they are learning. Take Spanish Immersion Day last year, for example, where Pilar invited her students to be curators in a Spanish Art Exhibition, learn about the cultural conventions of Spanish artefacts, then later bond over Spanish cuisine, trying their hand at ordering meals in a restaurant setting.<\/p>\n\n\n\n<p><em>“It was a lovely time. It’s important to present their work outside of their classroom. Both the gallery and the restaurant we visited were really impressed by the students, and it was a meaningful way of practising our language in a real tangible context with a different type of audience”<\/em><\/p>\n\n\n\n<p>Pilar says her favourite part of teaching at Halcyon is the people. “<em>Halcyon has a real sense of community and a caring atmosphere to work in. Students and teachers have an opportunity to be vulnerable. It’s okay to say you are not okay, everyone is understanding of your situation.”<\/em><\/p>\n\n\n\n<p>In terms of her favourite spots in the city, Pilar enjoys visiting the Victoria and Albert Museum, swimming in the pool, drinking coffee and eating croquetas. <em>“I love going to exhibitions and shows. The Royal Opera House is my happy place.  I love taking kids to exhibitions and instilling this passion of mine in them. I love live music and street photography. I love everything about the arts.”<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an international school, many of our staff and students are multilingual, with a variety of languages often spoken and shared in the classroom. Language is treasured, both in our social world, but also in our view of academic success.&nbsp; Halcyon’s offered foreign languages are English, Spanish, Mandarin and French – but we also offer [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[58,86],"tags":[91,90,80],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18877"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18877"}],"version-history":[{"count":5,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18877\/revisions"}],"predecessor-version":[{"id":19097,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18877\/revisions\/19097"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18877"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18877"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18877"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}