{"id":18895,"date":"2024-05-10T13:01:41","date_gmt":"2024-05-10T13:01:41","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18895"},"modified":"2024-05-10T14:51:48","modified_gmt":"2024-05-10T14:51:48","slug":"community-spotlight-daniel-pokaz-class-of-2020","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/community-spotlight-daniel-pokaz-class-of-2020\/","title":{"rendered":"Community Spotlight: Daniel Pokaz, Class of 2020"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"341\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Alumni-Student_Daniel-Pokas_May-2024-2-1024x341.png\" alt=\"\" class=\"wp-image-18902\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Alumni-Student_Daniel-Pokas_May-2024-2-1024x341.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Alumni-Student_Daniel-Pokas_May-2024-2-300x100.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Alumni-Student_Daniel-Pokas_May-2024-2-768x256.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Community-Spotlight_Alumni-Student_Daniel-Pokas_May-2024-2.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><strong>Can you share some memorable experiences from your time at Halcyon?&nbsp;<\/strong><\/p>\n\n\n\n<p>The Model United Nations of the International School of the Hague (MUNISH) Conference was an amazing experience: we came together with a number of other schools from around the world and worked together to negotiate and deliver plausible solutions to the problems we face today.&nbsp; The trip itself was fun as we would work during the day and have some time off in the evenings to explore the city.&nbsp;<\/p>\n\n\n\n<p>Another aspect that I’m proud of is the work we did in the Student Council, where I was president.&nbsp; It was rewarding because we got to work with the school leadership team, with students, and with teachers to bring everybody together and create a joint force for the betterment of the school for students.<\/p>\n\n\n\n<p>I think just being at Halcyon overall, it was a great experience. When I joined Halcyon, I was quite a shy kid, and over the course of three years, through debates, Student Council and the school’s nurturing approach, I was transformed into a more confident individual.&nbsp;<\/p>\n\n\n\n<p><strong>What were you most proud of?<\/strong><\/p>\n\n\n\n<p>Becoming president of the Student Council was a really proud moment for me on a personal level. It was fun to campaign, and to seek out the problems that students faced, to understand and implement changes.&nbsp;<\/p>\n\n\n\n<p>I&#8217;m really really proud of how we managed to introduce a system where students interviewed potential staff interested in joining the school.&nbsp; I’m proud to see that this policy and process lives on today at Halcyon, where members of the student body have the opportunity to participate in the hiring process.&nbsp;<\/p>\n\n\n\n<p><strong>At university, what did you study and where?<\/strong><\/p>\n\n\n\n<p>I studied law at the London School of Economics (LSE) in London. I graduated in July 2023, and I&#8217;m currently completing a part time Master&#8217;s at King&#8217;s College, London in International Affairs whilst working on building my own company. .&nbsp;<\/p>\n\n\n\n<p><strong>How did your education at Halcyon contribute to your career journey?&nbsp;<\/strong><\/p>\n\n\n\n<p>For me, it was really all about the subjects I chose – that, along with having the support of teachers and a nurturing, small environment. In choosing my subjects, I made sure to pick ones that I knew would help me later on – I knew that I was going to pursue something in the social sciences, which led me to pick history, geography, English language and literature.&nbsp; These subjects along with the interactive approach at Halcyon, very good for discussions and debates. I specifically remember in our history classes where our teacher, Miss Cook, would organise debates, assigning teams that would need to&nbsp; defend one viewpoint or the other. These kinds of activities involved everybody, nobody was in the corner or not talking. Everybody was always involved in a fun way.&nbsp;<\/p>\n\n\n\n<p><strong>Which specific skills or knowledge gained during your time at Halcyon have been most valuable in your professional life?<\/strong><\/p>\n\n\n\n<p>Critical thinking is really a big one, especially in today&#8217;s world where it&#8217;s impossible to discern what the truth is, when you are being bombarded with information from all sides, from the media, from your friends, from social networks. In Grade 10, we had a really impactful conference on critical thinking and the media. During the two hour interactive lecture we were given insights and skills on how to unpack&nbsp; information, and how to assess the validity of sources. This was not only useful from an academic viewpoint, but it was also really impactful on a personal level, for life in general.&nbsp;<\/p>\n\n\n\n<p>In addition, I’d say Halcyon’s emphasis on public speaking activities and nurturing agency in students to voice opinions were all really key, transferable skills that have been valuable in my professional life.&nbsp;<\/p>\n\n\n\n<p><strong>If you could give one piece of advice to current students, what would it be?<\/strong><\/p>\n\n\n\n<p>I think the main thing would be to trust yourself and be confident because if you have no reason not to, you&#8217;re in a great school! You&#8217;re supported by all these teachers who believe in you and basically have all the necessary requirements to succeed.&nbsp; It&#8217;s really important to believe in yourself and the trust in yourself that you can succeed. That mental aspect transfers into everything that you do, from going into an exam to going to speak at a job interview, doing anything.<\/p>\n\n\n\n<p>There&#8217;s always merit to everything, so put 100% in everything that you do, believe in yourself and, and things will turn out absolutely fine.<\/p>\n\n\n\n<p><strong>What do you remember of the transition from Halcyon to university?<\/strong><\/p>\n\n\n\n<p>I think it was much easier coming from the IB programme to transition into university. In the Diploma Programme you&#8217;re working on some assignments that are almost at university level, for example, the extended essay, and not to mention balancing and juggling six different subjects, each with their own demands. I think these aspects really prepare you for the next step.&nbsp;<\/p>\n\n\n\n<p><strong>What are you doing now?<\/strong><\/p>\n\n\n\n<p>Together with my father, Igor Pokaz, we’ve started a management consulting company, Martes Consulting, which provides services in both public affairs and private investment. We work with project developers in sectors from tourism, tech, construction, and energy.&nbsp;<\/p>\n\n\n\n<p>I&#8217;m also a member of the Croatian Democratic Union youth wing, which is the party that is currently in power in Croatia. In this role, I support running party conferences, managing relationships between the young members and senior politicians, and helping with speech writing.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Can you share some memorable experiences from your time at Halcyon?&nbsp; The Model United Nations of the International School of the Hague (MUNISH) Conference was an amazing experience: we came together with a number of other schools from around the world and worked together to negotiate and deliver plausible solutions to the problems we face [&hellip;]<\/p>\n","protected":false},"author":15,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59,86],"tags":[91,90,80],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18895"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/15"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18895"}],"version-history":[{"count":3,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18895\/revisions"}],"predecessor-version":[{"id":18903,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18895\/revisions\/18903"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18895"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18895"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}