{"id":18891,"date":"2024-05-10T13:35:34","date_gmt":"2024-05-10T13:35:34","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18891"},"modified":"2024-07-08T13:26:44","modified_gmt":"2024-07-08T13:26:44","slug":"desire-to-learn-academic-success","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/desire-to-learn-academic-success\/","title":{"rendered":"Encouraging A Desire To Learn Is The Key To Academic Success"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"229\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Wellbeing-and-Uni-Destinations_Asil-Al-Shammari-1024x229.png\" alt=\"\" class=\"wp-image-18890\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Wellbeing-and-Uni-Destinations_Asil-Al-Shammari-1024x229.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Wellbeing-and-Uni-Destinations_Asil-Al-Shammari-300x67.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Wellbeing-and-Uni-Destinations_Asil-Al-Shammari-768x172.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Wellbeing-and-Uni-Destinations_Asil-Al-Shammari.png 1146w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>It’s no secret that nurturing wellbeing is a key driver for academic success. As our director, Barry Mansfield, carefully articulated in this article for <a href=\"https:\/\/www.independentschoolsmagazine.co.uk\/issues\/2024-february\/index.html#p=12\" target=\"_blank\" rel=\"noreferrer noopener\">Independent<\/a><a href=\"https:\/\/www.independentschoolsmagazine.co.uk\/issues\/2024-february\/index.html#p=12\" target=\"_blank\" rel=\"noopener\"> Schools Magazine<\/a>, wellbeing is a term that needs to be grounded in practicality. For Halcyon, we deliver this with coaching, wellbeing initiatives, community engagement, and guiding principles.&nbsp;<\/p>\n\n\n\n<p>These wellbeing initiatives aren’t an aside &#8211; they are penned into our delivery of the IB.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Wellbeing is a core determinant to university success<\/h3>\n\n\n\n<p>Students are equipped with essential emotional tools to understand themselves, express their thoughts and emotions, and overcome challenges with resilience. Our wellbeing programmes function as core determinants to university success and life beyond school.&nbsp;<\/p>\n\n\n\n<p>Although many IB schools provide basic mentorship programmes, our blend of restorative practices and one-to-one cognitive coaching sessions ensures we gain a full picture of our students based on qualitative evidence.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">PSHE, emotional intelligence and real-world applications<\/h4>\n\n\n\n<p>This information is gathered through our robust PSHE curriculum where all students study a unit on health and wellbeing for a semester. In this unit, they explore different topics related to physical, mental and emotional wellbeing, which further embed SEL skills like self-and-social awareness.&nbsp;<\/p>\n\n\n\n<p>As an example, students learn emotional intelligence, by recognising how emotions like ‘awe’ affect the physiology and psychology of the human body and mind. They learn about self-awareness and how to develop it, and study different mental health disorders, which broadens their emotional vocabulary and awareness.&nbsp;&nbsp;<\/p>\n\n\n\n<p>This pragmatism fuels a <em>desire to learn<\/em>. It empowers students to advocate for themselves and find their voice within our community. An example is our recent Interdisciplinary Unit (IDU) days, whereby students weave together subjects – such as maths and science – to unpack real world issues.&nbsp;<\/p>\n\n\n\n<p>For example, G6 students (11-12 years) studied zoo habitat design at London Zoo. They compiled data about animal behaviour –&nbsp;such as how much time they spend eating, walking, drinking or swimming in the wild –&nbsp;before suggesting improvements the zoo could make about the enclosures.<br><br>As a result, students were empowered to seek out relevant real-world learning opportunities that resonate with their interests, passions, and values, whether in higher education or future careers.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">Experiential Learning Opportunities<\/h5>\n\n\n\n<p>Furthermore, our school community offers rich experiential learning opportunities, where students can develop interpersonal skills and uncover latent talents. Encouraging autonomy, curiosity and advocacy, we inspire students to explore new avenues for themselves and their peers, driving exploration and broadening potential career paths.&nbsp;<\/p>\n\n\n\n<p>Students are able to engage in a variety of clubs through the Extra-Curricular Activity (ECA) program and create their own club to develop and share their interests.&nbsp;<\/p>\n\n\n\n<p>The student-led Debate Club, for example, is a locus of heated political discussion.&nbsp;<\/p>\n\n\n\n<p>Students from Grade 6-11 (11-17 years) become activists in their own right, researching and speaking on a variety of topical issues – such as artificial intelligence, immigration, sex-ed, or climate change –&nbsp; before putting their arguments to the test against teachers.<\/p>\n\n\n\n<p>By encouraging whole-class discussion surrounding political or school reform, classrooms become a battlefield of high-engagement and learning.<\/p>\n\n\n\n<h6 class=\"wp-block-heading\">Our Careers Programme<\/h6>\n\n\n\n<p>Another chapter is our careers programme. This spans from the Middle Years Programme (MYP, 11-16 years) through to the Diploma Programme (DP, 16-18 years), placing a strong emphasis on career exploration and preparedness. It begins in G9 (14-15 years), where students embark on a path of self-discovery through a careers interest assessment. This initial step sparks conversations about potential career avenues that align with their interests, as well as how students are engaging in these interests through their ECAs.<\/p>\n\n\n\n<p>Building upon this foundation, G10 students (15-16 years) engage in psychometric tests designed to evaluate their aptitude across various areas, such as abstract thinking, mechanical, spatial, numerical, and verbal skills. The insights gained from these assessments help students identify career fields and degree pathways that best match their unique skill set and learning style.<\/p>\n\n\n\n<p>The results obtained in G9 and G10 serve as catalysts for meaningful discussions around DP subject selections, extracurricular pursuits, and opportunities for super curricular engagement. By aligning their academic pursuits with their newfound interests and strengths, students are empowered to shape their school profile in a way that resonates with their future aspirations.<\/p>\n\n\n\n<p>Our work experience programme and annual careers day further enrich this journey, providing students with firsthand exposure to diverse career options and pathways. As they progress into the DP, students are equipped with the confidence and clarity needed to make informed decisions regarding their higher education and career choices.<\/p>\n\n\n\n<p>At every stage of their academic journey, our goal is to inspire and empower students to explore, discover, and pursue fulfilling career paths that resonate with their passions and potential. Although young, we have succeeded in connecting students with their passions, noted by our close, sustained relationship with alumni, and the <a href=\"https:\/\/halcyonschool.com\/graduate-destinations\/\">breadth of <\/a><a href=\"https:\/\/halcyonschool.com\/graduate-destinations\/\" target=\"_blank\" rel=\"noreferrer noopener\">universities<\/a><a href=\"https:\/\/halcyonschool.com\/graduate-destinations\/\"> and subjects our students have successfully fulfilled<\/a>.&nbsp;<\/p>\n\n\n\n<p>Read more about our <a href=\"https:\/\/halcyonschool.com\/graduate-destinations\/\" target=\"_blank\" rel=\"noreferrer noopener\">leavers&#8217; destinations<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s no secret that nurturing wellbeing is a key driver for academic success. As our director, Barry Mansfield, carefully articulated in this article for Independent Schools Magazine, wellbeing is a term that needs to be grounded in practicality. For Halcyon, we deliver this with coaching, wellbeing initiatives, community engagement, and guiding principles.&nbsp; These wellbeing initiatives [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59,18,57,86],"tags":[98,97,91],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18891"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18891"}],"version-history":[{"count":4,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18891\/revisions"}],"predecessor-version":[{"id":19053,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18891\/revisions\/19053"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}