{"id":18914,"date":"2024-05-17T07:45:04","date_gmt":"2024-05-17T07:45:04","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18914"},"modified":"2024-05-17T09:34:56","modified_gmt":"2024-05-17T09:34:56","slug":"halcyon-in-the-news-faye-ellis-digital-learning-coach-edtech","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/halcyon-in-the-news-faye-ellis-digital-learning-coach-edtech\/","title":{"rendered":"Halcyon in the News: Faye Ellis, Digital Learning Coach"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"229\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Halcyon-in-the-News_Faye-Ellis-1024x229.png\" alt=\"\" class=\"wp-image-18916\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Halcyon-in-the-News_Faye-Ellis-1024x229.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Halcyon-in-the-News_Faye-Ellis-300x67.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Halcyon-in-the-News_Faye-Ellis-768x172.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Halcyon-in-the-News_Faye-Ellis.png 1146w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Faye Ellis, recently featured in our Community Spotlight series, is Halcyon’s tech sage; she is a digital explorations teacher, digital coach for teachers and students, and when she is not in Halcyon, she speaks at global tech events inspiring organisations, students and entrepreneurs. She has now written for the UK&#8217;s leading Educational Publication, the Times Educational Supplement (TES). Read the full article, originally published on <a href=\"https:\/\/www.tes.com\/magazine\/analysis\/general\/digital-coaching-help-teachers-benefit-edtech-learning-artificial-intelligence\" target=\"_blank\" rel=\"noreferrer noopener\">TES<\/a> &#8211; or continue reading below.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Digital coaching: helping teachers make the most of edtech<\/h2>\n\n\n\n<p>Edtech is an established part of the education system these days &#8211; although the&nbsp;<a href=\"https:\/\/www.tes.com\/magazine\/analysis\/general\/digital-strategy-and-device-guidance-what-schools-need-know\" target=\"_blank\" rel=\"noopener\">speed of change within technology<\/a>, as witnessed by the rise of&nbsp;<a href=\"https:\/\/www.tes.com\/magazine\/news\/general\/majority-teachers-need-ai-training-boost-confidence\" target=\"_blank\" rel=\"noopener\">artificial intelligence (AI)<\/a>, means it is an area where educators cannot stand still.<\/p>\n\n\n\n<p>Of course, though, the time required to understand and assess new tools is huge &#8211; and often just not feasible for most classroom teachers.<\/p>\n\n\n\n<p>While many schools may employ a head of digital learning or a trust may have a chief technology officer, such roles are often focused heavily on the administration of technology: managing devices, logins and contracts.<\/p>\n\n\n\n<p>I have had such roles in previous schools and, while I loved them, it was challenging to find time to uncover new tools and share these with teachers and pupils.<\/p>\n\n\n\n<p>However, now I work as a digital coach for Halcyon International School &#8211; a role dedicated to supporting pupils and staff to uncover and use new digital tools within their classroom practice. But what does this actually look like in reality?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Sharing ideas and innovation<\/strong><\/h3>\n\n\n\n<p>A huge part of the role is about uncovering and trialling new technologies with teachers to see if they can enhance their lessons.<\/p>\n\n\n\n<p>To do this, I spend a lot of time on social media to see what new tools are being discussed, liaising with networks of educators through the Apple and Google communities, attending conferences, watching product demos and networking with others in this space to see what they are using.<\/p>\n\n\n\n<p>With this information, I then regularly attend subject meetings at my school to collaborate on project planning and show and train individual and small groups of staff on any new tools I have uncovered.<\/p>\n\n\n\n<p>As an example of this in action,&nbsp;I am currently working with a history teacher to develop a costume design mini-unit based on 1920s fashion and its relationship to societal and political change.<\/p>\n\n\n\n<p>Within this, we’ll be bringing in a fashion historian and using AI image creators to design costumes.&nbsp;I’m particularly interested in AI’s potential role in the creative process, so I have been recommending tools such as Canva, which is free for schools and has amazing AI tools built in.<\/p>\n\n\n\n<p>I’ve also worked with a teacher to trial chatbots with students of Year 7 age to help them to co-create choose-your-own-adventure stories. The students then reflected on whether AI can be useful in creative work and where a human’s input is more valuable.<\/p>\n\n\n\n<p>In another example, I worked with teachers from English, design, and individuals and societies on an interdisciplinary unit based at the Tower of London.<\/p>\n\n\n\n<p>Students spent a day capturing film footage and researching on-site at the Tower and used the CoSpaces Edu iPad app to recreate a prison cell where a famous prisoner was kept.<\/p>\n\n\n\n<p>With the addition of a voice-recorded letter from the prisoner and videos of moments from the person’s life, students created incredible 3D immersive experiences.<\/p>\n\n\n\n<p>As well as these class-based projects, my role also enables me to work directly with students to help them use technologies that may suit a project they are working on.<\/p>\n\n\n\n<p>As a recent example, I took ideas learned from using virtual reality tools to help a grade 12 student develop a virtual reality gallery for artwork she has produced for a visual arts exhibition.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Ongoing digital coaching<\/strong><\/h4>\n\n\n\n<p>Research shows that ongoing coaching can be extremely effective when compared to one-off training sessions, so the potential impact of having a digital coach is huge.<\/p>\n\n\n\n<p>Of course, with tight school budgets, it may not be easy for schools to employ someone full or even part time with that sole responsibility, but there are alternatives.<\/p>\n\n\n\n<p>My role is part time while I am studying for a Master of Business Administration, but it could also be a role given to a teacher as an additional teaching and learning responsibility. If schools are part of larger groups or trusts, they could work across a number of schools to implement digital coaching methods.<\/p>\n\n\n\n<p>Training teachers in coaching and setting up small coaching groups is another potential option. Teachers would identify a problem or challenge they want to address in their classroom, then research and identify digital tools that might help.<\/p>\n\n\n\n<p>They could then coach each other as they test and trial the tools, potentially supporting each other in the classroom. It’s not about one person having all the answers but working together to identify and test solutions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Faye Ellis, recently featured in our Community Spotlight series, is Halcyon’s tech sage; she is a digital explorations teacher, digital coach for teachers and students, and when she is not in Halcyon, she speaks at global tech events inspiring organisations, students and entrepreneurs. She has now written for the UK&#8217;s leading Educational Publication, the Times [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59,58],"tags":[102,101,91,82,81],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18914"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18914"}],"version-history":[{"count":3,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18914\/revisions"}],"predecessor-version":[{"id":18920,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18914\/revisions\/18920"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18914"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18914"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18914"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}