{"id":18951,"date":"2024-05-31T14:44:10","date_gmt":"2024-05-31T14:44:10","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=18951"},"modified":"2024-05-31T16:12:45","modified_gmt":"2024-05-31T16:12:45","slug":"language-and-literacy-lindsey-fairweather","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/language-and-literacy-lindsey-fairweather\/","title":{"rendered":"Growing Language and Literacy with Lindsey Fairweather"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"229\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Published-Author_Lindsey-Fairweather_May-24-1024x229.png\" alt=\"\" class=\"wp-image-18953\" srcset=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Published-Author_Lindsey-Fairweather_May-24-1024x229.png 1024w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Published-Author_Lindsey-Fairweather_May-24-300x67.png 300w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Published-Author_Lindsey-Fairweather_May-24-768x172.png 768w, https:\/\/halcyonschool.com\/wp-content\/uploads\/2024\/05\/Blog-Web-Banner_Published-Author_Lindsey-Fairweather_May-24.png 1146w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>A key function of our role as an international school is providing students, who arrive from all corners of the world, the opportunity to learn English. We embrace multilingualism with sensitivity, ensuring students can grow and maintain new languages while continuing to celebrate their origins.&nbsp;<\/p>\n\n\n\n<p>A key fabric in the tapestry of our languages programme is English Plus (EAL &#8211; English as an Additional Language), which traces back to the arrival of IB English teacher Lindsey Fairweather at Halcyon in 2020. Since then, English Plus has continually adapted and evolved to meet the needs of both our students and the curriculum, delivered in coordination with fellow Halcyon English Plus teacher, Rahana Ahmed, who also serves as a bridge for students progressing into English B (Grades 10-12).<\/p>\n\n\n\n<p>The success of the programme is marked not only by the growing list of graduates speaking fluent English and stepping into academic careers but also by the close-knit community it has fostered. The programme is woven into subjects like science and maths, whereby all teachers contribute to the health of our multilingual learners.<\/p>\n\n\n\n<p>Recently, Ms Fairweather travelled to Rome to attend the <a href=\"https:\/\/wida.wisc.edu\/about\/consortium?utm_campaign=Halcyon%20Happenings&amp;utm_source=hs_email&amp;utm_medium=email&amp;utm_content=82723728&amp;_hsenc=p2ANqtz-8E5xnCleVsLBgQ6JLo8rDpBlvlzpfZ5M4MWZfHPFabO0791PYR53zqXI0mxqyswLU56nMHltbdfqFDbyw_WqJTCdmp_g&amp;_hsmi=82723728\" target=\"_blank\" rel=\"noreferrer noopener\">WIDA<\/a> (World Class Instructional Design and Assessment) conference, ‘Stretching Your Co-Teaching: Collaborating with WIDA’, where she explored innovative approaches to co-teaching language and literacy education at Halcyon. This experience led to a collaboration with esteemed educational presenter and author Andrea Honigsfeld, culminating in a feature in the new book, <a href=\"https:\/\/www.heinemann.com\/products\/e17081.aspx\" target=\"_blank\" rel=\"noreferrer noopener\">Growing Language &amp; Literacy Strategies for Secondary Multilingual Learners<\/a>.&nbsp;<\/p>\n\n\n\n<p>We are thrilled to share an excerpt from the book, featuring the work of previous Halcyon student, who was tasked with developing one of the components of language use &#8211; writing &#8211; threaded into the subject matter of science.  <\/p>\n\n\n\n<p><strong>The task:<\/strong> Imagine you wake up and have been shrunk! Suddenly, you find yourself stuck inside a cell. Choose whether it’s a plant cell or an animal cell, and describe what you see and feel. Words you could use: nucleus, cell wall, cell membrane, cytoplasm, DNA, chloroplast, mitochondria.<\/p>\n\n\n\n<p><strong>Feature:<\/strong><\/p>\n\n\n\n<p><em>Today I’m telling you about the day I got stuck inside a cell. I was relaxing on my couch when suddenly… I shrank. I shrank A LOT. I couldn’t see anything at first, but then I looked up and saw a brown-looking thing. I continued moving forward without needing to walk, as a jelly-like substance helped me float through the place. I was getting more and more confused about where I actually was. I saw a bunch of red things and didn’t know what they were, then I realized. Jelly-like substance? Shrinking? Brown-looking thing? Red things…?<\/em><\/p>\n\n\n\n<p><em>I was inside a cell. I knew I was. I was still confused about how that happened, but there was no time for questions. I had to get out as quickly as possible. So, I started “swimming” through the cytoplasm. I swam and swam until I finally saw the cell membrane! But… something wasn’t right. There was something behind the cell membrane—a thick yellow thing. Oh no. Was I trapped inside a plant cell?<\/em><\/p>\n\n\n\n<p><em>I needed to escape quickly, but I knew the cell wall would block my path. To confirm my doubts, I looked down and saw green things floating along with the red ones. Yes, I was inside a plant cell. I decided to plan an escape but didn’t know what to do. If I tried to escape through the cell membrane, I would be stopped by the cell wall. So, I started to think about where I really was. A cell membrane has mitochondria and chloroplasts floating around, a nucleus on the top left side, and… one large vacuole. Okay, so I finally knew I was probably stuck inside the vacuole and had to find a way out. Wait… I know how to get out!<\/em><\/p>\n\n\n\n<p><em>Then I remembered I had my scissors in my pocket when I was sleeping, and they probably shrank too! I searched my pocket, and there they were, my scissors. I knew what to do. I started cutting through the vacuole to see if I could get out, and I managed it. But now, I was in the path of the chloroplasts and mitochondria. I didn’t know what would happen if I got hit by either, but I wasn’t going to stick around to find out. So, I quickly swam to the edge and out of their way. Then, I attempted to cut through the cell membrane and cell wall, and guess what? I did it!<\/em><\/p>\n\n\n\n<p><em>Suddenly, I woke up, sweat all over my face and hyperventilating. Then I realized it was all a bad dream. I was so relieved but also a bit shaken. I just went back to sleep, hoping I wouldn’t return to that dream. It was all just a dream.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A key function of our role as an international school is providing students, who arrive from all corners of the world, the opportunity to learn English. We embrace multilingualism with sensitivity, ensuring students can grow and maintain new languages while continuing to celebrate their origins.&nbsp; A key fabric in the tapestry of our languages programme [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[59,86],"tags":[111,110,109,91],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18951"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=18951"}],"version-history":[{"count":3,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18951\/revisions"}],"predecessor-version":[{"id":18957,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/18951\/revisions\/18957"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=18951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=18951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=18951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}