{"id":7191,"date":"2020-12-21T09:00:00","date_gmt":"2020-12-21T09:00:00","guid":{"rendered":"https:\/\/halcyonschool.com\/halcyon-launches-english-plus-programme-and-joins-wida\/"},"modified":"2021-08-16T09:08:26","modified_gmt":"2021-08-16T09:08:26","slug":"halcyon-launches-eal","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/halcyon-launches-eal\/","title":{"rendered":"Halcyon launches English Plus (EAL) programme and joins WIDA"},"content":{"rendered":"<p>This academic year, Halcyon London International School saw the launch of our new English Plus (EAL &#8211; English as an Additional Language) Programme, which allows Admissions to consider students who have a working proficiency of the English Language but may still require up to 18 months of language support. The mission of this programme is to ensure that our English language learners are well-equipped to flourish in our learning environments. The programme is not built around a pre-made and rigid curriculum, but tailor-made to fit students’ individual needs to allow them to fully engage with life at Halcyon.&nbsp;<\/p>\n<p><!--more--><\/p>\n<p>The success of the programme is rooted in a strong partnership between Halcyon’s English Plus Teacher, Lindsey Fairweather and our Admissions team. This partnership has been strengthened by our joining a prestigious list of international schools that implement <a href=\"https:\/\/hs.halcyonschool.com\/e2t\/c\/*W6s0y278m-tx5W7j3-Dj95jy9Q0\/*W50v0S54KCZyKW4KKTX-1X5SgK0\/5\/f18dQhb0SbTP8YHr4dN8JdG6RHyjJqVQZxwR7gs0_MW3hHhcV2P7_nXVcnTGj9927_BW51g01G7dfvlyW1x9t-56bVsl_N2yGLv9cp71VW96dL8S2xrlPtW6PXLp36PVKcrW6N3nBL8xGZKKW50MWKX96dHLxMd3_hBc9gpQW4sypS019jysJW625bx16Gj8TSW6bVy-525hvkWVHZ5KN2ndzkHW4MVYTV2KFZxKN3Z7hzrMNBCZVMMQxX80gSRfW97rB1b8xr3c-W39r-B_60Dq4ZW23Nh9j4sH67NVMVZG28n_4GPVPJSx598t4NsW2DmGHM6Lk_D7N10s8LCdmBVcVZ-sfs4n-MQ4VM6MTZ9bgkBxW8pMZfP5qj67lVPVb5K36Vbw5VTkz9F67g9hqW66x81-7wTZy2W90LR123ygvH8N8c3fNYGVtrmW2PxY1b8cqS1xW22Ynlm2jT2zfW2j-Sgt2L5GhqW3GhG7N55d-PyW7NKcQZ8cX4dQW6JyTx-1Z4-30W98gKWL9lZbDbN3QzSg8QN_TjW781fwQ37JpNz0\">WIDA <\/a>(World Class Instructional Design and Assessment). WIDA is used to enhance the learning of non-native English speakers through the teaching of specialist vocabulary, as well as through testing and monitoring progress &#8211; and this is where Admissions starts.<\/p>\n<p>Our Admissions team will employ the WIDA Screener testing as the basis for assessing an applicant’s English language ability, which supports the team in finding the right students for Halcyon and the programme. Lindsey will continue to use a wide range of assessments, educator assistance, professional learning, teaching standards that the WIDA consortium provides, and drawing on her own extensive experience, to best support students: to track their progress, identify gaps in their English knowledge, and draw out their unique potential.&nbsp;<\/p>\n<p><\/p>\n<h2>Supporting curriculum-wide EAL attainment with WIDA resources<\/h2>\n<p><\/p>\n<p>Our English Plus\/EAL Teacher will incorporate WIDA’s insights and assessment guidance into her extensive toolbox of resources for the programme’s personalised support. This adds to Lindsey’s adaptation of other resources &#8211; such as digital tools like <a href=\"https:\/\/membean.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Membean<\/a> and <a href=\"https:\/\/www.noredink.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">NoRedInk<\/a> &#8211; which help students build personalised word lists and build grammar tests around their own interests like Harry Potter.<\/p>\n<p>English Plus at Halcyon uses students’ own passions, thoughts and feelings as a catalyst for motivated English language learning and self-driven engagement in the class. In her classroom, Lindsey integrates learning tasks with students’ other subjects: finding out what technical vocabulary they might need for their IB Personal Projects, for example.<\/p>\n<p>Being part of the WIDA consortium also allows Halcyon to measure the effect of EAL learning exercises with close precision: the institution provides access to a wide range of assessments, educator assistance resources, professional learning programmes in addition to teaching standards. As our learning environment has shifted to a digital platform, the availability of further resources to assess students’ progress could not be more crucial.&nbsp;<\/p>\n<h3><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/undraw_group_hangout_5gmq-png.png\" alt=\"eal learning\" width=\"1272\" height=\"869\"><\/h3>\n<h2>Remote Learning: an opportunity to flourish<\/h2>\n<p>Using the remote learning environment has given our English Plus\/EAL students a platform to flourish. The very nature of distance learning has facilitated a stronger emphasis on verbal communication, which has given students greater confidence in taking part in digital presentation activities. Throughout the period, each student has undertaken the challenge of creating a narrated video presentation about their journey to Halcyon &#8211; a task that incorporates speaking, writing and comprehension skills that can be assessed closely with the use of WIDA resources.<\/p>\n<p>English Plus is more than just giving students a helping hand; it is enabling and empowering them. The outreach and support that Lindsey provides &#8211; encouraging students to ask for help between lesson times, delivering personalised feedback and building a community of motivated learners &#8211; makes Lindsey an extra mentor figure for some, and central to their wellbeing. Letting students know that their individual needs are valued and that Halcyon is excited to receive them is intrinsic to their learning journey.&nbsp;<\/p>\n<p><\/p>\n<p>Featured in the <a href=\"https:\/\/www.openapply.com\/bulletin\/sep-2020#p40\" target=\"_blank\" rel=\"noopener noreferrer\">International Admissions Bulletin<\/a> by <a href=\"https:\/\/www.openapply.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Open Apply<\/a>.&nbsp;<\/p>\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong> \n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>This academic year, Halcyon London International School saw the launch of our new English Plus (EAL &#8211; English as an Additional Language) Programme, which allows Admissions to consider students who have a working proficiency of the English Language but may still require up to 18 months of language support. The mission of this programme is [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7247,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7191"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7191"}],"version-history":[{"count":7,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7191\/revisions"}],"predecessor-version":[{"id":8002,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7191\/revisions\/8002"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7247"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}