{"id":7192,"date":"2020-12-03T16:15:00","date_gmt":"2020-12-03T16:15:00","guid":{"rendered":"https:\/\/halcyonschool.com\/ib-service-as-action-how-students-raised-350-for-peruvian-families\/"},"modified":"2021-08-16T09:09:59","modified_gmt":"2021-08-16T09:09:59","slug":"ib-service-as-action","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/ib-service-as-action\/","title":{"rendered":"IB Service as Action: How Students Raised £350 for Peruvian Families"},"content":{"rendered":"<p>At the start of the academic year, Grade 8 embraced a challenging <a href=\"https:\/\/halcyonschool.com\/curriculum\/#myp\">Service as Action<\/a> project: making a real difference to the lives of families in Peru, who have been impacted by unemployment, uncertainty, and instability in wake of the global pandemic and local political conflict. Together, the group took on the responsibility of raising enough money to feed 5 families for two months &#8211; and we are pleased to share that, at a total of £346.35, the students achieved over double their target.<\/p>\n<p><!--more--><\/p>\n<h2>Learning to lead: Budgeting, planning, and fundraising<\/h2>\n<p>From the beginning of this process, students took full responsibility for the organisation and outcome of their fundraising tasks: organising budgets, liaising with our facilities team, and promoting their events to the school community. In our interview with Grade 8, students reflected thoughtfully on what it meant to take ownership of this project.<\/p>\n<p>“We essentially organised a small business,” shared Vasily. Vasily’s team &#8211; joined by Leo, Samara and Victoria &#8211; organised a sale of treats at Halcyon’s annual Halloween Catwalk. This activity required the students to procure bags, sweets (sold for £1 each), and a system of sending and receiving letters to students (an extra service for which the team charged their customers £0.50). In order to maintain a watchful eye of their budget and ensure they made a profit to send to the families, the students had to “be efficient” with their costs, which led the students to “raise £40 &#8211; enough to feed a family for two months,” smiled Leo.<\/p>\n<p>Having the responsibility of making a difference drove these students to develop their project-management skills to a new level. Halcyon’s Service as Action Coordinator, <a href=\"https:\/\/halcyonschool.com\/subjects\" rel=\"noopener\">PHE<\/a> Teacher Celeste Gardner, organised a virtual visit from John Vincent, an expert in Peruvian politics. With a reinforced understanding of the local situation, students were energised to do their very best; John Vincent and Ms Gardner ensured that the class had a continued stream of communication with the Peruvian families from the very beginning of the project.<\/p>\n<p><img style=\"width: 996px; display: block; margin-left: auto; margin-right: auto;\" src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Screenshot%20(79).png\" alt=\"Screenshot (79)\" width=\"996\" \/><\/p>\n<h2>Becoming caring communicators: developing IB Learner Profile skills<\/h2>\n<p>Service as Action is at the core of the <a href=\"https:\/\/halcyonschool.com\/currciculum\" rel=\"noopener\">International Baccalaureate<\/a> Middle Years Programme framework &#8211; students can develop a range of skills and attributes that prepare them for continued action and project-management in the future.<\/p>\n<p>In our conversations with students, it was evident that Grade 8 recognised the importance of continued connection, awareness and communication beyond the initial fundraising activities. From the beginning, students quickly realised that they had to understand the needs of their audience in order for their donors to establish strong connections with the cause of the Peruvian families.<\/p>\n<p>“We learned that we had to be flexible with the events that we organised,” explained Arthur. “At first, we tried to organise a pumpkin carving competition, but this wasn’t raising much interest, so we changed this to an online PayPal fundraiser &#8211; it seemed that people didn’t have much time to engage in a special event.” The students also thought harder about the channels of communication that they could utilise each more donors, and connected with the school Communications Team to advertise the PayPal link in the school newsletter.<\/p>\n<p>The students learned that they needed to form a connection with their audience: something that they will bear in mind as they continue to take action and make a difference in the future. Nima explained to us that his team planned to follow up each donation with a personalised email of thanks; similarly, Felix’s team designed a formal letter of gratitude to establish a deeper level of association with those who donated (pictured, above).<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" style=\"width: 932px; display: block; margin-left: auto; margin-right: auto;\" src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/perufamilies.jpg\" alt=\"service as action\" width=\"932\" height=\"375\" \/><\/p>\n<h2> <\/h2>\n<h2>Creating a better world through service<\/h2>\n<p>We asked Grade 8 a challenging question to wrap up our interview: “What was the most important skill that you learned?” Vasily said that, above all, he had “learned to understand others’ situations”: a response that his teammates echoed.<\/p>\n<p>As an <a href=\"https:\/\/www.eliteib.co.uk\/school-profiles-internal.php?s=Halcyon%20London%20International%20School&amp;Region=GB\" target=\"_blank\" rel=\"noopener\">International Baccalaureate school<\/a>, Halcyon “aims to develop inquiring, knowledgeable and caring young people who help to create a better and more peaceful world” through the <a href=\"http:\/\/ibo.org\" target=\"_blank\" rel=\"noopener\">IB framework<\/a>. Grade 8 have shown that they are well on their way to making a significant difference.<\/p>\n\n\n<strong>Subscribe to hear more news on our curriculum, facilities, team and more:<strong> \n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>At the start of the academic year, Grade 8 embraced a challenging Service as Action project: making a real difference to the lives of families in Peru, who have been impacted by unemployment, uncertainty, and instability in wake of the global pandemic and local political conflict. Together, the group took on the responsibility of raising [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7248,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7192"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7192"}],"version-history":[{"count":6,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7192\/revisions"}],"predecessor-version":[{"id":7940,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7192\/revisions\/7940"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7248"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7192"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7192"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7192"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}