{"id":7193,"date":"2020-11-27T14:30:00","date_gmt":"2020-11-27T14:30:00","guid":{"rendered":"https:\/\/halcyonschool.com\/profile-of-an-aspiring-archaeologist-explorations-at-halcyon\/"},"modified":"2021-08-16T09:10:47","modified_gmt":"2021-08-16T09:10:47","slug":"archaeology","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/archaeology\/","title":{"rendered":"Profile of an Aspiring Archaeologist: Explorations at Halcyon"},"content":{"rendered":"<p>During one Wednesday Exploration session, Halcyon welcomed some interesting guests: prehistoric arrowheads, clay tobacco pipes, and medieval hammered coins. These curious artefacts are part of a student’s personal collection &#8211; brought in by Gabriel, Grade 9, our own aspiring archaeologist.<\/p>\n<p><!--more--><\/p>\n<p>Joining us for a chat about the development of his collection and his growth as a young excavator, Gabriel explains that he brought these objects in for his fellow Archaeology Exploration students to examine and research. These artefacts were curated from “going mudlarking on the River Thames when the tide is low” &#8211; an activity which the Grade 6-10 Archaeology students have also had the opportunity to do during weekly two-hour sessions on Wednesday.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Copy%20of%20IMG_2741.jpg\" alt=\"Copy of IMG_2741\" width=\"4032\" style=\"width: 4032px;\"><\/p>\n<h2>Sparking the passion for archaeology<\/h2>\n<p>&nbsp;<\/p>\n<p>“I started archaeology at quite a young age &#8211; making trips to the Thames to pick objects up from the foreshore at low tide.” Gabriel reminisces. “As I carried on mudlarking, I was able to find out more about the past through researching objects, which made archaeology a really insightful hobby for me. Sometimes I start mudlarking at five-thirty in the morning!” he smiled.<\/p>\n<p>We ask Gabriel if he has his sights on a career in archaeology.&nbsp;<\/p>\n<p>“I definitely want to continue doing this in the future,” he confirms. “Archaeology is a lot of fun &#8211; and very underrated!”&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Copy%20of%20IMG_9776.jpg\" alt=\"Copy of IMG_9776\" width=\"4032\" style=\"width: 4032px;\"><\/p>\n<h2>Telling a story through silver<\/h2>\n<p>&nbsp;<\/p>\n<p>As Gabriel tells us about the excitement of opening a window into history, we find ourselves wondering about his most memorable discoveries.<\/p>\n<p>“The best objects that I’ve found are the ones which really tell a story &#8211; for example, a jar of vaseline from the brand ‘Cheese Borough and Co.’ from the 19th Century, at an old port. I started researching, and found out that this is an American product.” Given the age and location of the product, Gabriel inferred that the artefact was most likely taken to the UK “by soldiers in the American Civil War, who would have travelled here by sea.”<\/p>\n<p>Gabriel is keen to share that such finds are a regular occurrence in mudlarking. “Last Monday, I found a hammered silver coin from 1351! Every artefact has its own personal and fascinating story… so it’s quite hard to come up with one object I would define as the ‘most interesting’.”&nbsp;<\/p>\n<p>As Gabriel animatedly lists an array of further examples that include food containers, bronze objects and Roman pottery, it becomes clear that he has made lifelong memories through this hobby. This is something that our students have the opportunity to do in our Explorations programme: <a href=\"https:\/\/halcyonschool.com\/explorations\">the four nine-week courses that each Grade 6-10<\/a> student selects per year helps each individual develop passions in sport, technology, history, art, and more.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Copy%20of%20IMG_7199.jpg\" alt=\"Copy of IMG_7199\" width=\"4032\" style=\"width: 4032px;\"><\/p>\n<p>&nbsp;<\/p>\n<h2>Making memories: discovering history as a team<\/h2>\n<p>Gabriel’s keen interest in discovering artefacts started before his time at Halcyon &#8211; but for many of our students, these Exploration sessions are their first ventures into archaeology. We ask what it’s like to share his knowledge with beginners &#8211; and Gabriel explains that he is enjoying unique learning opportunities through working within a mixed-age group.<\/p>\n<p>“There’s always more to learn, and working with other students means we can explore more areas. One week, we shared a session with the Lab Science Exploration students and did some metal detection work at Hyde Park. We found a lot of old bottle tops, and a 1p coin from 1903 &#8211; produced during the reign of Edward VII!”&nbsp;<\/p>\n<p>He adds thoughtfully that working with students of different ages and levels is a valuable learning opportunity: that it is “interesting and fun to help others develop their knowledge.”<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Copy%20of%20IMG_7266.jpg\" alt=\"Copy of IMG_7266\" width=\"4032\" style=\"width: 4032px;\"><\/p>\n<p>&nbsp;<\/p>\n<h2>Becoming an avid researcher<\/h2>\n<p>&nbsp;<\/p>\n<p>We ask Gabriel about the transferable skills of his hobby. He explains that his ability to pinpoint the production year of a bronze coin supports his school studies in a surprising variety of ways.&nbsp;<\/p>\n<p>“First of all, I’ve learned to use online resources like YouTube more effectively &#8211; when I find something new, this is how I learn more about its background,” he reflects, considering how these investigation skills might help him in tasks such as the MYP Personal Project. “And gaining a broad overview of different eras in the past is really useful in lots of classes, like history and English &#8211; I can often relate what we’re learning to what I already know.”<\/p>\n<p>Through mudlarking trips and visits to the Imperial War Museum, these students have gained unique perspectives on the richness of past lives in London. We’re excited to see what else our students will explore through our <a href=\"https:\/\/halcyonschool.com\/explorations\">Explorations Programme<\/a> &#8211; and we look forward to sharing more insights into life at Halcyon with you soon!<\/p>\n<p>&nbsp;<\/p>\n<p><strong><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>During one Wednesday Exploration session, Halcyon welcomed some interesting guests: prehistoric arrowheads, clay tobacco pipes, and medieval hammered coins. These curious artefacts are part of a student’s personal collection &#8211; brought in by Gabriel, Grade 9, our own aspiring archaeologist.<\/p>\n","protected":false},"author":5,"featured_media":7249,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7193"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7193"}],"version-history":[{"count":7,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7193\/revisions"}],"predecessor-version":[{"id":7880,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7193\/revisions\/7880"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7249"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7193"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7193"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7193"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}