{"id":7195,"date":"2020-11-04T14:50:00","date_gmt":"2020-11-04T14:50:00","guid":{"rendered":"https:\/\/halcyonschool.com\/supporting-new-students-navigating-change-academic-challenge\/"},"modified":"2021-08-16T09:11:06","modified_gmt":"2021-08-16T09:11:06","slug":"supporting-new-students-navigating-change-academic-challenge","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/supporting-new-students-navigating-change-academic-challenge\/","title":{"rendered":"Supporting New Students: Navigating Change &#038; Academic Challenge"},"content":{"rendered":"<p>Joining a new school is an important moment for both students and parents. While parents are always excited to wave goodbye to their child as they step onto their new school campus, they may wonder about how their child is faring in this new adventure.<\/p>\n<p><!--more-->We value the beginning of our students’ journeys at Halcyon: a unique opportunity for each learner to find their voice, become an engaged inquirer in the classroom, and make friends who will impact their life in a multitude of ways. Our mission &#8211; to ‘draw out the unique potential of each student’ &#8211; means that we invest in nurturing students’ academic and social confidence.<\/p>\n<p>Our new joiners embrace the following five challenges of attending a new school.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/IMG_2765-1.png\" alt=\"IMG_2765-1\" width=\"3024\" style=\"width: 3024px;\"><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Making new friends: how we build a collaborative community<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>From their first day at school, our students are supported in embracing opportunities to socialise. Students form close bonds with their classmates in their Grade peer group through the structure of Halcyon’s school life. Our <a href=\"https:\/\/halcyonschool.com\/2018\/05\/a-flourishing-partnership-halcyon-and-outward-bound\/\" rel=\"noopener noreferrer\" target=\"_blank\">Residential Trips<\/a> (now delayed until the Spring) have taken our Grade 6-11 students in their Grade groups to Snowdonia, Isle of Wight, and the Lake District for a variety of team building and peer bonding exercises &#8211; including hiking, climbing and a blind obstacle course! This year, our Grade 6 students bonded through group PSHE activities as they began their first term at Halcyon.&nbsp;<\/p>\n<p>Student life outside of the classroom is an equally important place for our students to connect. Our canteen is a friendly place where students can enjoy a <a href=\"\/blog\/lunch-at-halcyon-designing-a-blueprint-for-healthy-futures\" rel=\"noopener\">balanced and tasty lunch<\/a> &#8211; and after this, students can bond over journalism in our school magazine club, Halcyonite, or participate in a game of Football or Badminton. Our Wednesday afternoon <a href=\"https:\/\/halcyonschool.com\/explorations\/\" rel=\"noopener\">Explorations<\/a> classes provide a further opportunity for our students to celebrate their interests with their peers in mixed Grade 6-10 groups.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/VB_20_Halcyon_p2_00%20(2)_r_V1.jpeg\" alt=\"VB_20_Halcyon_p2_00 (2)_r_V1\" width=\"933\" style=\"width: 933px;\"><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Pursuing academic achievement: how we help students become curious inquirers<\/strong><\/h3>\n<p><strong>&nbsp;<\/strong><\/p>\n<p>Our teachers build a learning environment that sparks investigation and curiosity: we understand that this is the best way to drive achievement at school. From each student’s first week at Halcyon, they are encouraged to develop their knowledge and understanding of their own interests. From Grade 6, our <a href=\"https:\/\/halcyonschool.com\/explorations\/\" rel=\"noopener\">Explorations<\/a> Programme provides students with an opportunity to gain specialist insight into real-world disciplines such as Robotics and Archaeology, and Personal Learning encourages students to develop organisation skills by producing their own unique project on their interests: past Passion Projects have included self-made recipes and documentaries. Our students are eager to understand more about the world around them, and engaged in their International Baccalaureate studies of Mathematics, English, and Science; following <a href=\"https:\/\/www.ibo.org\/programmes\/middle-years-programme\/\" rel=\"noopener noreferrer\" target=\"_blank\">a curriculum based on interdisciplinary learning and real-world applications<\/a>.<\/p>\n<p>Class of 2020 Graduate, Saveliy, developed a curiosity for the practical applications of Mathematics during his time at Halcyon. He embraced this interest through his Extended Essay which explored how Djikstra’s algorithm could be used to shorten global transport routes and reduce pollution. Saveliy finished his final year with an IBDP result of 42.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/DSC05409%20(1).jpg\" alt=\"DSC05409 (1)\" width=\"5472\" style=\"width: 5472px;\"><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Finding their voice: how we empower students to lead and listen<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>At Halcyon, student voice is embedded into school life. Our representative Student Council takes ideas and feedback to our senior leadership and teaching teams. All students can run for a position on the Student Council, and they are encouraged to join our Model United Nations group to build their investigation, public speaking, and conflict resolution skills.<\/p>\n<p>As a welcoming and diverse community, we proudly celebrate the international nature of our school. Together, our 162 students represent 65 nationalities, and our English Plus and Mother Tongue programmes help our non-native English speakers engage in the classroom as equals while valuing their linguistic heritage. Across our curriculum, we strive to deliver intentional learning experiences that promote equality of access, foster respectful and equitable relations, and support the IB Learner Profile. We hold <a href=\"https:\/\/twitter.com\/HalcyonSchool\/status\/1280849808413130753\" rel=\"noopener noreferrer\" target=\"_blank\">ongoing curriculum reviews<\/a> to ensure that a Halcyon education is inclusive of the diversity of perspectives and experiences that exist within the wider world and our own community: a commitment that is reflected by our <a href=\"https:\/\/twitter.com\/HalcyonSchool\/status\/1238467303026700289\" rel=\"noopener noreferrer\" target=\"_blank\">student-organised guest speaker events<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p><strong><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Halcyoncampus-126.jpg\" alt=\"Halcyoncampus-126\" width=\"5748\" style=\"width: 5748px;\"><\/strong><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Developing independent learning skills: how we support students in self-management<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<p>The project-based learning of the rigorous International Baccalaureate demands that students become self-regulated learners with both digital and practical research skills. We understand that this is a multi-stage process: we dedicate weekly <a href=\"https:\/\/halcyonschool.com\/curriculum\/\" rel=\"noopener\">Personal Learning<\/a> slots to nurture Grade 6-10’s project management skills. Through Service &amp; Action and Grade 6-9 Passion Projects, which are unique to Halcyon, our students have supported time to learn how to research and present their research, collect data and plan events &#8211; skills which often prove fundamental to success in the IB MYP <a href=\"https:\/\/twitter.com\/HalcyonSchool\/status\/1261341007272005632\" rel=\"noopener noreferrer\" target=\"_blank\">Personal Project<\/a> and the IB DP <a href=\"https:\/\/www.ibo.org\/programmes\/diploma-programme\/curriculum\/extended-essay\/\" rel=\"noopener noreferrer\" target=\"_blank\">Extended Essay<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p>The development of these skills is also carefully integrated across Halcyon’s Middle Years Curriculum: Grade 7’s ‘Halcyon Who?’ project, for example, tasked students with contacting a member of staff, conducting an interview and creating a unique product design just for them.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/f.hubspotusercontent10.net\/hubfs\/2990765\/Halcyoncampus-94.jpg\" alt=\"Halcyoncampus-94\" width=\"5760\" style=\"width: 5760px;\"><\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"color: #241fc2;\"><strong>Developing a toolkit for life: helping our <\/strong><strong>students navigate change<\/strong><\/span><\/h3>\n<p>We welcome our new students to Halcyon’s <a href=\"https:\/\/halcyonschool.com\/student-wellbeing\/\" rel=\"noopener\">Wellbeing Programme<\/a> on their first day at school &#8211; a ‘Social and Emotional Learning’ programme that is targeted specifically at building students’ ability to navigate obstacles in academia and beyond. Through Friday Cognitive Coaching sessions, where each learner has dedicated one-on-one time with their assigned staff mentor, our students are supported in developing a range of tools &#8211; such as Mindfulness &#8211; which equip them with the mindset to manage stress, develop adaptability and self-awareness, make responsible decisions, and maintain balanced relationships.&nbsp;<\/p>\n<p>Our Wellbeing Team leads a PSHE curriculum that highlights the importance of social and emotional literacy, driven by research-led techniques of relational learning (a community-based form of communication aimed at boosting emotional intelligence), <a href=\"https:\/\/restorativejustice.org.uk\/restorative-practice-schools\" rel=\"noopener noreferrer\" target=\"_blank\">restorative practice<\/a> (innovative conflict resolution), and group mentoring. At the beginning of their school year, Grade 6 reflected on their level of social and emotional understanding through <a href=\"https:\/\/edpuzzle.com\/media\/5f50e971b1a3de3f269758c0\" rel=\"noopener noreferrer\" target=\"_blank\">analysing a scene from the popular movie ‘Inside Out’<\/a>. As we nurture students’ emotional intelligence, we continue to relate their learning in PSHE to their everyday experiences with their friends, family, teachers, and the media around them.<\/p>\n<p>&nbsp;<\/p>\n<p>To learn more about student life and learning at Halcyon, sign up for an <a href=\"https:\/\/halcyonschool.com\/contact\/\" rel=\"noopener\">Open House<\/a> today.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Joining a new school is an important moment for both students and parents. While parents are always excited to wave goodbye to their child as they step onto their new school campus, they may wonder about how their child is faring in this new adventure.<\/p>\n","protected":false},"author":5,"featured_media":7251,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7195"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7195"}],"version-history":[{"count":2,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7195\/revisions"}],"predecessor-version":[{"id":10283,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7195\/revisions\/10283"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7251"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}