{"id":7198,"date":"2020-08-13T09:00:00","date_gmt":"2020-08-13T09:00:00","guid":{"rendered":"https:\/\/halcyonschool.com\/social-and-emotional-learning-halcyons-cooperation-challenge\/"},"modified":"2021-08-16T09:13:45","modified_gmt":"2021-08-16T09:13:45","slug":"social-and-emotional-learning-halcyons-cooperation-challenge","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/social-and-emotional-learning-halcyons-cooperation-challenge\/","title":{"rendered":"Social and Emotional Learning: Halcyon&#8217;s Cooperation Challenge"},"content":{"rendered":"<p>Cooperation is a crucial skill for our students, key to becoming balanced, caring communicators that will thrive in the International Baccalaureate and make a difference in their lives beyond Halcyon. While we all recognise that we can achieve much more when we work together, it is important to dedicate time in the school day to practice fundamental teamwork skills to do this as successfully as we can. <!--more--> <br \/>On a Friday afternoon in their mentor groups, students invented nations, symbols and core principles to guide their team&#8217;s behaviour &#8211; the aim of the game being to achieve the highest possible economic health and humanitarian rating for their &#8216;nation&#8217;.<\/p>\n<p>Each nation&#8217;s humanitarian ranking would be based on evidence of the following skills: making decisions together, supporting each other during times of difficulty, seeking agreement, making space for all voices, praising contributions of others, bringing people together and helping out other nations. Nations&#8217; economic health ratings were based on the teams&#8217; abilities to have the same or more resources than they started with, having a healthy portfolio of resources and having a healthy cash reserve.<\/p>\n<p>Within the mentor groups, Grade 6 and 7 students (our young &#8216;diplomats&#8217;) were tasked with moving and negotiating between nations, while Grade 8, 9 and 10 divided their roles between Facilitator, Head of State, Diplomatic Secretary, Financial Director, Foreign Office, and Press Secretary (whose role involved recording evidence of the above-mentioned skills).<\/p>\n<p>Not only did students have the chance to hone their cooperation skills as a &#8216;nation&#8217; trading with another &#8216;nation&#8217;- they were required to agree on how to organise themselves as a team too.<\/p>\n<p>Judging by how students animatedly encouraged their diplomats to strike deals with other &#8216;nations&#8217;, collected in small groups to design plans and smiled welcomingly at other mentor groups to invite them to a discussion, they grasped the requirements of this challenge whole-heartedly.<\/p>\n<p>After students left the school building, teachers continued to excitedly share what they had witnessed throughout the afternoon with each other. It&#8217;s never a surprise to see our students embrace a challenge &#8211; but nonetheless, watching our young learners support each other with such commitment is always a joy.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cooperation is a crucial skill for our students, key to becoming balanced, caring communicators that will thrive in the International Baccalaureate and make a difference in their lives beyond Halcyon. While we all recognise that we can achieve much more when we work together, it is important to dedicate time in the school day to [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7254,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7198"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7198"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7198\/revisions"}],"predecessor-version":[{"id":7319,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7198\/revisions\/7319"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7254"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7198"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7198"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7198"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}