{"id":7204,"date":"2020-03-31T15:56:38","date_gmt":"2020-03-31T15:56:38","guid":{"rendered":"https:\/\/halcyonschool.com\/communications-for-your-school-in-a-crisis\/"},"modified":"2021-08-16T09:17:11","modified_gmt":"2021-08-16T09:17:11","slug":"communications-for-your-school-in-a-crisis","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/communications-for-your-school-in-a-crisis\/","title":{"rendered":"Communications For Your School In A Crisis"},"content":{"rendered":"<div class=\"fusion-text\">\n<p><span>There are a number of crises that could affect a school. However, all of them will result in a finite number of emergency responses which you can be prepared for. <!--more-->For example:<\/span><\/p>\n<ul>\n<li><span>Students are kept in one part of the campus,&nbsp;<\/span><\/li>\n<li><span>Students are kept inside the campus,&nbsp;<\/span><\/li>\n<li><span>Students are dismissed from campus and need picking up, or&nbsp;<\/span><\/li>\n<li><span>Students are escorted to a different location before being brought back in when the campus is safe.<\/span><\/li>\n<\/ul>\n<\/div>\n<div class=\"fusion-text\">\n<h3><strong>The importance of communications<\/strong><\/h3>\n<p><span>The most important thing in a crisis is communications, its primary role is to reduce panic. Panic can cause emotional reactions, which we need to prevent in order to successfully contain a crisis situation.<\/span><\/p>\n<p><span>An intruder enters the building and the campus has been put on a classroom lock down. Parents have been notified, but not told what action they should take. Parents start arriving at the school and walking in…<\/span><\/p>\n<p><span>You can see where this is going. Misinformation or slow communications will affect people’s lives in a crisis. Preparedness is key to keeping everyone safe.&nbsp;<\/span><\/p>\n<h3><strong>Prepare communications ahead of time<\/strong><\/h3>\n<p><span>Have every communication prepared ahead of time. Take the time to think through all the kinds of scenarios that might logically happen for each emergency response eg: an intruder on campus, a terrorist threat nearby, a fire etc.<\/span><\/p>\n<ul>\n<li><span>What channels of communications will you need for each of these?<\/span><\/li>\n<li><span>What information will you need to give?<\/span><\/li>\n<li><span>Who will you need to inform?<\/span><\/li>\n<li><span>What will you need them to do?<\/span><\/li>\n<\/ul>\n<p><span>Create templates so you can have them reviewed and checked by all the right people prior to a crisis event – this saves precious time where you might be needed elsewhere.&nbsp;<\/span><\/p>\n<h3><strong>Be the voice of reason<\/strong><\/h3>\n<p><span>Explain the actions people need to take clearly in simple, plain english for each group of people. You can follow my 4 S’s – they might help you critique your communications.<\/span><\/p>\n<ol>\n<li><strong>Succinct<\/strong><span>&nbsp;– Keep it as short as possible for easy reading. No complicated sentences or terminology.<\/span><\/li>\n<li><strong>Simple<\/strong><span>&nbsp;– Don’t ask anyone to do more than three things or decide between more than two choices – it creates uncertainty in a crisis situation.&nbsp;<\/span><\/li>\n<li><strong>Specific<\/strong><span>&nbsp;– Include as much information as possible. If you want parents to immediately pick up their children; Where?&nbsp;What happens if they aren’t able to?&nbsp;Who do they need to meet with?&nbsp;The more questions you answer, the less questions you will need to respond to.<\/span><\/li>\n<li><strong>Sensible<\/strong><span>&nbsp;– Are your communications appropriate to the situation and are they logical and reasonable?&nbsp;Try to empathise with worried parents in what you expect from them.&nbsp;<\/span><\/li>\n<\/ol>\n<h3><strong>Give 100% accurate information<\/strong><\/h3>\n<p><span>If you’re following advice from another source then ensure you are not reinterpreting anything when you have no expertise; even creating a summary can lead to misinformation.&nbsp;<\/span><\/p>\n<p><span>Trust the government or emergency services and simply link to their websites. These websites are often updated live which prevents your information from becoming out of date. Think about including a timestamp where appropriate to reduce this risk.<\/span><\/p>\n<\/div>\n<div class=\"fusion-text\">\n<h3><strong>Allow the community to be heard<\/strong><\/h3>\n<p><span>Wherever possible, supply an email or phone number – letting people be heard can reassure them and reduce misinterpretation. If it’s an ongoing crisis (a good example being the current issues surrounding the Coronavirus) try to make sure your leadership team is more visible around campus to field any questions; this is another way to communicate and reduce panic.<\/span><\/p>\n<p><span>The community will very likely have questions. Ensure that those who are engaging with them have an agreed response to some of the more likely questions. Do not deviate from the script nor from any government\/emergency service advice.<\/span><\/p>\n<h3><strong>Allow the community to hear you<\/strong><\/h3>\n<p><span>Ensure your communications are accessible by thinking about the channels you are using. Can everyone in your community access these?&nbsp;Do you have anyone in the community with special needs which might mean they cannot access your message – perhaps a phone call might be better for these individuals?&nbsp;<\/span><\/p>\n<p><span>You should have the capability to email or text the whole community in a short space of time. Consider creating a webpage that provides updates for the community to revisit. Most importantly how will you logistically send these messages?&nbsp;<\/span><\/p>\n<ul>\n<li><span>Can you send this information whilst you have been evacuated?&nbsp;<\/span><\/li>\n<li><span>Are you reliant on a certain system or software or strong wifi?&nbsp;<\/span><\/li>\n<\/ul>\n<p><span>Most people these days will have their smartphone on them, even in a crisis, with which you can access the internet almost anywhere. You should be able to send emergency updates from a smart mobile device as a backup.<\/span><\/p>\n<p><span>Communications in a crisis doesn’t have to be stressful, complicated or only left to professionals; prepare your communications ahead of time, have as many people reviewing those templates as possible, and be able to send out the message from anywhere.<\/span><\/p>\n<p>By <a href=\"mailto:communications@halcyonschool.com\" rel=\"nofollow noopener\">Katy Wrench<\/a>, Marketing Leader at Halcyon London International School<br \/>\n<span style=\"font-style: italic;\">Featured on <\/span><a href=\"http:\/\/www.ambleglow.co.uk\/communications-for-your-school-in-a-crisis\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"font-style: italic;\">Ambleglow<span style=\"color: #414042;\">.<\/span><\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>There are a number of crises that could affect a school. However, all of them will result in a finite number of emergency responses which you can be prepared for.<\/p>\n","protected":false},"author":5,"featured_media":7260,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,58],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7204"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7204"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7204\/revisions"}],"predecessor-version":[{"id":7307,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7204\/revisions\/7307"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7260"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7204"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7204"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7204"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}