{"id":7205,"date":"2020-03-30T09:00:00","date_gmt":"2020-03-30T09:00:00","guid":{"rendered":"https:\/\/halcyonschool.com\/remote-learning-at-halcyon-an-interactive-digital-community-2\/"},"modified":"2021-08-16T09:17:28","modified_gmt":"2021-08-16T09:17:28","slug":"remote-learning-at-halcyon-an-interactive-digital-community-2","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/remote-learning-at-halcyon-an-interactive-digital-community-2\/","title":{"rendered":"Remote Learning at Halcyon: an interactive digital community"},"content":{"rendered":"<p>As the cheerful noise of the Google Hangouts Meet connection rings out, we’re faced by a smiling teacher in her living room who eagerly awaits the prompt to tell us all about her virtual lesson. English and English Plus (EAL) teacher Lindsey Fairweather is not alone in her excitement to share <a href=\"https:\/\/halcyonschool.com\/remote-learning\" rel=\"noopener\">Halcyon’s Remote Learning platform<\/a> &#8211; parents have described the school’s digital transition as an “exceptional” response that has students “100% focused and engaged”.&nbsp;<\/p>\n<p><!--more--><\/p>\n<p>Halcyon launched its Remote Learning platform on Monday 16 March &#8211; a week prior to most schools in the United Kingdom. In preparation, our teachers worked together with Digital Learning <a href=\"https:\/\/www.tes.com\/news\/revealed-stars-uks-edtech-sector\" rel=\" noopener\" target=\"_blank\">Leader<\/a> <a href=\"https:\/\/twitter.com\/jnealeuk\" rel=\"noopener\" target=\"_blank\">Jon Neale<\/a> to build a virtual learning platform, online classrooms, community resources, as well as collaborative staff planning spaces. This multi-layered approach to remote learning reflects a shared understanding of how to use EdTech at Halcyon: not selecting apps for isolated classroom tasks, or because of “bells and whistles” (as Jon puts it), but integrating tools ranging from Google Hangouts Meet to <a href=\"https:\/\/cospaces.io\/\" rel=\" noopener\" target=\"_blank\">Cospaces<\/a> to deliver online classes that engage each and every student as equal participants.&nbsp;<\/p>\n<p>From the first day of Remote Learning, Halcyon’s teachers have connected with us through Google Meet to share their insights into how educators can build an interactive, inclusive community through digital tools.&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Using EdTech to create interactive learning experiences<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Halcyon understands that Remote Learning is an opportunity for educators to do much more than instruct over video-conferencing &#8211; instead, we can integrate digital tools to engage our students and connect them across virtual classrooms.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/3-1.png\" alt=\"3-1\" width=\"390\" style=\"width: 390px; float: left; margin: 0px 10px 10px 0px;\">On the very first day of Halcyon’s transition to Remote Learning, IBMYP Science and IBDP Environmental Systems and Societies teacher Martyn Steiner was eager to share the success of using <a href=\"https:\/\/nearpod.com\/international\" rel=\"noopener\" target=\"_blank\">Nearpod<\/a> as a platform for his lesson. Grade 8 engaged in their lesson on the causes and effects of climate change through a ‘Livedeck’ of interactive slides, which included a Virtual Reality tour of a UK flood and a live ‘open-ended quiz’, where students thoughtfully shared possible answers to its causes. Martyn suggested that being able to receive students’ responses and provide feedback on Google Classroom in real time made the Google Meet room feel “just like a real Halcyon classroom” &#8211; an environment where each student can receive personalised attention and guidance from teachers.&nbsp;<\/p>\n<p>Across our team, teachers have showcased a plethora of ways of using Google Meet to effectively encourage participation from all students. IBDP Mathematics Teacher Sonja Bartholomew invited us to take a look into her remote version of a Higher Level lesson, where she used <a href=\"https:\/\/www.gingerlabs.com\/\" target=\"_blank\" rel=\"noopener\">Notability<\/a> to work through optimisation problems on a virtual iPad whiteboard, shared with her two students through the app’s ‘Present’ function. Students were able to comment on Sonja’s optimisation problems in real time, as well as respond to each other’s suggestions.<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/2-1.png\" alt=\"2-1\" width=\"416\" style=\"background-color: transparent; width: 416px; float: left; margin: 0px 10px 10px 0px;\">Sonja’s peer-evaluative approach was also reflected in Anne Liao’s and Kerry Jenkins’ online Grade 7 Science classes. Anne and Kerry integrated <a href=\"https:\/\/info.flipgrid.com\/\" target=\"_blank\" rel=\"noopener\">FlipGrid<\/a> into their Google Meet lessons as a way for their students to upload their home refraction experiments to a shared platform. Through examining each others’ experiments and engaging in peer review through Google Classroom, Grade 7 participated in an enriching learning experience that also reinforced their connection with one another.&nbsp;<\/p>\n<p>In our video call, Lindsey recalled how establishing the rule of typing ‘Q’ into the Hangouts chat to ask a question had encouraged students to recognise the Meet room as a shared space: Grade 6 quickly became conscientious of other students’ needs, even speaking up to remind one another to “stay hydrated” as they learned. It is this community-oriented environment that allows our teachers to successfully deliver a range of independent and team learning tasks &#8211; including Grade 6’s Shakespeare group performances, planned for later in the term.&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Building a digital community beyond online classrooms<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>“Creating a Remote Learning Environment is primarily about all of us being able to work together to build a spirit of community,” explains Jon Neale, responding to our questions over voice chat. “This means integrating digital tools into student life beyond lessons.”<\/p>\n<p>Halcyon’s Wellbeing team have come together to create an inclusive online community that extends far beyond virtual classrooms. Student Wellbeing Leader Toby Cann has used ‘<a href=\"https:\/\/www.thinglink.com\/\" target=\"_blank\" rel=\"noopener\">Thinglink<\/a>’ to create an online interactive map of the school, where students could find “a variety of ways to access the support that they might need.” At lunch, students can use this resource to venture through virtual corridors to an art room, a music room, and spaces where they could reach out to teachers, or even simply spend time socialising with classmates. In the Stern Hall, they can access a FlipGrid dedicated to workout videos, which Staff Wellbeing Project Leader Celeste Gardner described as an initiative that allows the community “to feel connected” with one another. “Encouraging everyone to share their workout tips on FlipGrid brings us together, while also providing a way for us to look after our physical wellbeing.”&nbsp;<\/p>\n<p>Celeste’s recognition of the need for a supportive community in these times is reflected by our students. Nicole, Greta and Juliette (Grade 11) have continued to lead Dance Club through Google Meet on Mondays, with the welcome addition of some new attendees; creating another space for students to connect beyond their virtual classrooms.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/ezgif-6-72bc3ba51fb1.gif\" alt=\"dance club\" width=\"389\" style=\"width: 389px; float: right; margin: 0px 0px 10px 10px;\"><span style=\"background-color: transparent;\">Our Director’s daily communication with our community provides a place for students, staff and parents to stay updated with virtual events while gaining insight into innovative online classes. It’s important to find ways for our families to feel connected to this transition process &#8211; and parents as well as students can find “structure” to daily life through a regular stream of information (as one parent described).<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Going above and beyond: a community of lifelong learners<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>“As a Science team, we’re continuing to meet within our regular slots through Google Meet. We’re also able to facilitate thorough one-on-one planning with our Grade subject co-teachers.” MYP Science and DP Physics teacher Anders Henriksen explains. Collaborative GSuite tools can be used to facilitate coherent lesson planning that guides students clearly towards their learning objectives, even in these unusual circumstances.<\/p>\n<p>&nbsp;<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/DSC05462%20(1).jpg\" alt=\"DSC05462 (1)\" width=\"5472\" style=\"width: 5472px;\"><\/p>\n<p>&nbsp;<\/p>\n<p>As well as using Google Meet and collaborative Google Docs to share ideas among teams, our teachers use a staff-wide ‘Q&amp;A’ document to source their colleagues’ suggestions and thoughts on their ideas. Jon Neale stresses the importance of “being as transparent and open as possible” in working through the transition to a remote learning: a fundamental part of striving to create an ever-improving digital environment for our students.&nbsp;<\/p>\n<p>We&#8217;re ready for new families to join our thriving digital community &#8211; register for a <a href=\"https:\/\/halcyonschool.com\/visit\" rel=\"noopener\">virtual Open House<\/a>!<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the cheerful noise of the Google Hangouts Meet connection rings out, we’re faced by a smiling teacher in her living room who eagerly awaits the prompt to tell us all about her virtual lesson. English and English Plus (EAL) teacher Lindsey Fairweather is not alone in her excitement to share Halcyon’s Remote Learning platform [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7261,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,58],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7205"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7205"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7205\/revisions"}],"predecessor-version":[{"id":7304,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7205\/revisions\/7304"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7261"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}