{"id":7206,"date":"2020-03-10T17:24:15","date_gmt":"2020-03-10T17:24:15","guid":{"rendered":"https:\/\/halcyonschool.com\/lunch-at-halcyon-designing-a-blueprint-for-healthy-futures\/"},"modified":"2023-02-14T13:44:20","modified_gmt":"2023-02-14T13:44:20","slug":"lunch-at-halcyon-designing-a-blueprint-for-healthy-futures","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/lunch-at-halcyon-designing-a-blueprint-for-healthy-futures\/","title":{"rendered":"Lunch at Halcyon: Designing a blueprint for healthy futures"},"content":{"rendered":"<p>Meet our Catering Team!<\/p>\n<p>Every Friday marks the end of a busy week for our Catering team. As our kitchen Porter safely wheels away the emptied bowls and plates from our cafeteria, our team to shares an exclusive insight into the research, planning and preparation that resulted in <a href=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/Lunch%20Menu%20-%20Week%202%20-%20Tuesday%20(1).png\" rel=\" noopener\" target=\"_blank\">today’s warmly welcomed mushroom risotto, stuffed aubergines, colourful salad bar and lemon drizzle cake<\/a>.<\/p>\n<p><!--more--><\/p>\n<p>As we ask the team about her goals, it’s clear that their priority is our students’ health and happiness: at Halcyon, at home, and beyond. “we want them to come away with a blueprint for healthy eating,” they explain, “because the school canteen is where some of our strongest memories of school are made.” To ensure that our students finish their time at Halcyon with fond recollections of a healthy lunchtime, our catering team strives to provide meal options that are both balanced and enjoyable.<\/p>\n<h2>Sustainable, varied menus<\/h2>\n<p><img style=\"width: 1170px;\" src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/IMG_5192.jpg\" alt=\"IMG_5192\" width=\"1170\" \/><\/p>\n<p>When we ask the team about their approach to our exclusively vegetarian menu, they responds with enthusiasm. “we actually really enjoy working with vegetarian ingredients. We have so many options &#8211; we don’t have to ‘bulk up’ on beans or cheese to replace meat. We can ensure that students get their carbohydrates and protein in a range of ways!”<\/p>\n<p>Establishing the importance of Halcyon’s sustainable approach to forming healthy dietary habits. “As a vegetarian school, we find that meat alternatives can be made from many nutritious, high-quality ingredients &#8211; and we create 90% of the dishes from scratch. We make our own vegetarian burgers!” “Students might be surprised that we can produce such variety, but this is all part of helping them understand that there’s always plenty of ways to eat healthily.”<\/p>\n<h2>Incorporating student preferences<\/h2>\n<p>Our catering team is keen to express that another crucial aspect of her role is actively seeking out student opinion. “You have to respect the tastes of the people you cater for,; and I value dislikes as much as compliments. Constructive criticism is the only way to change!”<\/p>\n<p>When we tentatively ask about the question of ‘picky eaters’, she laughs, clearly at ease with dealing with particular tastes. “There’s always going to be people who are more picky with their food, and we’d love to have a chat with those students just as much as everyone else. We let them know that we understand, and that there’s always something else they can have. We can always try new changes in the menus that are responsive to students’ ideas.”<\/p>\n<p>Prompted by the discussion of student inclusivity, we ask the team about the importance of including catering in our school fees. “If students had to pay, they wouldn’t feel that they’re the priority and they wouldn’t want to communicate with us to find a healthy way of eating that suits them.” As well as lunch, Halcyon provides snack breaks included in the school <a href=\"https:\/\/halcyonschool.com\/2018\/03\/school-fees\/\" rel=\" noopener\">fees<\/a> &#8211; we want our students to know that their health and energy is our absolute priority.<\/p>\n<h2>A dedicated team<\/h2>\n<p>Like our teaching and administrative teams, our catering team is guided by a collaborative spirit that enables a shared positivity and determination. “The most important thing we learned is to value each other.” The canteen wouldn’t be able to function without all of us working together respecting the structures and routines of every member of the team.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Meet our Catering Team! Every Friday marks the end of a busy week for our Catering team. As our kitchen Porter safely wheels away the emptied bowls and plates from our cafeteria, our team to shares an exclusive insight into the research, planning and preparation that resulted in today’s warmly welcomed mushroom risotto, stuffed aubergines, [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":14785,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7206"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7206"}],"version-history":[{"count":8,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7206\/revisions"}],"predecessor-version":[{"id":14794,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7206\/revisions\/14794"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/14785"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7206"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7206"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7206"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}