{"id":7217,"date":"2019-09-18T13:28:00","date_gmt":"2019-09-18T13:28:00","guid":{"rendered":"https:\/\/halcyonschool.com\/english-plus-at-halcyon-building-a-community\/"},"modified":"2021-08-16T09:38:21","modified_gmt":"2021-08-16T09:38:21","slug":"english-plus-at-halcyon-building-a-community","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/english-plus-at-halcyon-building-a-community\/","title":{"rendered":"English Plus at Halcyon: Building a Community"},"content":{"rendered":"<p>Our new <i>English as an Additional Language <\/i>(EAL) teacher took a few minutes out of her busy work supporting students to give us an insight into how Halcyon’s new programme is already enriching students’ love of learning.&nbsp;<\/p>\n<p><!--more--><\/p>\n<p>&nbsp;<\/p>\n<p>Halcyon’s English Plus programme is not built around a pre-made and rigid curriculum, but tailor-made to fit students’ individual needs to allow them to fully engage with life at Halcyon. Lindsey Fairweather integrates learning tasks with the requirements of different classes: finding out what vocabulary they might need for their IB Personal Projects, for example, and liaising closely with their other teachers to gather technical terms that need attention. Digital tools like Membean can be used to build personalised word lists, and NoRedInk.com can make traditional language exercises into grammar tests based around topics that students might be interested in (like Harry Potter, Lindsey suggests).&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Being able to engage with life at Halcyon is, after all, about more than just being able to learn the word ‘trigonometry’: it’s about being a learner who is ready to develop and express their own interests, ideas and suggestions (crucial to the IB criteria as well as their social confidence).&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Our English Plus students have been sharpening their presentation skills to allow them to open up to their classmates, as both fellow learners and friends. Lindsey explains that other teachers have already suggested to her that English Plus has given students the confidence to take part in social presentation activities.<\/p>\n<p>&nbsp;<\/p>\n<p>English Plus is more than just giving students a helping hand; it is enabling and empowering them. Lindsey laughs as she explains that her aim is essentially “to put herself out of a job”: to lead students to a place where they no longer need EAL instruction. Until that point, the outreach and support that Lindsey provides &#8211; encouraging students to ask for help between lesson times, delivering personalised feedback and building a community of motivated learners &#8211; makes her an extra mentor figure for some, and central to their wellbeing. Letting students know that their individual needs are valued and that Halcyon is excited to receive them is integral to their learning journey.&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>We want students and parents alike to know that English Plus at Halcyon is another tool to bring out the best in each individual student.&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Language resources:<\/p>\n<p><a href=\"https:\/\/membean.com\/\" target=\"_blank\" rel=\"noopener\">membean.com<\/a><\/p>\n<p><a href=\"https:\/\/www.commonlit.org\/\" target=\"_blank\" rel=\"noopener\">commonlit.org&nbsp;<\/a><\/p>\n<p><a href=\"https:\/\/www.noredink.com\/\" target=\"_blank\" rel=\"noopener\">noredink.com <\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our new English as an Additional Language (EAL) teacher took a few minutes out of her busy work supporting students to give us an insight into how Halcyon’s new programme is already enriching students’ love of learning.&nbsp;<\/p>\n","protected":false},"author":5,"featured_media":7273,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7217"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7217"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7217\/revisions"}],"predecessor-version":[{"id":7335,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7217\/revisions\/7335"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7273"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}