{"id":7219,"date":"2019-07-08T15:27:40","date_gmt":"2019-07-08T15:27:40","guid":{"rendered":"https:\/\/halcyonschool.com\/student-run-volunteer-trip-to-cambodia\/"},"modified":"2021-08-16T09:38:38","modified_gmt":"2021-08-16T09:38:38","slug":"student-run-volunteer-trip-to-cambodia","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/student-run-volunteer-trip-to-cambodia\/","title":{"rendered":"Student-run Volunteer trip to Cambodia"},"content":{"rendered":"<p><span>Our group of Grade 11 students had a great time volunteering in Cambodia on a trip organised by Finley. They arrived early morning in Phnom Penh for some sightseeing, having travelled for over 15 hours and walking in 40° heat &#8211; a great feat in itself! They spent their first evening floating down the Mekong river on a sunset cruise.&nbsp;<\/span><\/p>\n<p><span>Sunday was a day of more action-packed sightseeing, and they got caught in a huge massive rainstorm, luckily the hotel wasn&#8217;t far away! They woke up extremely early on Monday morning to travel 1.5 hours to Putsor commune; a small rural community. Communes are small provinces which can consist of as few as 3 or as many as 30 villages. It is here that the Green Umbrella is located, and also where the group volunteered for the week.&nbsp;<\/span><\/p>\n<p><span>The students participating in several projects at the Green Umbrella. The first involves visiting classrooms at the Karuna Kumar School, and engaging with both students and teachers in order to develop new lesson ideas, to allow students to practice English and Science skills, and to demonstrate fun and engaging ways to teach the curriculum. Finn, Clara and Iris helped out in the library &#8211; cataloguing Green Umbrella’s extensive range of books and inputting them all into a digital system created by Finn himself. They&#8217;ve were able to document nearly 2000 books, and there is still more work to be done! With this new system, the librarian will be able to keep books organised and catalogued and spend less time finding books and more time helping the students to find something to read.&nbsp;<\/span><\/p>\n<p><span>In the afternoons, students took a short cycle to the local high school, where they engage in their environment project. The aim of this project was to educate a small group of students on the importance of recycling and waste management, as well as to encourage saying no to straws and other single-use plastics. <\/span><\/p>\n<p><!--more--><\/p>\n<p><span>Although there was sometimes a language barrier, students were able to overcome this by using images and gestures, as well as the help of Sam, a Green Umbrella employee who was able to translate. Clara and Finn used mathematics to demonstrate the huge impact that saying &#8220;no&#8221; to straws has; nearly 10,500 straws could be saved each year if students say no to only one straw per day. Elisabet, Martina, Melina and Andrea were able to use song and performance to teach students the harmful effects single-use plastics have on the local environment. Students will be able to share this information with their families and friends, and further their own ideas about how to improve their local environments.&nbsp;<\/span><\/p>\n<p><span>This trip has been an incredible learning experience for the group. The projects and work conducted by the Green Umbrella are amazing &#8211; providing local children with a strong primary education; knowledge that they are able to share with their families and wider community. <\/span><\/p>\n<p><span>&#8220;We are all very grateful to have been given the opportunity to come and experience the Green Umbrella and to have been able to participate in the amazing work they do here every single day.&#8221; said Finn.<\/span><\/p>\n<p><span>This trip would not have been possible without the hard work of Ms Joann Ranson, Ms Fátima González, Julia Alden, and of course, the students Melina, Elisabet, Clara, Iris, Martina, Andrea and Finn. Well done to everyone.&nbsp;<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our group of Grade 11 students had a great time volunteering in Cambodia on a trip organised by Finley. They arrived early morning in Phnom Penh for some sightseeing, having travelled for over 15 hours and walking in 40° heat &#8211; a great feat in itself! They spent their first evening floating down the Mekong [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7275,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,59],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7219"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7219"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7219\/revisions"}],"predecessor-version":[{"id":7306,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7219\/revisions\/7306"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7275"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7219"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7219"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7219"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}