{"id":7220,"date":"2019-06-28T16:00:25","date_gmt":"2019-06-28T16:00:25","guid":{"rendered":"https:\/\/halcyonschool.com\/grade-10-work-experience\/"},"modified":"2021-08-16T09:38:48","modified_gmt":"2021-08-16T09:38:48","slug":"grade-10-work-experience","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/grade-10-work-experience\/","title":{"rendered":"Grade 10 Work Experience"},"content":{"rendered":"<p>Work experience provides students with a meaningful opportunity to put in to practice the skills they have learnt throughout their MYP. At Halcyon, G10 students take part in either a week of work experience or a week learning to sail. This enriching experience is just one of the many ways in which we help students to prepare for life after school.&nbsp;&nbsp;<\/p>\n<p><!--more--><\/p>\n<p>As one example; G10 student Nicole spent time at Sanlam, a wealth management company in the heart of the city. This experience gave Nicole an insight into an industry that was completely new to her. She was able to work in various areas of the business and gain a real understanding of wealth management.&nbsp;<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/nicole.jpg\" alt=\"nicole at work experience\"><\/p>\n<p>One of the most exciting aspects of work experience is being able to apply the skills learnt in the classroom on real-life projects. Nicole worked with a portfolio manager to create an investment portfolio for a client. She also researched other wealth management company websites and reviewed how they appealed to a younger audience. Using her own knowledge and understanding, she was able to provide insight into how Sanlam could broaden the appeal of their website. You can read her thoughts <span style=\"color: #3176bc;\"><a href=\"https:\/\/www.linkedin.com\/pulse\/too-cool-school-why-financial-planning-should-part-more-penny-lovell\/\" rel=\" noopener\" style=\"color: #3176bc;\" target=\"_blank\">here<\/a><\/span> in a blog posted by Sanlam on LinkedIn.&nbsp;<\/p>\n<p>As someone who previously had limited knowledge of financial services, time in the workplace opened her eyes to other opportunities and industries that she might want to consider in the future. &#8220;I found work experience to be an invigorating experience! Every day I was excited to go to work and I learnt so much in a short space of time&#8221;, said Nicole.&nbsp;&nbsp;<\/p>\n<p>For students who chose to spend the week learning to sail, they had a truly unique experience. A typical day at sea meant being up at 7.30 to ‘undress the ship’; taking off covers and preparing winch handles for the sails to be raised. Each day, students would need to ensure they plotted a course on their charts and then take turns at the helm. There were also meals to prepare, with students taking responsibility for meal planning and budgeting.&nbsp;&nbsp;<\/p>\n<p>Darrien enjoyed the challenges of being at sea. He was excited to learn about sailing and worked to encourage and motivate his fellow Grade 10 sailors. Collaborating to achieve daily goals was important in making sure each day ended successfully. Darrien has now been asked to train as a Watch Leader, a course only accessed through recommendations. This opportunity is a great achievement after only one week&#8217;s experience.<\/p>\n<p>The IB encourages students to be risk takers and for many of the students who choose to take part in the sailing programme, this was a once in a lifetime opportunity for personal growth. All students (and staff) on the sailing trip achieved their RYA Competent Crew Sailing qualifications.&nbsp;<\/p>\n<p>Mark Bowen, University and Careers Guidance Counsellor, reflected that the students gained a lot of practical experience and learned first-hand what it was like to be in a real-life workplace setting.&nbsp;They were able to participate in a variety of activities including research, presenting powerpoint projects, observing professionals at work and interacting with colleagues.&nbsp;<\/p>\n<p>Students reported that they felt that Work Experience Programme had given them valuable insights into the world of work and careers. We look forward to seeing how they use this experience as they enter their Diploma Programme.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Work experience provides students with a meaningful opportunity to put in to practice the skills they have learnt throughout their MYP. At Halcyon, G10 students take part in either a week of work experience or a week learning to sail. This enriching experience is just one of the many ways in which we help students [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7276,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7220"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7220"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7220\/revisions"}],"predecessor-version":[{"id":7337,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7220\/revisions\/7337"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7276"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7220"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7220"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7220"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}