{"id":7221,"date":"2019-06-21T16:12:13","date_gmt":"2019-06-21T16:12:13","guid":{"rendered":"https:\/\/halcyonschool.com\/halcyon-welcomes-edtech-innovators\/"},"modified":"2021-08-16T09:38:57","modified_gmt":"2021-08-16T09:38:57","slug":"halcyon-welcomes-edtech-innovators","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/halcyon-welcomes-edtech-innovators\/","title":{"rendered":"Halcyon welcomes EdTech innovators"},"content":{"rendered":"<p>We are proud to be one of only 50 schools in the UK recognised for our innovative use of education-based technology (edtech) in the classroom. The <a href=\"http:\/\/www.ednfoundation.org\/wp-content\/uploads\/EDTECH-50-SCHOOLS-2019.pdf\" target=\"_blank\" rel=\"noopener\">EdTech50 awards<\/a>, established by <a href=\"http:\/\/www.ednfoundation.org\/\" target=\"_blank\" rel=\"noopener\">The Education Foundation<\/a> in 2018 to recognise individuals and businesses for their pioneering contributions to edtech. In May 2019, Halcyon was part of the first edition to recognise schools in the EdTech50 awards.<\/p>\n<p><!--more--><\/p>\n<p><span>Halcyon was honoured to be selected to host the first Edtech50 Study Visit, a chance for others within the educational community to hear about our digital journey, strategy, and learning culture, and to see our learning and teaching in action. <\/span>We are extremely grateful to <a href=\"https:\/\/twitter.com\/ty_goddard\" target=\"_blank\" rel=\"noopener\">Ty Goddard<\/a>, Director of <a href=\"http:\/\/www.ednfoundation.org\/\" target=\"_blank\" rel=\"noopener\">The Education Foundation<\/a> for his support in facilitating this visit. We were delighted to welcome school leaders from across the UK as well as organisers of <a href=\"https:\/\/www.bettshow.com\/\" target=\"_blank\" rel=\"noopener\">the BETT show<\/a>, a leading trade show marketing information technology in education.<\/p>\n<p>As a school, we pride ourselves on being a leader in innovative and collaborative teaching and learning. We are not a digital school but instead, we use technology across the <a href=\"http:\/\/www.ibo.org\/\" target=\"_blank\" rel=\"noopener\">International Baccalaureate<\/a> Middle Years Program and Diploma Program to support and enhance learning. This was demonstrated by the many examples our teaching team and students shared with our visitors.<\/p>\n<p>Stacy Marshall has used the app <a href=\"https:\/\/www.screencastify.com\/\" target=\"_blank\" rel=\"noopener\">Screencastify<\/a> to redefine the way in which she provides feedback on lab reports. She now creates video recordings of her own laptop screen with the assignment criteria on one side and the student’s work on the other. Stacy discovered that some of our G6 students prefer audio feedback in their reflection time which they use to improve their work going forward. Combining a Screencastify video with a voice recording allows students to receive feedback in a more personalised manner. The technique has encouraged a sense of collaboration between students as they support each other in areas where they might want to improve their skills.<\/p>\n<p>Fatima Gonzalez and Gareth Jones shared their experiences teaching <a href=\"https:\/\/edu.google.com\/products\/vr-ar\/expeditions\/?modal_active=none\" target=\"_blank\" rel=\"noopener\">Google Expeditions<\/a>, an app developed to bring Augmented Reality and Virtual Reality into the classroom. The app has a wide variety of virtual places to visit including a 360 view of Machu Picchu and an animated DNA testing laboratory! In Biology classes, this tool has helped students understand environments that they aren’t able to experience first hand, such as the Galapagos Islands.<\/p>\n<p>In Spanish classes, the app has been used to help students develop insights into the features, processes and craft of language and the concept of culture, as well as to realise that there are diverse ways of living, viewing and behaving in the world. Fatima enables students to visually explore the scene whilst listening to an audio explanation including multiple learning styles in one activity. Spanish students also used Tour Creator. After experiencing Machu Picchu, using the 360 camera, they were able to create their own virtual tour of our school using Spanish to inform our virtual visitors.<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/IMG_3484.jpg\" alt=\"introducing the IB to edtech innovators\"><\/p>\n<p>One of the highlights of the event was hearing directly from the students how technology has enhanced their learning experience. Cosmo (G9) joined Halcyon from a traditional bilingual prep school. He shared with the delegation how technology has broadened his understanding of learning and enabled him to be creative in his learning.<\/p>\n<p>Maya (G7) spoke of how the use of technology at Halcyon has positively impacted her wellbeing. She previously used a laptop to assist her in her learning in a school where others did not use technology in the classroom. At Halcyon, her use of technology is no different from that of her peers.<\/p>\n<p>Alice (G6) was tasked with designing her dream school in Design and Makerspace class, using any tool she wished. She created an array of amazing facilities (including a rollercoaster and a swimming pool!) using the educational version of <a href=\"http:\/\/www.minecraft.net\/\" target=\"_blank\" rel=\"noopener\">Minecraft<\/a>.<\/p>\n<p>As the growth of edtech continues, a common area of discussion is the impact this development has on young people. Toby Cann, our Wellbeing Lead, provided an insightful interview into the ways in which we support our students in understanding and navigating the world around them through our Citizenship programme in PSHEE.<\/p>\n<p><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/IMG_5222.jpg\" alt=\"learning in the classroom\"><\/p>\n<p>Thank you to Jon Neale for organising this event. Thank you to our wonderful students Cosmo, Alice and Mia and thank you to our staff who showcased some fantastic learning both in presentations and in the classroom; Stacy Marshall, Ross McGowan, Gareth Jones, Fatima Gonzalez, Sue Dance, Kerry Jenkins and Toby Cann.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are proud to be one of only 50 schools in the UK recognised for our innovative use of education-based technology (edtech) in the classroom. The EdTech50 awards, established by The Education Foundation in 2018 to recognise individuals and businesses for their pioneering contributions to edtech. In May 2019, Halcyon was part of the first [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7277,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,58],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7221"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7221"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7221\/revisions"}],"predecessor-version":[{"id":7338,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7221\/revisions\/7338"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7277"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}