{"id":7224,"date":"2019-05-09T15:40:00","date_gmt":"2019-05-09T15:40:00","guid":{"rendered":"https:\/\/halcyonschool.com\/halcyon-recognised-in-prestigious-edtech-50-awards\/"},"modified":"2021-08-16T09:39:34","modified_gmt":"2021-08-16T09:39:34","slug":"halcyon-recognised-in-prestigious-edtech-50-awards","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/halcyon-recognised-in-prestigious-edtech-50-awards\/","title":{"rendered":"Halcyon recognised in prestigious Edtech 50 awards"},"content":{"rendered":"<p>Fifty schools in the UK, each making meaningful use of educational technology, have been recognised in The Education Foundation’s list of <span style=\"text-decoration: underline; color: #3176bc;\"><a href=\"http:\/\/www.ednfoundation.org\/wp-content\/uploads\/EDTECH-50-SCHOOLS-2019.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: #3176bc; text-decoration: underline;\">Edtech 50 Schools<\/a><\/span>. Each of the fifty selected schools is considered a leader in the use of educational technology in support of teaching and learning. Halcyon London International School, located in Marylebone, is delighted to be included on the Edtech 50 list.<\/p>\n<p><!--more--><\/p>\n<p>Established in 2013, Halcyon is a leader not only in the successful integration of educational technology but also in teaching the International Baccalaureate (IB) programme alongside a comprehensive well-being programme. The school&#8217;s aim is to build digital fluency throughout the community in order that we equally empower all members to access levels of personalised learning and development otherwise unattainable without technological skills.&nbsp;Through carefully planned training,&nbsp;our Digital Learning Leader, <a href=\"https:\/\/twitter.com\/JNealeUK\" target=\"_blank\" style=\"color: #3176bc;\" rel=\"noopener noreferrer\">Jon Neale<\/a> will provide opportunities for the whole community (students, teachers, admin and parents) to develop their skills and understanding.<\/p>\n<p>Every decision at Halcyon is driven with learning at its heart. Like anything else, digital tools are present&nbsp;ONLY if they serve to support and\/or transform what is going on in our classrooms.<\/p>\n<p>When asked about the recognition, Director Barry Mansfield said, “<em>When we opened Halcyon, our intention was to be a leader in the digital field &#8211; to build a creative, integrated digital learning environment. This award recognises that commitment. It is also a fully deserved reward for every one of our dedicated, and very highly skilled, staff.<\/em>”<\/p>\n<p><em>&#8220;Digital tools empower our students to access learning in ways previously unimaginable. Driven by careful conversation with teachers and needs of the wider community, technology is selected that enables all at Halcyon to skilfully navigate an exciting and rapidly changing digital landscape.&#8221;<\/em> said <span style=\"text-decoration: underline; color: #3176bc;\"><a href=\"https:\/\/twitter.com\/jnealeuk\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: #3176bc; text-decoration: underline;\">Jon Neale<\/a><\/span>,&nbsp;Digital Learning Leader at Halcyon.<\/p>\n<p>In 2018, The Education Foundation focused its awards on individuals and companies making a difference in the field of educational technology. This year is the first that schools are eligible for recognition, and to be honoured in this way is particularly meaningful for such an intentionally innovative and progressive young school.<\/p>\n<p>Education Foundation Director, Ty Goddard reflected, “<em>It is a key moment for edtech. Earlier this year, the Secretary of State for Education was clear that the power of technology could provide significant support to help students learn, reduce teachers’ workload and save money. There is great potential for edtech to help make a difference but it needs to be the right technology, implemented effectively, and with good support for staff. The Edtech 50 will celebrate and shine a spotlight on the schools leading the way, across the UK which we hope can inspire other schools.<\/em>”<\/p>\n<p>Edtech 50 Schools is supported by Intel, Jisc, NetSupport and the Independent Schools Council Digital Strategy Group. As one of the awardees, Halcyon will be featured in the Edtech 50 Schools publication and were invited to a reception at The House of Lords.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fifty schools in the UK, each making meaningful use of educational technology, have been recognised in The Education Foundation’s list of Edtech 50 Schools. Each of the fifty selected schools is considered a leader in the use of educational technology in support of teaching and learning. Halcyon London International School, located in Marylebone, is delighted [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7280,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,58],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7224"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7224"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7224\/revisions"}],"predecessor-version":[{"id":7341,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7224\/revisions\/7341"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7280"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7224"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7224"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7224"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}