{"id":7227,"date":"2019-02-08T17:00:00","date_gmt":"2019-02-08T17:00:00","guid":{"rendered":"https:\/\/halcyonschool.com\/making-the-transition-to-halcyon\/"},"modified":"2021-08-16T09:39:58","modified_gmt":"2021-08-16T09:39:58","slug":"making-the-transition-to-halcyon","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/making-the-transition-to-halcyon\/","title":{"rendered":"Making the transition to Halcyon"},"content":{"rendered":"<p>Changing schools &#8211; whether moving across a city or around the world &#8211; can be an exciting, albeit challenging time for any family and student. Transitions can be that much more successful thanks to the support, guidance, and welcome from the new school community. It follows then that your chosen new school’s admissions process, orientation programme, student wellbeing programme, empathetic staff, vibrant parent community, as well as language programmes, must support students and families to transition into their new home in London and their new community. &nbsp;<\/p>\n<p><!--more--><\/p>\n<p><strong>The Personal Approach<\/strong><\/p>\n<p>Halcyon’s admissions staff have created a process that is holistic, personal, and intentional is the first step in the transition to a new school. We actively seek to build strong relationships enabling families to make informed decisions when considering schools for their children. Our admissions process includes a face-to-face or Skype interview with our Director and we are always happy to conduct private tours outside of our <a href=\"https:\/\/halcyonschool.com\/visit\" rel=\"noopener noreferrer\" target=\"_blank\">Open Days<\/a>. This personal approach helps our team to ensure a good fit between family and school and is an important step in ensuring a smooth transition for families who choose Halcyon.<\/p>\n<p>Many families face mid-year relocations, so whether a student joins at the start of the academic year or mid-year, schools must be well-equipped to ensure that every student feels welcomed and is able to settle quickly into the normal rhythm of the school. At Halcyon, mid-year joiners, and their families have an orientation session with our Senior Leadership Team. This time is dedicated to helping families gain a better understanding of teaching and learning within the school and the student wellbeing programme. Each student is also introduced to their Learning Mentor and student buddy.<\/p>\n<p><strong>Breaking Down Language Barriers<\/strong><\/p>\n<p>Transitions to a new country and school can be made easier when a school commits to strong language acquisition and <a href=\"\/blog\/2017\/08\/language-programmes-halcyon\" rel=\"noopener noreferrer\" target=\"_blank\">Mother tongue language programmes<\/a>. We are committed to nurturing an appreciation of the richness and diversity of language. Language does much more than merely promote cognitive growth: it is crucial for developing and maintaining personal cultural identity, international-mindedness and a culture of celebrating difference. The acquisition of more than one language and maintenance of the mother tongue enriches personal growth and helps facilitate international understanding, as well as supporting students maintaining strong links with their home country.<\/p>\n<p><strong>Student Wellbeing<\/strong><\/p>\n<p>Research shows that students are more likely to enjoy learning and reach their social and academic potential when they feel content, safe, and engaged. This is particularly crucial for those students transitioning from one school to another, where their sense of belonging and routine may be disrupted. Our <a href=\"https:\/\/halcyonschool.com\/student-wellbeing\" rel=\"noopener noreferrer\" target=\"_blank\">Wellbeing programme<\/a> provides students with the skills to build and contribute to a shared, secure learning community, where everyone’s qualities are recognised, valued and included. Through our <a href=\"\/blog\/cognitive-coaching\" rel=\"noopener noreferrer\" target=\"_blank\">Cognitive Coaching and Mentoring programmes<\/a>, we proactively develop strong relationships, an enthusiasm for learning new skills and increased emotional adaptability and resilience through conversations. Our young people are encouraged to build a shared learning community, supporting each other and themselves.<\/p>\n<p>Our Family Buddy Programme connects new families with a current family; the programme ensures that each new family is welcomed and gets to know at least one friendly face prior to arriving at Halcyon. Our buddy families have a wealth of knowledge and information about transitioning to London and Halcyon and are able to provide new families and students with further resources, assurance and assistance as they transition to life in London and at Halcyon.<\/p>\n<p>Just as we value the possibility of every student to fulfil their unique potential, we actively nurture the same opportunities for growth for everyone in our community – learning together to build and support our school. Families relocating to London find a welcoming community in our <a href=\"https:\/\/halcyonschool.com\/meet-the-parents\/\" rel=\"noopener noreferrer\" target=\"_blank\">Halcyon Parent Community<\/a> (HPC): an all-parent volunteer organisation. The HPC organise and host a wide variety of Halcyon’s events and social outings. Along with whole school social gatherings, Grade Representatives host termly socials for families within the grade. Some of the parent coordinators also organise professional tours in London, picnics, walks and other fun activities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Changing schools &#8211; whether moving across a city or around the world &#8211; can be an exciting, albeit challenging time for any family and student. Transitions can be that much more successful thanks to the support, guidance, and welcome from the new school community. It follows then that your chosen new school’s admissions process, orientation [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7283,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7227"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7227"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7227\/revisions"}],"predecessor-version":[{"id":7344,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7227\/revisions\/7344"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7283"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7227"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7227"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7227"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}