{"id":7228,"date":"2019-01-21T08:00:00","date_gmt":"2019-01-21T08:00:00","guid":{"rendered":"https:\/\/halcyonschool.com\/news-for-students-by-students\/"},"modified":"2021-08-16T09:40:17","modified_gmt":"2021-08-16T09:40:17","slug":"news-for-students-by-students","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/news-for-students-by-students\/","title":{"rendered":"News For Students, By Students"},"content":{"rendered":"<p>G12 students Beckett and Evy created an Instagram page which translates lengthy news stories from around the world into politically neutral 200-word summaries specifically targeted towards informing young people within 60 seconds. Their goal was to spark discussion and debate within the comments where young people can question and critique what they read in the news.<\/p>\n<p><!--more--><\/p>\n<div>&nbsp;&nbsp;<\/div>\n<div><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/IMG_9103.jpg\" alt=\"IMG_9103\" width=\"300\">&nbsp;<img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/IMG_9105.jpg\" alt=\"IMG_9105\" width=\"294\" style=\"width: 294px;\"><\/div>\n<div>&nbsp;<\/div>\n<div>Although Beckett and Evy have completed previous CAS projects this year, and have therefore already met the requirements for their CAS programme, this project was purely voluntary. They plan to continue it as a side venture after they have left Halcyon.<\/div>\n<p>Beckett and Evy have built a team of over 50 writers and 10 media volunteers. These volunteers are from all over the world, including some Halcyon Alumni, but mostly gathered through networking in their positions on the Board of Directors for the Model United Nations at the International School of the Hague and their years as participants. They manage their team of volunteers with a WhatsApp group and an extensive spreadsheet.<\/p>\n<p>The diagram below shows all the countries (in red) where their writers come from.<\/p>\n<div><img src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/PHOTO-2019-01-10-18-36-08.jpg\" alt=\"PHOTO-2019-01-10-18-36-08\"><\/div>\n<p>Using writers from all over the world allows for niche or local news stories that may not have made it through to consumption internationally, but are important to be aware of. The political neutrality of the news stories makes for a refreshing read, something that Beckett and Evy thought was missing from most of the news of today.<\/p>\n<p>“We have definitely learned a lot of project management and organisation skills. I have learned so much about politics that I wouldn’t have seen without this page,” said Beckett. “Our most ‘wow’ moment was posting about the Darfur genocide. People commented that they had never read about it on their news. We care about creating dialogue and conversation and it&#8217;s nice to have such an engaged community”.<\/p>\n<p>“We try to get a broader knowledge by reading from as many sources as we can. We’ve also learnt about copywriting as we proofread all the articles before they are posted,” said Evy. “I find it so validating to see so many comments on our posts. Our writers enjoy writing about their own country’s issues which makes it more globally focused.”<\/p>\n<p>The page posts on not only modern news but also articles from recent history. They wanted to understand recent history (around the 1980s onwards) that their generation was born into but didn’t have a full understanding of; things that their parents talked about at the dinner table like the Exxon Valdez oil spill and Operation Desert Storm.<\/p>\n<p>Some of the more popular topics they have posted on include what happens when the queen dies, Denmark banning burqas in public and the first transgender competitor on Miss Universe.<\/p>\n<p>Since March 2018 the project has grown to over 13,500 followers who consume around 7 posts a day. They have studied their followers using Instagram Analytics. They were proud to report that 90% of their following is under the age of 34. Their posts are seen over 350,000 times per week (45,000 times a day!). They hope to broaden their readership to even more countries.<\/p>\n<p>Looking at the industry standard, most instagram posts from Media companies receive a 1% engagement rate, whereas Beckett and Evy’s project has a 3% (and growing) engagement rate showing significantly higher levels of discussion.<\/p>\n<p>Halcyon Writers: Beckett, Evy, Maga, Daniel, David<\/p>\n<p>Halcyon Media Manager: Maria<\/p>\n<p>Halcyon Videographer: Lucy<\/p>\n<p>Alumni Writers: Maggie<\/p>\n","protected":false},"excerpt":{"rendered":"<p>G12 students Beckett and Evy created an Instagram page which translates lengthy news stories from around the world into politically neutral 200-word summaries specifically targeted towards informing young people within 60 seconds. Their goal was to spark discussion and debate within the comments where young people can question and critique what they read in the [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7284,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7228"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7228"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7228\/revisions"}],"predecessor-version":[{"id":7345,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7228\/revisions\/7345"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7284"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7228"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7228"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7228"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}