{"id":7229,"date":"2019-01-11T16:41:22","date_gmt":"2019-01-11T16:41:22","guid":{"rendered":"https:\/\/halcyonschool.com\/a-new-creation-at-halcyon-chaos-class\/"},"modified":"2021-08-16T09:40:26","modified_gmt":"2021-08-16T09:40:26","slug":"a-new-creation-at-halcyon-chaos-class","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/a-new-creation-at-halcyon-chaos-class\/","title":{"rendered":"A New creation at Halcyon: Chaos Class"},"content":{"rendered":"<p>In English, 9x have just taken part in something completely innovative and new to Halcyon. Chaos Class is a new unit aimed at promoting student voice and autonomy initiated by Ross McGowan. The class were given almost complete creative control over this unit. They chose the short stories they wanted to study, the Global Context, key concepts, a learner profile attribute and, most importantly, they chose how they wanted to learn. The class voted on each of these elements and decided to study; The Sniper, The Tell-Tale Heart, and All You Zombies. They bravely decided that they wanted to be assessed on all criteria in just the one assessment! <br \/> <!--more--><\/p>\n<p>&#8220;<em>We have had a fantastic response to Chaos Class. The effort put into this unit and the quality that came out at the end are among the highest I have ever seen in an MYP English class.<\/em>&#8221; said Mr. McGowan. <\/p>\n<p>Some great examples of assessed work <a href=\"https:\/\/drive.google.com\/drive\/folders\/1bC6S__VT0ECdkuTfVS9jAFQNvuoIC61k?usp=sharing\" target=\"_blank\" rel=\"noopener\">here<\/a>.<\/p>\n<p>The idea for Chaos Class was created during a staff professional development session on &#8216;Design Thinking&#8217;, a way of coming up with ideas fast and without discussing boundaries such as logistics etc until later on, which originates from how designers innovate. <span><br \/><\/span><\/p>\n<p><!--more--><\/p>\n<p>&#8220;<em>In my opinion, I really enjoyed having the freedom to choose the assessments that we could do and organise how to do the entire unit. I’m new this year, and in my old school, we never had the freedom to include our own opinions when studying a new unit. I really liked the fact that they gave the students the choice of deciding what to do (in my case, for the first time)<\/em>&#8221; Maria, G9.<\/p>\n<p>&#8220;<em>For this Chaos Class unit in English, I was able to work with a partner to create a video and monologue based on &#8216;The Sniper&#8217;. I really enjoyed this unit because I was able to develop my confidence that increased the feeling of achievement as I worked to overcome challenges. I can see that by creating a unit where the students are making choices about what they are interested in, we were able to look to the future at the many ways we will be able to share our passions and interests. In other words, this unit provided us with skills from communicating to creativity that we decided to develop on our own and that is why it was so motivating.<\/em>&#8221; &nbsp;Brooke, G9.<span><br \/><\/span><\/p>\n<p>&#8220;<em>I really enjoyed the Chaos Class unit and I loved creating the videos and monologues. By choosing the short stories, how we were assessed and what we were assessed on, I felt that I was really able to direct my learning. This unit was so fun and I would definitely do it again!<\/em>&#8221; Mia, G9.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In English, 9x have just taken part in something completely innovative and new to Halcyon. Chaos Class is a new unit aimed at promoting student voice and autonomy initiated by Ross McGowan. The class were given almost complete creative control over this unit. They chose the short stories they wanted to study, the Global Context, [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7285,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7229"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7229"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7229\/revisions"}],"predecessor-version":[{"id":7346,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7229\/revisions\/7346"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7285"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7229"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}