{"id":7238,"date":"2018-10-29T11:05:26","date_gmt":"2018-10-29T11:05:26","guid":{"rendered":"https:\/\/halcyonschool.com\/pink-day-2018\/"},"modified":"2021-01-05T10:15:02","modified_gmt":"2021-01-05T10:15:02","slug":"pink-day-2018","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/pink-day-2018\/","title":{"rendered":"Pink Day 2018!"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Pink Day is an annual event organised by the mentor group of Ms Macbean with the goal of raising awareness and money in aid of Breast Cancer Awareness Month. Breast Cancer is an incredibly important issue with one in eight women being diagnosed in their lifetime in the UK alone. We raised money by selling pink ribbons of which funds go to the ‘Pink Ribbon Foundation.’ In previous years, we have organised a walk around Hyde Park but we decided to do something different for Pink Day 2018. <\/span><\/p>\n<p><!--more--><\/p>\n<p><span style=\"font-weight: 400;\">We worked to organise Pink Day for 6 weeks in our mentor group time. We started by looking at ways to change Pink Day from a walk to something more fun and something that would interest more people which is how we decided on rounders and banners. When we had this idea we came up with a brief idea of how the day would work and how we would organise it from start to finish and what materials and people we would need to run the event. When we had this plan finalised we got approval from a variety of staff in order to make sure the event could go ahead and that we would know what other details we needed to consider. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The week before the event we spent selling ribbons and raising awareness of breast cancer and our event. We went to each Mentor Group class and reminded them to buy ribbons and wear pink on Pink Day. We encountered a set back when we found that the class in which we had planned to use for creating the banner was no longer available, but we managed to organise the banner to be created the week before the event. When it came to the day we presented to the school what our event was about and how important it is to raise money for the Pink Ribbon Foundation and explained how the day would unfold. After this, we went to the park early and set up three rounders fields and decided which groups would go where. All the mentor groups arrived in time for a full nine games to be played and for prizes to be given. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Throughout this experience, we have learnt so many new skills such as organisation skills when planning the event and contacting teachers, time management when making sure we had equipment ready for the day, communication when presenting to students and so much more. The whole experience has been very interesting and has taught us both so much. We can’t wait until next year when we can organise Pink Day 2019 and continue to raise awareness, money and plan a great day for Halcyon!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">By Stella (Grade 9) and Vivi (Grade 7)<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pink Day is an annual event organised by the mentor group of Ms Macbean with the goal of raising awareness and money in aid of Breast Cancer Awareness Month. Breast Cancer is an incredibly important issue with one in eight women being diagnosed in their lifetime in the UK alone. We raised money by selling [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":7294,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7238"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7238"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7238\/revisions"}],"predecessor-version":[{"id":7355,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7238\/revisions\/7355"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7294"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7238"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7238"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}