{"id":7243,"date":"2018-10-09T10:24:18","date_gmt":"2018-10-09T10:24:18","guid":{"rendered":"https:\/\/halcyonschool.com\/supporting-grassroots-entrepreneurs\/"},"modified":"2021-08-16T09:42:19","modified_gmt":"2021-08-16T09:42:19","slug":"supporting-grassroots-entrepreneurs","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/supporting-grassroots-entrepreneurs\/","title":{"rendered":"Supporting grassroots entrepreneurs"},"content":{"rendered":"<p><span style=\"font-weight: 400;\"><a href=\"http:\/\/www.handinhandinternational.org\/\" target=\"_blank\" rel=\"noopener\">Hand in Hand International<\/a> is an organisation which has a measurable impact on millions of lives across the globe. Supporting communities worldwide by assisting in the development of small businesses, helping them to thrive and grow.<\/span><\/p>\n<p><!--more--><\/p>\n<p><span style=\"font-weight: 400;\">Throughout last school year and over the summer, Elliot, Evy and Lucia from Grade 12 have worked with an organisation called Hand in Hand International. This charity works to fight poverty by promoting the development of grassroots entrepreneurial skills in impoverished communities globally. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Hand in Hand International model works in several stages; first, members join Self-Help Groups, where they learn about financial discipline, receive business training, and establish group savings where each member contributes a certain amount each time they meet. The group savings are what help fund the business ventures for members of that group, but microloans are also available from Hand in Hand for cases where internal borrowing isn’t sufficient. The final step, once the businesses have been founded, is to help the businesses thrive, by introducing them to larger markets, helping them find more sustainable resources, and\/or improve their branding.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-large wp-image-9227 aligncenter\" src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/Imported_Blog_Media\/0_o_ksxc4cwFkmPs2o-1024x518.jpg\" alt=\"\" width=\"1024\" height=\"518\"><\/p>\n<p><span style=\"font-weight: 400;\">Since its founding, Hand in Hand has been responsible for the creation of 2.4 million businesses boasting 3.6 million jobs, with 2.4 million members participating in their programmes. Currently, they have programmes operating in five different countries and have worked in 14 in their history.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Elliot worked with them for an extended period of time, creating videos for the charity. This involved going through raw footage, taken in East Africa, of the communities helped by Hand in Hand. The purpose of these videos were to explain the story and purpose of Hand in Hand but also to thank the many donors that have helped the charity. These videos are a crucial part of promoting the charity and enhancing their global outreach through social media channels.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Evy worked as an intern for two weeks over the summer, helping to source prizes for an upcoming charity auction for which Hand in Hand is the benefactor. The ACT Foundation is a prestigious group and their auction last year raised around £30 million for their charity partner. Private donors account for around a third of their overall funding, so securing donations through this auction was very important.<\/span><\/p>\n<p><span class=\"il\">Lucia<\/span> worked with them for about a week, her task, which Evy was also involved with, was to help find prices for the upcoming auction dinner which will take place at the end of 2018. Additionally, she worked with Hand in Hand&#8217;s corporate partnerships. Corporate partnerships are partnerships between Hand In Hand international and a commercial entity, where the commercial entity provides resources or money to the fundraising organisation. These type of partnerships are the key to success as they support the organisation to continue their work.<\/p>\n<p><span style=\"font-weight: 400;\">Hand in Hand International is an organisation which has a measurable impact on millions of lives across the globe. Their work is very interesting, and Elliot, Evy and Lucia got invaluable workplace and life experience in their time working with them.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9225 size-large\" src=\"https:\/\/cdn2.hubspot.net\/hubfs\/2990765\/Imported_Blog_Media\/HiH-Intl-RGB-transparent-1024x294.jpg\" alt=\"\" width=\"1024\" height=\"294\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hand in Hand International is an organisation which has a measurable impact on millions of lives across the globe. Supporting communities worldwide by assisting in the development of small businesses, helping them to thrive and grow.<\/p>\n","protected":false},"author":5,"featured_media":7299,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,57],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7243"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=7243"}],"version-history":[{"count":1,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7243\/revisions"}],"predecessor-version":[{"id":7360,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/7243\/revisions\/7360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/7299"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=7243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=7243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=7243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}