{"id":9044,"date":"2021-05-13T12:32:42","date_gmt":"2021-05-13T12:32:42","guid":{"rendered":"https:\/\/halcyonschool.com\/?p=9044"},"modified":"2021-07-08T09:13:17","modified_gmt":"2021-07-08T09:13:17","slug":"wellbeing-team-cambridge-ucl","status":"publish","type":"post","link":"https:\/\/halcyonschool.com\/blog\/wellbeing-team-cambridge-ucl\/","title":{"rendered":"Blakemore Lab visit: Cambridge and UCL researchers work with our Wellbeing Team"},"content":{"rendered":"\n<p>At Halcyon, our Wellbeing Programme is built on the understanding that, in order to thrive as young people and adults, students need to learn a range of skills at school &#8211; social, emotional, and conflict resolution skills, as well as academic and leadership skills. Our Wellbeing Team works to support our students by teaching self, social and emotional understanding, guiding them to develop a toolbox of skills that enable them to navigate obstacles in academia and beyond with adaptability and self-awareness.<\/p>\n\n\n\n<p>The Blakemore Lab &#8211; also known as the <a href=\"https:\/\/sites.google.com\/site\/blakemorelab\/people?authuser=0\" class=\"rank-math-link\" target=\"_blank\" rel=\"noopener\">Developmental Cognitive Neuroscience Group<\/a> &#8211; is based at the Department of Psychology at the University of Cambridge and the UCL Institute of Cognitive Neuroscience in London. Sarah Jane Blakemore, &nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.google.com\/url?q=https%3A%2F%2Fwww.psychol.cam.ac.uk%2Fstaff%2Fprofessor-sarah-jayne-blakemore&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGc441K0H07dgOLZY-4U1DzIEIzcw\" target=\"_blank\">Professor of Psychology and Cognitive Neuroscience at the University of Cambridge<\/a>, stresses that adolescence is a time of “transformation” for everyone: a time when the <a href=\"https:\/\/www.theguardian.com\/books\/2018\/oct\/01\/study-of-teenage-brains-wins-royal-society-prize-inventing-ourselves-sarah-jayne-blakemore\" class=\"rank-math-link\" target=\"_blank\" rel=\"noopener\">brain is going through huge change<\/a>. Teenagers’ brains are busy developing their “sense of self”, which means a heightened state of sensitivity to the actions of their peers &#8211; a natural stage of development that we can support positively through structured social and emotional learning.<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2021\/05\/Newsletter-Images-10.jpg\" alt=\"wellbeing team cambridge ucl\" class=\"wp-image-8793\" width=\"1600\" height=\"650\"\/><\/figure>\n\n\n\n<p><\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p>Dr Gabriele Chierchia and Ms Blanca Piera Pi-Sunyer from the Blakemore Lab conducted some research at&nbsp; Halcyon to examine how social decision-making takes place among teenagers &#8211; and from this, we can better understand how to help young people on a societal level engage in pro-social behaviour, avoid risk-taking, and experience adolescent development positively.&nbsp;<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>Thank you for joining us to share more about this research with our community. How did you come to join the team at the Blakemore Lab?<\/strong><\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>Gabriele:<\/strong> I joined the Blakemore Lab in 2018, trying to understand the developing brain from the perspective of something you could call ‘neuroeconomics’ &#8211; how the mind makes decisions that are efficient.&nbsp;<\/p>\n\n\n\n<p><strong>Blanca:<\/strong> I have a background in social psychology, the social sciences, cognitive development, and neuroscience. I joined the lab to develop my masters thesis, during which I studiedt prosocial behaviour during adolescents and I am currently a research assistant at the lab.<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>What does your ongoing research on social decision-making among teenagers reveal?<\/strong><\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>Gabriele:<\/strong> We see heightened peer influence, and our own experiments indicate that there is truth in this. Generally speaking, adolescence is an important age of social re-orientation during which we emerge from the security of family relations and start spending more time with peers. How others perceive you is very important as an adolescent which might be related to how the social brain develops in this age.&nbsp;<\/p>\n\n\n\n<p><strong>Blanca: <\/strong>Higher peer and social influence could be part of the reason for higher levels of risk-seeking and vulnerability among certain young people. Cross cultural studies have indicated that these developmental impacts are present among young people in all societies across different time periods.<\/p>\n\n\n\n<p>Previous research looking at risk-taking and social influence has compared the choices of adolescents and adults in response to a peer engaging in risky behaviours, but this research has often relied on self-reporting: we hope to build on this.&nbsp;&nbsp;<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>What is the aim of this particular study, which includes an experiment held within Halcyon?<\/strong><\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p>In a previous study with Professor Blakemore, we are looking at how heightened social influence during adolescence &#8211; can be harnessed positively (Chierchie, Piera Pi-Sunyer &amp; Blakemore, 2020). We looked at how young people may change their decisions when they see costly pro social behaviours.&nbsp;<\/p>\n\n\n\n<p>In this new experiment we look at&nbsp; how we act when we are presented with the choice to make a risky decision as an individual, and how we act when we make a decision that is voted for within a group. We’re looking at how decisions are reached from an ecological point of view: taking a look at peoples’ behaviour in relation to collective decisions. Approximately 200 people are participating in this study.<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>What kind of assumptions will this research challenge, and what kind of impact could this have?<\/strong><\/p>\n\n\n\n<p><strong>Gabriele: <\/strong>Adolescents are stereotypically portrayed as selfish, so it’s great to challenge &nbsp;and examine this further with Professor Blakemore in the Blakemore Lab. Looking at social decision making can help us understand how risk taking&nbsp; behaviour takes place &#8211; and this knowledge can in fact help us positively change behaviour across society, or decrease the deterimental effects of collective risk-taking.&nbsp;<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><strong>We’re really excited to be a part of this. To conclude our interview, can you share an insight into the background of the Blakemore Lab, and why its work is so pioneering?&nbsp;<\/strong><\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<p><\/p>\n\n\n\n<p><strong>Gabriele:<\/strong> Adolescence is an age of significant change. Until Professor Blakemore’s research became prominent in psychology, the narrative was that neuroplasticity is limited to childhood, followed by a kind of unexplained ‘gap’ that lasts until adulthood. Adolescence is a very important period which brings individuals great opportunities in terms of social cognition.&nbsp;<\/p>\n\n\n\n<p><strong>Blanca:<\/strong> More than half of socioemotional disorders emerge in adolescence &#8211; our&nbsp; research is also important to mental health. We want to use the work in the Blakemore Lab as a model for neuroplasticity in adolescents, which can also be used to help understand risk and resilience to mental health disorders that emerge during this period<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><br>You can read Dr Gabriele Chierchia, Dr Sarah-Jayne Blakemore, and Ms Blanca Piera Pi-Sunyer’s paper on prosocial influence <a href=\"https:\/\/journals.sagepub.com\/doi\/full\/10.1177\/0956797620957625\" target=\"_blank\" rel=\"noopener\">here<\/a>.<\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<h2>Wellbeing at Halcyon<\/h2>\n\n\n<p>&nbsp;<\/p>\n\n\n<p>Read more about Social and Emotional Learning at Halcyon: <a href=\"https:\/\/halcyonschool.com\/wellbeing\" class=\"rank-math-link\">Wellbeing<\/a> <\/p>\n\n\n<p>&nbsp;<\/p>\n\n\n<strong>Subscribe to hear more updates on our curriculum, facilities, team and more:<strong> \n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"2990765\",\n\tformId: \"db130e02-0e7d-4d18-9c03-c23e70a22958\"\n});\n<\/script>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>At Halcyon, our Wellbeing Programme is built on the understanding that, in order to thrive as young people and adults, students need to learn a range of skills at school &#8211; social, emotional, and conflict resolution skills, as well as academic and leadership skills. Our Wellbeing Team works to support our students by teaching self, [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":9050,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[37,18],"tags":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/9044"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=9044"}],"version-history":[{"count":5,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/9044\/revisions"}],"predecessor-version":[{"id":9208,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/posts\/9044\/revisions\/9208"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media\/9050"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=9044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/categories?post=9044"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/tags?post=9044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}