{"id":3427,"date":"2020-10-07T17:08:27","date_gmt":"2020-10-07T17:08:27","guid":{"rendered":"https:\/\/halcyonschool.com\/?page_id=3427"},"modified":"2024-02-29T14:35:42","modified_gmt":"2024-02-29T14:35:42","slug":"legal","status":"publish","type":"page","link":"https:\/\/halcyonschool.com\/legal\/","title":{"rendered":"Legal"},"content":{"rendered":"\n\n<!-- hero -->\n<section class=\"subpage-hero-section\" style=\"background: url('https:\/\/halcyonschool.com\/wp-content\/uploads\/2020\/11\/Halcyoncampus-7-2.jpg') center center no-repeat; background-size:cover;background-color: rgba(0,0,0,0.4); background-blend-mode: overlay;\">\n    <div class=\"container-fluid\">\n        <div class=\"row\">\n            <div class=\"col-lg-10 offset-lg-1\">\n               <h1 data-aos=\"fade-up\" class=\"subpage-hero-h\" style=\"color:#FFFFFF\">Legal<\/h1>\n            <\/div>\n        <\/div>\n  <\/div>\n<\/section>\n\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<section class=\"general-content\" >\n    <div class=\"container\">\n        <div id=\"lorem-content-band-1\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Ofsted report<\/h2>\n<p>&nbsp;<\/p>\n<p>Halcyon London International School was inspected by Ofsted on 3-5 March 2020. The full report can be viewed <a href=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2020\/11\/10122996-Halcyon-London-International-School-Published-Report.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div id=\"lorem-content-band-2\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Personal information and Data Protection<\/h2>\n<p>&nbsp;<\/p>\n<p>The personal data you supply to Halcyon London International School will only be used in connection with your application for a school place. It will be held securely in line with the Data Protection Act.<\/p>\n<p>Data Protection Act: Halcyon is registered with the Information Commissioner’s Office. Registration number: Z3550003.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div id=\"lorem-content-band-3\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Third party disclosure<\/h2>\n<p>We may share your personal data with third parties if we have a legal obligation to do so.  We may share your personal data if we sell or buy any business or assets, in which case we may disclose your personal data to the prospective seller or buyer of such business or assets.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div id=\"lorem-content-band-4\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Cookies and technology<\/h2>\n<p>&nbsp;<\/p>\n<p>We use cookies to enable us to gather statistics regarding usage to improve and develop this site.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div id=\"lorem-content-band-5\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Admissions statement<\/h2>\n<p>&nbsp;<\/p>\n<p>Halcyon London International School is a non-denominational school and does not discriminate against any individual in any way on the basis of age, race, colour, gender, disability, sexual orientation, religion or belief, ethnic or national origin in the administration of its recruitment, admissions, and educational policies.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n<div id=\"lorem-content-band-6\" class=\"lorem-content-band vc\">\n<div class=\"lorem-column vc whole\" data-fade=\"true\" data-fade-animation=\"in-from-bottom\">\n<h2>Complaints<\/h2>\n<p>&nbsp;<\/p>\n<p>Halcyon London International School has a Complaints Procedure. The number of complaints registered under the formal procedure during the preceding school year is: 1.<\/p>\n<\/div>\n<\/div>\n    <\/div>\n<\/section>\n\n\n\n\n<section class=\"general-content\" >\n    <div class=\"container\">\n        <h2>Privacy Policy<\/h2>\n<p>&nbsp;<\/p>\n<p>This privacy policy applies between you, the User of this Website and Halcyon London International School, the owner and provider of this Website. Halcyon London International School takes the privacy of your information very seriously. This privacy policy applies to our use of any and all Data collected by us or provided by you in relation to your use of the Website. Please read this privacy policy carefully.<\/p>\n<p>&nbsp;<\/p>\n<div id=\"privacy_policy\" class=\"lorem-content-band vc\">\n<h2>Definitions and Interpretations<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>In this privacy policy, the following definitions are used:<\/li>\n<\/ol>\n<table>\n<tbody>\n<tr>\n<td><b>Data<\/b><\/td>\n<td>collectively all information that you submit to Halcyon London International School via the Website. This definition incorporates, where applicable, the definitions provided in The General Data Protection (GDPR) EU 2016\/679.<\/td>\n<\/tr>\n<tr>\n<td><b>Cookies<\/b><\/td>\n<td>a small text file placed on your computer by this Website when you visit certain parts of the Website and\/or when you use certain features of the Website. Details of the cookies used by this Website are set out in the clause below (<b>Cookies<\/b>);<\/td>\n<\/tr>\n<tr>\n<td><b>Halcyon London International School,<\/b> or <b>us<\/b><\/td>\n<td>Halcyon London International School, a company incorporated in England and Wales with registered number 33 whose registered office is at Seymour Place, London, W1H 5AU;<\/td>\n<\/tr>\n<tr>\n<td><b>UK and EU Cookie Law<\/b><\/td>\n<td>the Privacy and Electronic Communications (EC Directive) Regulations 2003 as amended by the Privacy and Electronic Communications (EC Directive) (Amendment) Regulations 2011;<\/td>\n<\/tr>\n<tr>\n<td><b>User<\/b> or <b>you<\/b><\/td>\n<td>any third party that accesses the Website and is not either (i) employed by Halcyon London International School and acting in the course of their employment or (ii) engaged as a consultant or otherwise providing services to Halcyon London International School and accessing the Website in connection with the provision of such services; and<\/td>\n<\/tr>\n<tr>\n<td><b>Website<\/b><\/td>\n<td>the website that you are currently using, halcyonschool.com, and any sub-domains of this site unless expressly excluded by their own terms and conditions.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<ol>\n<li>In this privacy policy, unless the context requires a different interpretation:<\/li>\n<\/ol>\n<ul>\n<li>the singular includes the plural and vice versa;<\/li>\n<li>references to sub-clauses, clauses, schedules or appendices are to sub-clauses, clauses, schedules or appendices of this privacy policy;<\/li>\n<li>a reference to a person includes firms, companies, government entities, trusts and partnerships;<\/li>\n<li>“including” is understood to mean “including without limitation”;<\/li>\n<li>reference to any statutory provision includes any modification or amendment of it;<\/li>\n<li>the headings and sub-headings do not form part of this privacy policy<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2>Scope of this privacy policy<\/h2>\n<ol>\n<li>This privacy policy applies only to the actions of Halcyon London International School and Users with respect to this Website. It does not extend to any websites that can be accessed from this Website including, but not limited to, any links we may provide to social media websites.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Data collected<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>We may collect the following Data, which includes personal Data, from you:\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>name<\/li>\n<li>date of birth;<\/li>\n<li>gender;<\/li>\n<li>job title;<\/li>\n<li>profession;<\/li>\n<li>contact information such as email addresses and telephone numbers;<\/li>\n<li>demographic information such as postcode, preferences and interests;<\/li>\n<li>IP address (automatically collected);<\/li>\n<li>web browser type and version (automatically collected);<\/li>\n<li>operating system (automatically collected);<\/li>\n<li>a list of URLs starting with a referring site, your activity on this Website, and the site you exit to (automatically collected);<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>In each case, in accordance with this privacy policy.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<div id=\"privacy_policy\" class=\"lorem-content-band vc\">\n<h2>Our use of data<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>For purposes of The General Data Protection Act (GDPR) EU 2016\/679, Halcyon London International School is the “data controller”.<\/li>\n<li>We will retain any Data you submit in accordance with our guidelines for establishing legitimate interest.<\/li>\n<li>Unless we are obliged or permitted by law to do so, and subject to any third party disclosures specifically set out in this policy, your Data will not be disclosed to third parties. This includes our affiliates and \/ or other companies within our group.<\/li>\n<li>All personal Data is stored securely in accordance with the principles of The General Data Protection Act (GDPR) EU 2016\/679 . For more details on security see the clause below.<\/li>\n<li>Any or all of the above Data may be required by us from time to time in order to provide you with the best possible service and experience when using our Website. Specifically, Data may be used by us for the following reasons:\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>internal record keeping;<\/li>\n<li>transmission by email of promotional materials that may be of interest to you;<\/li>\n<li>admissions processes;<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>in each case, in accordance with this privacy policy.<\/p>\n<p>&nbsp;<\/p>\n<h2>Third party websites and services<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>Halcyon London International School may, from time to time, employ the services of other parties for dealing with certain processes necessary for the operation of the Website. The providers of such services have access to certain personal Data provided by Users of this Website.<\/li>\n<li>Any Data used by such parties is used only to the extent required by them to perform the services that we request. Any use for other purposes is strictly prohibited. Furthermore, any Data that is processed by third parties will be processed within the terms of this privacy policy and in accordance with The General Data Protection Act (GDPR) EU 2016\/679 .<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Links to other websites<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>This Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This privacy policy does not extend to your use of such websites. You are advised to read the privacy policy or statement of other websites prior to using them.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Changes of business ownership and control<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>Halcyon London International School may, from time to time, expand or reduce our business and this may involve the sale and\/or the transfer of control of all or part of Halcyon London International School. Data provided by Users will, where it is relevant to any part of our business so transferred, be transferred along with that part and the new owner or newly controlling party will, under the terms of this privacy policy, be permitted to use the Data for the purposes for which it was originally supplied to us.<\/li>\n<li>We may also disclose Data to a prospective purchaser of our business or any part of it.<\/li>\n<li>In the above instances, we will take steps with the aim of ensuring your privacy is protected.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Controlling use of your data<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>Wherever you are required to submit Data, you will be given options to restrict our use of that Data. This may include the following:\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>use of Data for direct marketing purposes; and<\/li>\n<li>sharing Data with third parties.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Functionality of the website<\/h2>\n<ol>\n<li>To use all features and functions available on the Website, you may be required to submit certain Data.<\/li>\n<li>You may restrict your internet browser’s use of Cookies. For more information see the clause below (<b>Cookies<\/b>).<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Accessing your own data<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>You have the right to ask for a copy of any of your personal Data held by Halcyon London International School (where such Data is held).<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Security<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>Data security is of great importance to Halcyon London International School and to protect your Data we have put in place suitable physical, electronic and managerial procedures to safeguard and secure Data collected via this Website.<\/li>\n<li>If password access is required for certain parts of the Website, you are responsible for keeping this password confidential.<\/li>\n<li>We endeavour to do our best to protect your personal Data. However, transmission of information over the internet is not entirely secure and is done at your own risk. We cannot ensure the security of your Data transmitted to the Website.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Cookies<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>This Website may place and access certain Cookies on your computer. Halcyon London International School uses Cookies to improve your experience of using the Website. Halcyon London International School has carefully chosen these Cookies and has taken steps to ensure that your privacy is protected and respected at all times.<\/li>\n<li>All Cookies used by this Website are used in accordance with current UK and EU Cookie Law.<\/li>\n<li>Should you block cookies (in your browser) certain features of the Website may not function fully or as intended<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Type\/Purpose of Cookies<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li>Analytical\/performance cookies<br \/>\nThey allow us to recognise and count the number of visitors and to see how visitors move around our website when they are using it. This helps us to improve the way our website works, for example, by ensuring that users are finding what they are looking for easily.<\/li>\n<li>You can choose to enable or disable Cookies in your internet browser. By default, most internet browsers accept Cookies but this can be changed. For further details, please consult the help menu in your internet browser.<\/li>\n<li>You can choose to delete Cookies at any time; however you may lose any information that enables you to access the Website more quickly and efficiently including, but not limited to, personalisation settings.<\/li>\n<li>It is recommended that you ensure that your internet browser is up-to-date and that you consult the help and guidance provided by the developer of your internet browser if you are unsure about adjusting your privacy settings.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>General<\/h2>\n<\/div>\n<p>&nbsp;<\/p>\n<div id=\"privacy_policy\" class=\"lorem-content-band vc\">\n<ol>\n<li>You may not transfer any of your rights under this privacy policy to any other person. We may transfer our rights under this privacy policy where we reasonably believe your rights will not be affected.<\/li>\n<li>If any court or competent authority finds that any provision of this privacy policy (or part of any provision) is invalid, illegal or unenforceable, that provision or part-provision will, to the extent required, be deemed to be deleted, and the validity and enforceability of the other provisions of this privacy policy will not be affected.<\/li>\n<li>Unless otherwise agreed, no delay, act or omission by a party in exercising any right or remedy will be deemed a waiver of that, or any other, right or remedy.<\/li>\n<li>This Agreement will be governed by and interpreted according to the law of England and Wales. All disputes arising under the Agreement will be subject to the exclusive jurisdiction of the English and Welsh courts.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<h2>Changes to this privacy policy<\/h2>\n<p>Halcyon London International School reserves the right to change this privacy policy as we may deem necessary from time to time or as may be required by law. Any changes will be immediately posted on the Website and you are deemed to have accepted the terms of the privacy policy on your first use of the Website following the alterations. You may contact Halcyon London International School by email at <a href=\"mailto:tech@halcyonschool.com\">tech@halcyonschool.com<\/a>.<\/p>\n<p>25 May 2018<\/p>\n<\/div>\n    <\/div>\n<\/section>\n\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":76,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/3427"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=3427"}],"version-history":[{"count":46,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/3427\/revisions"}],"predecessor-version":[{"id":18655,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/3427\/revisions\/18655"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=3427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}