{"id":5590,"date":"2020-11-05T10:29:19","date_gmt":"2020-11-05T10:29:19","guid":{"rendered":"https:\/\/halcyonschool.com\/?page_id=5590"},"modified":"2021-11-30T15:03:42","modified_gmt":"2021-11-30T15:03:42","slug":"fundamental-british-values","status":"publish","type":"page","link":"https:\/\/halcyonschool.com\/fundamental-british-values\/","title":{"rendered":"Fundamental British Values"},"content":{"rendered":"\n\n<!-- hero -->\n<section class=\"subpage-hero-section\" style=\"background: url('https:\/\/halcyonschool.com\/wp-content\/uploads\/2020\/11\/Halcyoncampus-116-2.jpg') center center no-repeat; background-size:cover;background-color: rgba(0,0,0,0.4); background-blend-mode: overlay;\">\n    <div class=\"container-fluid\">\n        <div class=\"row\">\n            <div class=\"col-lg-10 offset-lg-1\">\n               <h1 data-aos=\"fade-up\" class=\"subpage-hero-h\" style=\"color:#FFFFFF\">Fundamental British Values<\/h1>\n            <\/div>\n        <\/div>\n  <\/div>\n<\/section>\n\n\n\n\n<section class=\"general-content\" >\n    <div class=\"container\">\n        <p>Through our Personal, Social, Health, and Economic Education (PSHEE) programme, spiritual, moral, social and cultural (SMSC) development is a mandatory teaching requirement in all schools in England. SMSC education is also the vehicle through which we teach Fundamental British Values (FBV). One might also conceive of this as citizenship education. A key part of the IB mission is that students strive to be ‘active, compassionate and lifelong learners… who help to create a better and more peaceful world through intercultural understanding and respect’.<\/p>\n<h3>Spiritual, moral, social and cultural development includes:<\/h3>\n<p>&#8211; Exploring beliefs and experience; respecting faiths, feelings and values; enjoying learning about oneself, others and the surrounding world; using imagination and creativity; reflecting.<\/p>\n<p>&#8211; Recognising right and wrong; respecting the law; understanding consequences; investigating moral and ethical issues; offering reasoned views.<\/p>\n<p>&#8211; Using a range of social skills; participating in the local community; appreciating diverse viewpoints; participating, volunteering and cooperating; resolving conflict; engaging with the &#8216;British values&#8217; of democracy, the rule of law, liberty, respect and tolerance.<\/p>\n<p>&#8211; Appreciating cultural influences; appreciating the role of Britain&#8217;s parliamentary system; participating in cultural opportunities; understanding, accepting, respecting and celebrating diversity.<\/p>\n    <\/div>\n<\/section>\n\n\n\n\n<section class=\"text-wrap\">\n  <div class=\"container-fluid\">\n    <div class=\"row\">\n        <div class=\"col-lg-10 offset-lg-1\" data-aos=\"fade-up\">\n        <div class=\"row\">          \n           \n          <div class=\"col-lg-6\">\n                        <div>\n                <img src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2020\/11\/fbv-1.jpg\" alt=\"\">\n            <\/div>\n             \n            <div class=\"text-box\">\n              <h4 class=\"section-h smaller-h teal\">Bletchley Manor Visit<\/h4>\n              <p class=\"section-p\">Grade 8 students explored Bletchely Manor on our Community Day in 2018.<\/p>\n            <\/div>\n          <\/div>\n           \n          <div class=\"col-lg-6\">\n             \n            <div class=\"text-box\">\n              <h4 class=\"section-h smaller-h teal\">What did the students learn?<\/h4>\n              <p class=\"section-p\">Halcyon&#8217;s biannual Community Days offer each grade group the opportunity to visit a different site in London to learn more about the richness of British cultural history. Grade 8 students visited Bletchely Manor to learn about the role of codebreakers who stayed on British territory during World War Two. <br><br>Bletchley Park was once the top-secret home of the World War Two Codebreakers from 1938. The codebreaking team successfully cracked the codes of German Army administration, German Airforce and later Italian and Japanese military. This produced vital intelligence in support of Allied military operations on land, at sea, and in the air during World War Two. Students explored the restored codebreaking huts and learned the story of the codebreaking teams, 75% of whom were women.  <\/p>\n            <\/div>\n          <\/div>\n                     \n        <\/div>\n      <\/div>\n    <\/div>\n  <\/div>\n<\/section>\n\n\n\n\n<section class=\"general-content\" >\n    <div class=\"container\">\n        <h3>Fundamental British Values are defined as follows:<\/h3>\n<p>&#8211; enabling students to develop their self-knowledge, self-esteem and self-confidence;<\/p>\n<p>&#8211; enabling students to distinguish right from wrong and to respect the civil and criminal law of England;<\/p>\n<p>&#8211; encouraging students to accept responsibility for their behaviour, show initiative, and to understand how they can contribute positively to the lives of those living and working in the locality of the school and to society more widely;<\/p>\n<p>&#8211; enabling students to acquire a broad general knowledge of and respect for public institutions and services in England;<\/p>\n<p>&#8211; furthering tolerance and harmony between different cultural traditions by enabling students to acquire an appreciation of and respect for their own and other cultures;<\/p>\n<p>&#8211; encouraging respect for other people; and<\/p>\n<p>&#8211; encouraging respect for democracy and support for participation in the democratic processes, including respect for the basis on which the law is made and applied in England.<\/p>\n    <\/div>\n<\/section>\n\n\n\n\n<section class=\"text-wrap\">\n  <div class=\"container-fluid\">\n    <div class=\"row\">\n        <div class=\"col-lg-10 offset-lg-1\" data-aos=\"fade-up\">\n        <div class=\"row\">          \n           \n          <div class=\"col-lg-6\">\n                        <div>\n                <img src=\"https:\/\/halcyonschool.com\/wp-content\/uploads\/2020\/11\/IMG_2929-e1606497463855.jpg\" alt=\"\">\n            <\/div>\n             \n            <div class=\"text-box\">\n              <h4 class=\"section-h smaller-h teal\">Community Day 2019<\/h4>\n              <p class=\"section-p\">Each grade explored a different site in London for one of our Community Days in 2019.<\/p>\n            <\/div>\n          <\/div>\n           \n          <div class=\"col-lg-6\">\n             \n            <div class=\"text-box\">\n              <h4 class=\"section-h smaller-h teal\">What did the students learn?<\/h4>\n              <p class=\"section-p\">On October 14 2019, our students explored London’s rich cultural history through Community Day trips; our school-wide excursion based on broadening our community’s understanding of British Fundamental Values. <br><br>From Grade 9’s tour of street art in Shoreditch (pictured above) to Grade 8’s slightly muddier adventure in the Chiswick Thames Explorer Centre, all our students engaged with the exciting mix of art, nature, and people that comes together to make London. \r\n<br><br>\r\nWhile our busy Diploma Programme students had Theory of Knowledge presentations (Grade 12) and IBDP Group 4 Projects to concentrate on, they were nonetheless able to breathe some fresh inspiration into their work by collaborating outside of school at the New College of the Humanities and in a classroom near Covent Garden.<\/p>\n            <\/div>\n          <\/div>\n                     \n        <\/div>\n      <\/div>\n    <\/div>\n  <\/div>\n<\/section>\n\n\n\n\n<section class=\"general-content\" >\n    <div class=\"container\">\n        <h3>Fundamental British Values learning outcomes would be:<\/h3>\n<p>&#8211; an understanding of how citizens can influence decision-making through the democratic process<\/p>\n<p>&#8211; an appreciation that living under the rule of law protects individual citizens and is essential for their wellbeing and safety<\/p>\n<p>&#8211; an understanding that there is a separation of power between the executive and the judiciary, and that while some public bodies such as the police and the army can be held to account through Parliament, others such as the courts maintain independence<\/p>\n<p>&#8211; an understanding that the freedom to choose and hold other faiths and beliefs is protected in law<\/p>\n<p>&#8211; an acceptance that other people having different faiths or beliefs to oneself (or having none) should be accepted and tolerated, and should not be the cause of prejudicial or discriminatory behaviour<\/p>\n<p>&#8211; an understanding of the importance of identifying and combating discrimination<\/p>\n    <\/div>\n<\/section>\n\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":60,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/5590"}],"collection":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/comments?post=5590"}],"version-history":[{"count":37,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/5590\/revisions"}],"predecessor-version":[{"id":11534,"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/pages\/5590\/revisions\/11534"}],"wp:attachment":[{"href":"https:\/\/halcyonschool.com\/wp-json\/wp\/v2\/media?parent=5590"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}